Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: de, ga, it, ja, pl, zh_cn

source: A list of files to share. Default: []
de: Eine Liste von Dateien, die freigegeben werden sollen. Standard: []
ga: Liosta de na comhaid le roinnt. Réamhshocraithe: []
it: Un elenco di file da condividere. Predefinito: []

source: Whether to log URL requests to stdout when using the CLI tool. Default: false
de: Ob URL-Anfragen nach stdout protokolliert werden sollen, wenn das CLI-Tool verwendet wird. Standard: false
ga: Cibé acu iarratais URL a logáil chuig stdout agus an uirlis CLI á úsáid agat. Réamhshocraithe: bréagach
it: Se registrare le richieste URL su stdout quando si usa lo strumento CLI. Predefinito: false

source: receive
ga: glacadh

source: data_dir
ga: sonraí_dir

source: The path where received files or text messages will be stored. Default: the 'OnionShare' folder of the user's home directory.
de: Der Pfad, in dem die empfangenen Dateien oder Textnachrichten gespeichert werden. Standard: der Ordner 'OnionShare' im Home-Verzeichnis des Benutzers.
ga: Stórálfar an cosán ina bhfuarthas comhaid nó teachtaireachtaí téacs. Réamhshocraithe: an fillteán 'OnionShare' d'eolaire baile an úsáideora.
it: Il percorso in cui verranno memorizzati i file o i messaggi di testo ricevuti. Predefinito: la cartella “OnionShare” della home directory dell'utente.

source: webhook_url
ga: cuaille_gréasáin_url

source: A webhook URL that OnionShare will POST to when it receives files or text messages. Default: null
de: Eine Webhook-URL, an die OnionShare POSTen wird, wenn es Dateien oder Textnachrichten empfängt. Standard: null
ga: URL webhook a chuirfidh OnionShare POST air nuair a fhaigheann sé comhaid nó teachtaireachtaí téacs. Réamhshocraithe: null
it: URL di webhook a cui OnionShare invierà un POST quando riceve file o messaggi di testo. Predefinito: null

source: disable_text
ga: téacs_míchumasaithe

source: Whether to disable receiving text messages. Default: false
de: Ob der Empfang von Textnachrichten deaktiviert werden soll. Standard: false
ga: Cibé acu teachtaireachtaí téacs a fháil a dhíchumasú Réamhshocraithe: bréagach
it: Disabilita la ricezione dei messaggi di testo. Predefinito: falso

source: disable_files
ga: comhaid neamhdhíchumasaithe

source: Whether to disable receiving files. Default: false
de: Ob der Empfang von Dateien deaktiviert werden soll. Standard: false
ga: Cibé acu comhaid glacadh a dhíchumasú. Réamhshocraithe: bréagach
it: Disabilita la ricezione dei file. Predefinito: falso

source: website
ga: láithreán gréasáin

source: disable_csp
ga: cumasach_csp

source: If set to ``true``, OnionShare won't set its default Content Security Policy header for the website. Default: ``false``
de: Wenn diese Option auf ``true`` gesetzt ist, wird OnionShare seinen Standard Content Security Policy Header für die Website nicht setzen. Voreinstellung: ``false``
ga: Má tá sé socraithe ar ``true``, ní shocróidh OnionShare a cheannteideal réamhshocraithe Polasaí Slándála Ábhar don láithreán gréasáin. Réamhshocraithe: ``bréag``
it: Se impostato su ``true``, OnionShare non imposterà l'intestazione predefinita Content Security Policy per il sito web. Valore predefinito: ``false``

source: custom_csp
ga: saincheaptha_csp

source: A custom Content Security Policy header to send instead of the default.
de: Eine benutzerdefinierte Content-Security-Policy-Kopfzeile, die anstelle des Standards gesendet wird.
ga: Ceanntásc saincheaptha Polasaí Slándála Ábhar le seoladh in ionad an réamhshocrai.
it: Un'intestazione personalizzata dei criteri di sicurezza dei contenuti da inviare al posto di quella predefinita.

source: chat
ga: comhrá

source: There are currently no configurable settings for the Chat mode.
de: Derzeit gibt es keine konfigurierbaren Einstellungen für den Chat-Modus.
ga: Faoi láthair níl aon socruithe inchumraithe don mhodh Comhrá.
it: Attualmente non ci sono impostazioni configurabili per la modalità Chat.
