Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: de, ga, it, ja, pl, zh_cn

source: The way in which OnionShare connects to Tor. Valid options are 'bundled', 'automatic' (use Tor Browser's Tor connection), 'control_port' or 'socket_file'. Default: 'bundled'
de: Die Art und Weise, wie sich OnionShare mit Tor verbindet. Gültige Optionen sind 'bundled', 'automatic' (benutzt die Tor-Verbindung des Tor-Browsers), 'control_port' oder 'socket_file'. Standard: 'bundled'
ga: An bealach a nascann OnionShare le Tor. Is iad na roghanna bailí 'cuinneall', 'uathoibríoch' (bain úsáid as nasc Tor Brabhsálaí Tor), 'control_port' nó 'socket_file'. Réamhshocraithe: 'cuinneáilte'
it: Il modo in cui OnionShare si connette a Tor. Le opzioni valide sono “bundled”, “automatic” (usa la connessione Tor del browser Tor), ‘control_port’ o “socket_file”. Valore predefinito: ‘bundled’

source: control_port_address
ga: seoladh rialaithe_port

source: The IP address of Tor's Control port, if ``connection_type`` is set to 'control_port'. Default: '127.0.0.1'
de: Die IP-Adresse des Control-Ports von Tor, wenn ``connection_type`` auf 'control_port' gesetzt ist. Voreinstellung: '127.0.0.1'
ga: Seoladh IP calafort Rialaithe Tor, má tá ``connection_type`` socraithe go 'control_port'. Réamhshocraithe: '127.0.0.1'
it: L'indirizzo IP della porta di controllo di Tor, se il ``connection_type`` è impostato su 'control_port’. Predefinito: “127.0.0.1”

source: control_port_port
ga: calafort rialaitheoireachta

source: ``integer``
ga: ``iomlána``

source: The port number of Tor's Control port, if ``connection_type`` is set to 'control_port'. Default: '9051'
de: Die Portnummer des Control Ports von Tor, wenn ``connection_type`` auf 'control_port' gesetzt ist. Voreinstellung: '9051'
ga: Uimhir chalafort calafort Rialaithe Tor, má tá ``connection_type`` socraithe go 'control_port'. Réamhshocraithe: '9051'
it: Il numero della porta di controllo di Tor, se il ``connection_type`` è impostato su 'control_port'. Predefinito: '9051'

source: socks_address
ga: seoladh stocks_

source: The IP address of Tor's SOCKS proxy, if ``connection_type`` is set to 'control_port' or 'socket_file'. Default: '127.0.0.1'
de: Die IP-Adresse des SOCKS-Proxys von Tor, wenn ``connection_type`` auf 'control_port' oder 'socket_file' gesetzt ist. Standard: '127.0.0.1'
ga: Seoladh IP seachfhreastalaí SOCKS Tor, má tá ``connection_type`` socraithe go 'control_port' nó 'socket_file'. Réamhshocraithe: '127.0.0.1'
it: Il numero della porta di controllo di Tor, se il ``connection_type`` è impostato su 'control_port’. Predefinito: “9051”

source: socks_port
ga: calafort soicíní

source: The port number of Tor's SOCKS proxy, if ``connection_type`` is set to 'control_port' or 'socket_file'. Default: ''9050'
de: Die Portnummer des SOCKS-Proxys von Tor, wenn ``connection_type`` auf 'control_port' oder 'socket_file' gesetzt ist. Voreinstellung: ''9050''
ga: Uimhir chalafoirt seachfhreastalaí SOCKS Tor, má tá ``connection_type`` socraithe go 'control_port' nó 'socket_file'. Réamhshocraithe: “9050'
it: Il numero di porta del proxy SOCKS di Tor, se ``connection_type`` è impostato su 'control_port’ o 'socket_file'. Predefinito: ''9050'

source: socket_file_path
ga: soicet_file_path

source: The path to Tor's socket file, if ``connection_type`` is set to 'socket_file'. Default: '/var/run/tor/control'
de: Der Pfad zur Socket-Datei von Tor, wenn ``connection_type`` auf 'socket_file' gesetzt ist. Voreinstellung: '/var/run/tor/control'
ga: An cosán chuig comhad soicéad Tor, má tá ``connection_type`` socraithe go 'socket_file'. Réamhshocraithe: '/var/run/tor/control'
it: Il percorso del file socket di Tor, se ``connection_type`` è impostato su 'socket_file’. Predefinito: “/var/run/tor/control”

source: auth_type
ga: cineál_auth_

source: If access to Tor's control port requires a password, this can be set to 'password', otherwise 'no_auth'. Default: 'no_auth'
de: Wenn der Zugriff auf den Tor- Control-Port ein Passwort erfordert, kann dies auf 'password' gesetzt werden, ansonsten auf 'no_auth'. Voreinstellung: 'no_auth'
ga: Má theastaíonn pasfhocal ó rochtain ar chalafort rialaithe Tor, is féidir é seo a shocrú go 'pasfhocal', ar shlí eile 'no_auth'. Réamhshocraithe: 'no_auth'
it: Se l'accesso alla porta di controllo di Tor richiede una password, si può impostare ‘password’, altrimenti ‘no_auth’. Predefinito: “no_auth”

source: If access to Tor's control port requires a password, and ``auth_type`` is set to 'password', specify the password here. Default: ''
de: Wenn der Zugriff auf den Tor- Control-Port ein Passwort erfordert und ``auth_type`` auf 'password' gesetzt ist, gib das Passwort hier an. Voreinstellung: ''
ga: Má theastaíonn pasfhocal ó rochtain ar chalafort rialaithe Tor, agus má tá ``auth_type`` socraithe go 'pasfhocal', sonraigh an pasfhocal anseo. Réamhshocraithe:”
it: Se l'accesso alla porta di controllo di Tor richiede una password e ``auth_type`` è impostato su 'password’, specificare la password qui. Predefinito: ''

source: auto_connect
ga: uath_nasc

source: Whether OnionShare should automatically connect to Tor when it starts. Default: False
de: Ob OnionShare sich automatisch mit Tor verbinden soll, wenn es startet. Voreinstellung: False
ga: Cibé an chóir OnionShare ceangal go huathoibríoch le Tor nuair a thosaíonn sé Réamhshocrú: Bréagach
it: Indica se OnionShare deve connettersi automaticamente a Tor all'avvio. Predefinito: Falso

source: use_autoupdate
ga: úsáid uathoibríoch

source: Whether OnionShare should automatically check for updates (over Tor). This setting is only valid for MacOS or Windows installations. Default: True.
de: Ob OnionShare automatisch nach Updates suchen soll (über Tor). Diese Einstellung ist nur für MacOS- oder Windows-Installationen gültig. Voreinstellung: True.
ga: Cibé an cheart OnionShare seiceáil go huathoibríoch le haghaidh nuashonruithe (thar Tor Níl an socrú seo bailí ach le haghaidh suiteálacha macOS nó Windows. Réamhshocraithe: Fíor.
it: Se OnionShare deve controllare automaticamente gli aggiornamenti (tramite Tor). Questa impostazione è valida solo per le installazioni MacOS o Windows. Predefinito: Vero.

source: autoupdate_timestamp
ga: uath_nuashonrú_stampa_ama

source: The last time OnionShare checked for updates. Default: None
de: Das letzte Mal, dass OnionShare nach Updates gesucht hat. Default: None
ga: An uair dheireanach a sheiceáil OnionShare le haghaidh nuashonruithe. Réamhshocraithe: Níl aon
it: L'ultima volta che OnionShare ha controllato gli aggiornamenti. Predefinito: Nessuno

source: bridges_enabled
ga: bridges_cumasaithe

source: Whether to connect to Tor using bridges. Default: False
de: Ob eine Verbindung zu Tor über Brücken hergestellt werden soll. Voreinstellung: False
ga: Cibé acu ceangail le Tor ag baint úsáide as droichid. Réamhshocrú: Bréagach
it: Se connettersi a Tor usando i bridge. Predefinito: Falso

source: bridges_type
ga: cineál_droidí

source: When ``bridges_enabled`` is True, where to load bridges from. Options are "built-in" (bridges shipped with OnionShare and which may get updated from Tor), "moat" (request bridges from Tor's Moat API), or "custom" (user-supplied bridges). Default: "built-in"
de: Wenn ``bridges_enabled`` True ist, woher Brücken geladen werden sollen. Optionen sind "built-in" (Brücken, die mit OnionShare ausgeliefert werden und von Tor aktualisiert werden können), "moat" (Brücken von Tor's Moat API anfordern), oder "custom" (vom Benutzer bereitgestellte Brücken). Standard: "built-in"
ga: Nuair a bhíonn ``bridges_enabled`` Fíor, cá háit as droichid a luchtú. Tá na roghanna “ionsuite” (droichid a sheoltar le OnionShare agus a d'fhéadfadh a bheith nuashonraithe ó Tor), "moat" (iarr droichid ó API Moat Tor), nó “saincheaptha” (droichid a sholáthraíonn an úsáideoir). Réamhshocraithe: “tógtha”
it: Quando ``bridges_enabled`` è True, dove caricare i bridge. Le opzioni sono “built-in” (ponti forniti con OnionShare e che possono essere aggiornati da Tor), ‘moat’ (ponti richiesti dall'API Moat di Tor) o “custom” (ponti forniti dall'utente). Predefinito: “integrato”

source: bridges_builtin_pt
ga: droidge_buntin_pt

source: When ``bridges_type`` is set to "built-in", this specifies which type of bridge protocol to use. Options are "obfs4", "meek-azure" or "snowflake". Default: "obfs4"
de: Wenn ``bridges_type`` auf "built-in" gesetzt ist, gibt dies an, welche Art von Brücken-Protokoll verwendet werden soll. Optionen sind "obfs4", "meek-azure" oder "snowflake". Voreinstellung: "obfs4"
ga: Nuair a shocraítear ``bridges_type`` go “ionsuite”, sonraíonn sé seo cén cineál prótacal droichead atá le húsáid. Is iad na roghanna “obfs4", “meek-azure” nó “snowflake”. Réamhshocraithe: “obfs4"
it: Quando ``bridges_type`` è impostato su “built-in”, specifica quale tipo di protocollo di bridge utilizzare. Le opzioni sono “obfs4”, “meek-azure” o “snowflake”. Valore predefinito: “obfs4”

source: bridges_moat
ga: droidges_moat

source: When ``bridges_type`` is set to "moat", the bridges returned from Tor's Moat API are stored here. Default: ""
de: Wenn ``bridges_type`` auf "moat" gesetzt ist, werden die Brücken, die von Tor's Moat API zurückgegeben werden, hier gespeichert. Voreinstellung: ""
ga: Nuair a shocraítear ``bridges_type`` go “moat”, stóráiltear na droichid ar ais ó API Moat Tor anseo. Réamhshocraithe: “”
it: Quando ``bridges_type`` è impostato su “moat”, i ponti restituiti dall'API Moat di Tor sono memorizzati qui. Predefinito: ""

source: bridges_custom
ga: bridges_saincheaptha

source: When ``bridges_type`` is set to "custom", the bridges specified by the user are stored here. Separate each bridge line in the string with '\n'. Default: ""
de: Wenn ``bridges_type`` auf "custom" gesetzt ist, werden die vom Benutzer angegebenen Brücken hier gespeichert. Trenne jede Brückenzeile in der Zeichenkette mit '\n'. Voreinstellung: ""
ga: Nuair a shocraítear ``bridges_type`` go “saincheaptha”, stóráiltear na droichid a shonraíonn an t-úsáideoir anseo. Déan gach líne droichead sa sreang a scaradh le '\n'. Réamhshocraithe: “”
it: Quando ``bridges_type`` è impostato su "custom", i ponti specificati dall'utente sono memorizzati qui. Separare ogni riga di ponte nella stringa con '\n'. Predefinito: ""

source: bridges_builtin
ga: droichid_builtin

source: When ``bridges_type`` is set to "built-in", OnionShare obtains the latest built-in bridges recommended by Tor and stores them here. Default: {}
de: Wenn ``bridges_type`` auf "built-in" gesetzt ist, erhält OnionShare die neuesten eingebauten Brücken, die von Tor empfohlen werden und speichert sie hier. Voreinstellung: {}
ga: Nuair a bheidh ``bridges_type`` socraithe go “ionsuite”, faigheann OnionShare na droichid ionsuite is déanaí a mholann Tor agus stóráiltear iad anseo. Réamhshocraithe: {}
it: Quando ``bridges_type`` è impostato su "built-in", OnionShare ottiene gli ultimi bridge built-in raccomandati da Tor e li memorizza qui. Predefinito: {}

source: persistent_tabs
ga: cluaisíní leanúnacha

source: ``list``
ga: ``liosta``

source: If the user has defined any tabs as 'saved' (meaning that they are persistent each time OnionShare starts, and their onion address doesn't change), these are given a random identifier which gets listed here. The persistent onion is stored as a JSON file with the same name as this identifier, in a subfolder of the OnionShare configuration folder called 'persistent'. Default: []
de: Wenn der Benutzer Registerkarten als "gespeichert" definiert hat (was bedeutet, dass sie bei jedem Start von OnionShare bestehen bleiben und sich ihre Onion-Adresse nicht ändert), erhalten diese eine zufällige Kennung, die hier aufgeführt wird. Die persistente Onion wird als JSON-Datei mit dem gleichen Namen wie diese Kennung in einem Unterordner des OnionShare-Konfigurationsordners namens 'persistent' gespeichert. Standard: []
ga: Má shainmhíníonn an t-úsáideoir aon chluaisíní mar 'sábháilte' (rud a chiallaíonn go bhfuil siad leanúnach gach uair a thosaíonn OnionShare, agus ní athraíonn a seoladh oinniún), tugtar aitheantóir randamach dóibh seo a liostaítear anseo. Stóráiltear an oinniún leanúnach mar chomhad JSON leis an ainm céanna leis an aitheantóir seo, i bhfofhillteán den fhillteán cumraíochta OnionShare ar a dtugtar 'leanún'. Réamhshocraithe: []
it: Se l'utente ha definito alcune schede come “salvate” (nel senso che sono persistenti a ogni avvio di OnionShare e il loro indirizzo onion non cambia), a queste viene assegnato un identificatore casuale che viene elencato qui. La cipolla persistente viene memorizzata come file JSON con lo stesso nome di questo identificatore, in una sottocartella della cartella di configurazione di OnionShare chiamata “persistente”. Predefinito: []

source: locale
ga: áitiúil

source: The locale used in OnionShare. Default: None (which is the same as 'en'). For valid locale codes, see 'available_locales' in https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py
de: Das in OnionShare verwendete Gebietsschema (Locale). Voreinstellung: None (entspricht 'en'). Für gültige Gebietsschema-Codes siehe 'available_locales' in https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py
ga: An áitiúil a úsáidtear in OnionShare. Réamhshocraithe: Níl aon (atá mar an gcéanna le 'en'). Le haghaidh cóid bailí áitiúla, féach 'available_locales' i https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py
it: Il locale utilizzato in OnionShare. Predefinito: Nessuno (che equivale a “en”). Per i codici dei locali validi, vedere “available_locales” in https://github.com/onionshare/onionshare/blob/main/cli/onionshare_cli/settings.py

source: theme
ga: téama
it: tema

source: The theme for the OnionShare desktop app. Valid options are 0 (automatically detect the user's computer's light or dark theme), 1 (light) or 2 (dark).
de: Das Thema für die OnionShare-Desktop-Anwendung. Gültige Optionen sind 0 (automatische Erkennung des hellen oder dunklen Themas des Benutzercomputers), 1 (hell) oder 2 (dunkel).
ga: An téama don aip deisce OnionShare. Is iad na roghanna bailí ná 0 (téama éadrom nó dorcha ríomhaire an úsáideora a bhrath go huathoibríoch), 1 (solas) nó 2 (dorcha).
it: Il tema dell'applicazione desktop di OnionShare. Le opzioni valide sono 0 (rileva automaticamente il tema chiaro o scuro del computer dell'utente), 1 (chiaro) o 2 (scuro).

source: Configuration file parameters for persistent onions
de: Parameter der Konfigurationsdatei für persistente Onions
ga: Paraiméadair comhad cumraíochta do oinniúin
it: Parametri del file di configurazione per le cipolle persistenti

source: As described above, each 'persistent' onion has parameters of its own which are stored in its own JSON file. The path to this file can be specified for the CLI tool with ``--persistent``.
de: Wie oben beschrieben, hat jede 'persistente' Onion ihre eigenen Parameter, die in einer eigenen JSON-Datei gespeichert werden. Der Pfad zu dieser Datei kann für das CLI-Tool mit ``--persistent`` angegeben werden.
ga: Mar a thuairiscítear thuas, tá paraiméadair dá chuid féin ag gach oinniún 'leanúnach' a stóráiltear ina chomhad JSON féin. Is féidir an cosán chuig an gcomhad seo a shonrú don uirlis CLI le ``--persistent``.
it: Come descritto in precedenza, ogni cipolla “persistente” ha dei parametri propri che sono memorizzati in un proprio file JSON. Il percorso di questo file può essere specificato per lo strumento CLI con ``--persistent``.

source: Here is an example persistent JSON configuration::
de: Hier ist ein Beispiel für eine persistente JSON-Konfiguration::
ga: Seo sampla cumraíocht leanúnach JSON::
it: Ecco un esempio di configurazione JSON persistente::

source: Below are the configuration file parameters for a persistent onion and what they mean, for each section in the JSON
de: Im Folgenden sind die Parameter der Konfigurationsdatei für eine persistente Onion und ihre Bedeutung für jeden Abschnitt im JSON aufgeführt
ga: Seo thíos na paraiméadair chomhaid cumraíochta le haghaidh oinniún leanúnach agus cad a chiallaíonn siad, do gach cuid sa JSON
it: Di seguito sono riportati i parametri del file di configurazione per una cipolla persistente e il loro significato, per ogni sezione del JSON

source: onion
ga: oinniún

source: private_key
ga: eochair_príobháideach

source: Base64-encoded private key of the onion service
de: Base64-kodierter privater Schlüssel des Onion-Dienstes
ga: Eochair phríobháideach ionchódaithe Base64 den tseirbhís
it: Chiave privata del servizio onion codificata in base64

source: client_auth_priv_key
ga: cliant_auth_priv_key

source: The private key when using Client Authentication. Send this to the user.
de: Der private Schlüssel bei Verwendung der Client-Authentifizierung. Sende diesen an den Benutzer.
ga: An eochair príobháideach agus Fíordheimhniú Cliant á úsáid Seol é seo chuig an úsáideoir.
it: La chiave privata quando si usa l'autenticazione del client. Inviarla all'utente.

source: client_auth_pub_key
ga: cliant_auth_pub_key

source: The public key when using Client Authentication. Used on OnionShare's side.
de: Der öffentliche Schlüssel bei Verwendung der Client-Authentifizierung. Wird auf der Seite von OnionShare verwendet.
ga: An eochair phoiblí agus Fíordheimhniú Cliant á úsáid. Úsáidtear ar thaobh OnionShare.
it: La chiave pubblica quando si utilizza l'autenticazione del client. Utilizzata da OnionShare.

source: persistent
ga: leanúnach

source: mode
ga: mód

source: The mode used by this persistent onion. Options are "share", "receive", "website" or "chat".
de: Der von diesem persistenten Onion verwendete Modus. Die Optionen sind "Teilen", "Empfangen", "Website" oder "Chat".
ga: An modh a úsáideann an oinniún leanúnach seo. Is iad na roghanna “comhroinnt”, “faigh”, “suíomh Gréasáin” nó “comhrá”.
it: La modalità utilizzata da questa cipolla persistente. Le opzioni sono “condividere”, ‘ricevere’, “sito web” o “chat”.

source: enabled
ga: cumasaithe

source: Whether persistence is enabled for this onion. When the persistent option is unchecked in the desktop, this entire JSON file is deleted. Default: true
de: Ob die Persistenz für dieses Onion aktiviert ist. Wenn die Option "persistent" auf der Arbeitsoberfläche nicht aktiviert ist, wird die gesamte JSON-Datei gelöscht. Voreinstellung: true
ga: Cibé an bhfuil marthanacht cumasaithe don oinniún seo. Nuair a dhéantar an rogha leanúnach a sheiceáil ar an deasc, scriostar an comhad JSON iomlán seo. Réamhshocraithe: fíor
it: Se la persistenza è abilitata per questa cipolla. Quando l'opzione persistente è deselezionata nel desktop, l'intero file JSON viene cancellato. Predefinito: true

source: autostart_on_launch
ga: tús_uathoibríoch_ar_lainseáil

source: Whether to automatically start this persistent onion when OnionShare starts and once Tor is connected. Default: false
de: Ob dieses persistente Onion automatisch gestartet werden soll, wenn OnionShare startet und sobald Tor verbunden ist. Standard: false
ga: Cibé an gcuirfear tús leis an oinniún leanúnach seo go huathoibríoch nuair a thosaíonn OnionShare agus nuair a Réamhshocraithe: bréagach
it: Se avviare automaticamente questa cipolla persistente all'avvio di OnionShare e una volta che Tor è connesso. Predefinito: false

source: general
ga: ginearálta

source: title
ga: teideal

source: An optional custom title for displaying on the onion service. Default: null ("OnionShare" will be shown instead)
de: Ein optionaler benutzerdefinierter Titel, der auf dem Onion-Dienst angezeigt wird. Standard: null ("OnionShare" wird stattdessen angezeigt)
ga: Teideal saincheaptha roghnach le taispeáint ar an tseirbhís oinniún. Réamhshocraithe: null (taispeánfar “OnionShare” ina ionad)
it: Un titolo personalizzato opzionale da visualizzare sul servizio onion. Predefinito: null (“OnionShare” sarà mostrato al suo posto)

source: public
ga: poiblí

source: Whether the onion service can be accessed with or without a Private Key (Client Authentication). If true, no Private Key is required.
de: Ob auf den Onion-Dienst mit oder ohne privaten Schlüssel zugegriffen werden kann (Client-Authentifizierung). Wenn true, ist kein privater Schlüssel erforderlich.
ga: Cibé an féidir rochtain a fháil ar an tseirbhís oinniún le nó gan Eochair Phríobháideach (Fíordheimhniú Cliant). Más fíor, níl aon Eochair Príobháideach ag teastáil.
it: Se si può accedere al servizio onion con o senza chiave privata (autenticazione del cliente). Se è vero, non è necessaria alcuna chiave privata.

source: Whether the onion service is configured to start at a specific time. The time can be set in the desktop app or specified in seconds with ``--auto-start-timer`` with the CLI tool. Default: false
de: Ob der Onion-Dienst so konfiguriert ist, dass er zu einer bestimmten Zeit startet. Die Zeit kann in der Desktop-App gesetzt werden oder mit ``--auto-start-timer`` mit dem CLI-Tool in Sekunden angegeben werden. Voreinstellung: false
ga: Cibé an bhfuil an tseirbhís oinniún cumraithe chun tosú ag am ar leith. Is féidir an t-am a shocrú san aip deisce nó a shonrú i soicindí le ``--auto-start-timer`` leis an uirlis CLI. Réamhshocraithe: bréagach
it: Se il servizio onion è configurato per avviarsi a un'ora specifica. L'ora può essere impostata nell'applicazione desktop o specificata in secondi con ``--auto-start-timer`` con lo strumento CLI. Predefinito: false

source: autostop_timer
ga: uathstad_uaineadóir

source: Whether the onion service is configured to stop at a specific time. The time can be set in the desktop app or specified in seconds with ``--auto-stop-timer`` with the CLI tool. Default: false
de: Ob der Onion-Dienst so konfiguriert ist, dass er zu einer bestimmten Zeit stoppt. Die Zeit kann in der Desktop-App gesetzt werden oder in Sekunden mit ``--auto-stop-timer`` mit dem CLI-Tool angegeben werden. Voreinstellung: false
ga: Cibé an bhfuil an tseirbhís oinniún cumraithe chun stopadh ag am ar leith. Is féidir an t-am a shocrú san aip deisce nó a shonrú i soicindí le ``--auto-stop-timer`` leis an uirlis CLI. Réamhshocraithe: bréagach
it: Se il servizio Cipolla è configurato per arrestarsi a un'ora specifica. L'ora può essere impostata nell'applicazione desktop o specificata in secondi con ``--auto-stop-timer`` con lo strumento CLI. Predefinito: false

source: The 32-character onion service URL, without the scheme and without the '.onion' suffix.
de: Die 32-Zeichen-URL des Onion-Dienstes ohne das Schema und ohne die Endung '.onion'.
ga: URL seirbhíse oinniúin 32 carachtar, gan an scéim agus gan an iarmhír '.onion'.
it: L'URL del servizio onion a 32 caratteri, senza lo schema e senza il suffisso ‘.onion’.

source: The below are settings specific to the 'mode' specified in the ``persistent`` section above.
de: Die folgenden Einstellungen sind spezifisch für den 'Modus', der im obigen Abschnitt ``persistent`` angegeben wurde.
ga: Is iad seo thíos socruithe atá sonrach don 'modh' a shonraítear sa chuid ``leanún`` thuas.
it: Le impostazioni seguenti sono specifiche per la “modalità” specificata nella sezione ``persistente`` di cui sopra.

source: share
ga: comhroinn

source: autostop_sharing
ga: uathstop_roinnt

source: Whether to automatically stop the share once files are downloaded the first time. Default: true
de: Ob die Freigabe automatisch gestoppt werden soll, sobald die Dateien das erste Mal heruntergeladen wurden. Standard: true
ga: Cibé acu an scair a stopadh go huathoibríoch nuair a íoslódálfar comhaid an chéad uair Réamhshocraithe: fíor
it: Se interrompere automaticamente la condivisione una volta che i file sono stati scaricati per la prima volta. Predefinito: true

source: filenames
ga: ainmneacha comhaid
