Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: de, ga, it, ja, pl, zh_cn

source: Running the CLI from Windows
de: Ausführen der CLI unter Windows
ga: CLI a rith ó Windows
it: Esecuzione della CLI da Windows
ja: Windows からの CLI の実行
pl: Uruchamianie CLI z poziomu systemu Windows
zh_cn: 从 Windows 运行 CLI

source: In the Windows installation, the executable ``onionshare-cli.exe`` is available.
de: In der Windows-Installation ist die ausführbare Datei ``onionshare-cli.exe`` vorhanden.
ga: I suiteáil Windows, tá an inrite `` onionshare-cli.exe`` ar fáil.
it: Nell'installazione di Windows è disponibile l'eseguibile ``onionshare-cli.exe``.
ja: Windows でのインストールでは、実行ファイル ``onionshare-cli.exe`` が利用できます。
pl: W instalacji systemu Windows dostępny jest plik wykonywalny ``onionshare-cli.exe``.
zh_cn: 在 Windows 安装中，可执行文件 ``onionshare-cli.exe`` 可以使用。

source: Usage
de: Benutzung
ga: Úsáid
it: Utilizzo
ja: 使い方
pl: Użytkowanie
zh_cn: 使用

source: Browse the command-line documentation by running ``onionshare --help``::
de: Die Dokumentation zur Kommandozeile kann über den Befehl ``onionshare --help`` abgerufen werden::
ga: Brabhsáil doiciméadú na líne ordaithe trí ``onionshare --help`` a rith::
ja: コマンドラインのドキュメンテーションは ``onionshare --help`` で閲覧できます。
pl: Przejrzyj dokumentację wiersza poleceń, uruchamiając ``onionshare --help``::
zh_cn: 通过运行 ``onionshare --help`` 浏览命令行文档：

source: Running the CLI as a systemd unit file
de: Ausführen der CLI als systemd-Unit-Datei
ga: An CLI a rith mar chomhad aonaid systemd
it: Esecuzione della CLI come file di unità systemd
ja: systemd ユニットファイルとしての CLI の実行
pl: Uruchamianie CLI jako pliku jednostki systemd
zh_cn: 将 CLI 作为 systemd 单元文件运行

source: It is possible to automatically start OnionShare from the CLI using a systemd unit file.
de: Es ist möglich, OnionShare automatisch von der CLI aus zu starten, indem eine systemd-Unit-Datei verwendet wird.
ga: Is féidir OnionShare a thosú go huathoibríoch ón CLI ag baint úsáide as comhad aonaid systemd.
it: È possibile avviare automaticamente OnionShare dalla CLI utilizzando un file di unità systemd.
ja: systemd ユニットファイルを使用して、CLI から OnionShare を自動的に起動できます。
pl: Możliwe jest automatyczne uruchomienie OnionShare z poziomu CLI przy użyciu pliku jednostki systemd.
zh_cn: 可以使用 systemd 单元文件从 CLI 自动启动 OnionShare。

source: You may find this particularly useful if you are operating in 'persistent' mode, and want to start the same onion service every time your machine starts.
de: Dies ist besonders nützlich, wenn du im 'persistenten' Modus arbeitest und bei jedem Start deines Rechners denselben Onion-Dienst starten möchtest.
ga: B’fhéidir go mbeidh sé seo an-úsáideach duit má tá tú ag feidhmiú i mód ‘leanúnach’, agus más mian leat an tseirbhís oinniúin chéanna a thosú gach uair a thosaíonn do mheaisín.
it: Ciò può essere particolarmente utile se si opera in modalità “persistente” e si desidera avviare lo stesso servizio di cipolla a ogni avvio della macchina.
ja: 「永続」モードで動作していて、マシンを起動するたびに同じ Onion Service を起動したい場合には特に便利です。
pl: Może to okazać się szczególnie przydatne, jeśli pracujesz w trybie „trwałym” i chcesz uruchamiać tę samą usługę Onion przy każdym uruchomieniu komputera.
zh_cn: 如果您以“持久”模式运行，并且想要每次启动设备时都启动相同的洋葱服务，您可能会发现这特别有用。

source: To do this, you need to prepare some OnionShare json config first.
de: Dazu musst du zunächst eine OnionShare json-Konfiguration vorbereiten.
ga: Chun seo a dhéanamh, ní mór duit roinnt config OnionShare json a ullmhú ar dtús.
it: Per farlo, è necessario preparare prima una configurazione json di OnionShare.
ja: これを行うには、最初にいくつかの OnionShare json 構成を準備する必要があります。
pl: Aby to zrobić, musisz najpierw przygotować konfigurację JSON OnionShare.
zh_cn: 为此，您需要先准备一些 OnionShare JSON 配置。

source: Here is the main OnionShare config. In this example, it's stored in ``/home/user/.config/onionshare/onionshare.json``. You may need to adjust some of the settings, but if you already have OnionShare installed, it probably looks much like this already::
de: Hier ist die Hauptkonfiguration von OnionShare. In diesem Beispiel ist sie in ``/home/user/.config/onionshare/onionshare.json`` gespeichert. Es kann sein, dass du einige der Einstellungen anpassen musst, aber wenn du OnionShare bereits installiert hast, sieht es wahrscheinlich schon ähnlich aus wie hier::
ga: Seo é an príomh-chumraíocht OnionShare. Sa sampla seo, tá sé stóráilte i ``/home/user/.config/onionshare/onionshare.json``. Seans go mbeidh ort cuid de na socruithe a choigeartú, ach má tá OnionShare suiteáilte agat cheana féin, is dócha go bhfuil cuma mhaith air seo cheana féin::
it: Ecco la configurazione principale di OnionShare. In questo esempio, è memorizzata in ``/home/user/.config/onionshare/onionshare.json``. Potrebbe essere necessario modificare alcune impostazioni, ma se avete già installato OnionShare, probabilmente il suo aspetto è già simile a questo::
ja: これが OnionShare のメイン設定です。この例では、``/home/user/.config/onionshare/onionshare.json`` に保存されています。いくつかの設定を調整する必要があるかもしれませんが、すでに OnionShare がインストールされている場合は、おそらく以下のようになります。
pl: Oto główna konfiguracja OnionShare. W tym przykładzie jest ona przechowywana w ``/home/user/.config/onionshare/onionshare.json``. Być może będzie trzeba dostosować niektóre ustawienia, ale jeśli masz już zainstalowany OnionShare, prawdopodobnie wygląda to mniej więcej tak::
zh_cn: 此处是主要的 OnionShare 配置。在此示例中，它存储在 ``/home/user/.config/onionshare/onionshare.json``。您可能需要调整其中的一些设置，但如果您已经安装了 OnionShare，它看起来可能已经和这个类似::

source: Notice the 'persistent_tabs' section. We will now create a file at ``/home/user/.config/onionshare/persistent/my-persistent-onion.json``, that looks like this::
de: Beachte den Abschnitt 'persistent_tabs'. Wir werden nun eine Datei unter ``/home/user/.config/onionshare/persistent/my-persistent-onion.json`` erstellen, die wie folgt aussieht::
ga: Tabhair faoi deara an rannán 'persistent_tabs'. Cruthóimid comhad anois ag ``/home/user/.config/onionshare/persistent/my-persistent-onion.json``, a bhreathnaíonn mar seo::
it: Si noti la sezione “persistent_tabs”. Ora creeremo un file in ``/home/user/.config/onionshare/persistent/my-persistent-onion.json``, che assomiglia a questo::
ja: 「persistent_tabs」セクションに注目します。以下のようなファイルを ``/home/user/.config/onionshare/persistent/my-persistent-onion.json`` に作成します。
pl: Zwróć uwagę na sekcję 'persistent_tabs'. Teraz utworzymy plik w ``/home/user/.config/onionshare/persistent/my-persistent-onion.json``, który wygląda tak::
zh_cn: 注意“persistent_tabs”部分。现在，我们将在 ``/home/user/.config/onionshare/persistent/my-persistent-onion.json`` 创建文件，类似这样::

source: **Don't actually use this private key, service_id or client_auth keys! They are shown only as an example. Never share the private_key with anyone.**
de: **Verwende diesen privaten Schlüssel, service_id oder client_auth Schlüssel nicht wirklich! Sie werden nur als Beispiel gezeigt. Gib den private_key niemals an andere weiter.**
ga: **Ná húsáid an eochair phríobháideach seo, na heochracha service_id nó client_auth! Léirítear iad mar shampla amháin. Ná roinn an eochair_phríobháideach le haon duine.**
it: **Non utilizzare realmente questa chiave privata, service_id o client_auth! Sono mostrate solo a titolo di esempio. Non condividere mai la chiave privata con nessuno **
ja: **この秘密鍵、service_id、client_auth 鍵を実際に使用しないでください！これらはあくまで例です。秘密鍵は絶対に誰とも共有しないでください**
pl: **Nie używaj tego klucza prywatnego, service_id ani kluczy client_auth! Są one pokazane tylko jako przykład. Nigdy nie udostępniaj klucza prywatnego nikomu.**
zh_cn: **请勿实际使用此私钥、service_id 或 client_auth 密钥！它们仅作为示例显示。切勿与任何人分享私钥。**

source: The easiest way to generate the onion address and private key is to first create a 'pinned' OnionShare tab in the desktop app and started the share for the first time. This will then have saved the persistent settings to your ``.config/onionshare/persistent/`` folder with a random name. You can unpin that tab once you've generated it the first time. Or, you can leave it where it is, and use that persistent file in your systemd unit file below.
de: Der einfachste Weg, die Onion-Adresse und den privaten Schlüssel zu generieren, besteht darin, zunächst eine 'angeheftete' OnionShare-Registerkarte in der Desktop-App zu erstellen und die Freigabe zum ersten Mal zu starten. Dadurch werden die dauerhaften Einstellungen in deinem Ordner ``.config/onionshare/persistent/`` mit einem zufälligen Namen gespeichert. Du kannst diese Registerkarte wieder entfernen, wenn du sie das erste Mal erstellt hast. Du kannst sie aber auch dort lassen, wo sie ist, und die persistente Datei in deiner systemd-Unit-Datei unten verwenden.
ga: Is é an bealach is éasca chun an seoladh oinniún agus an eochair phríobháideach a ghiniúint ná cluaisín OnionShare 'pinned' a chruthú ar dtús san app deisce agus thosaigh sé ar an sciar den chéad uair. Ansin sábhálfaidh sé seo na socruithe leanúnacha chuig d'fhillteán ``.config/onionshare/persistent/`` le hainm randamach air. Is féidir leat an cluaisín sin a dhíphionnáil nuair a bheidh sé ginte agat den chéad uair. Nó, is féidir leat é a fhágáil san áit a bhfuil sé, agus an comhad leanúnach sin a úsáid i do chomhad aonaid systemd thíos.
it: Il modo più semplice per generare l'indirizzo e la chiave privata di Onion è quello di creare una scheda OnionShare “appuntata” nell'applicazione desktop e avviare la condivisione per la prima volta. In questo modo le impostazioni persistenti saranno salvate nella cartella ``.config/onionshare/persistent/`` con un nome casuale. È possibile rimuovere la scheda dopo averla generata la prima volta. Oppure, si può lasciarla dov'è e usare quel file persistente nel file dell'unità systemd sottostante.
ja: Onion アドレスと秘密鍵を生成する最も簡単な方法は、まずデスクトップアプリで OnionShare タブを「ピン留め」して、初めて共有を開始することです。これにより、永続的な設定が ``.config/onionshare/persistent/`` フォルダにランダムな名前で保存されます。最初に生成したタブは固定解除できます。あるいは、そのままにしておいて、以下の systemd ユニットファイルでその永続ファイルを使用することもできます。
pl: Najprostszym sposobem na wygenerowanie adresu onion i klucza prywatnego jest najpierw utworzenie „przypiętej” karty OnionShare w aplikacji na komputer i uruchomienie udostępniania po raz pierwszy. Spowoduje to zapisanie trwałych ustawień w folderze ``.config/onionshare/persistent/`` z losową nazwą. Możesz odpiąć tę kartę po jej pierwszym wygenerowaniu. Możesz też zostawić ją tam, gdzie jest, i użyć tego trwałego pliku w pliku jednostki systemd poniżej.
zh_cn: 生成洋葱地址和私钥的最简单方法是，先在桌面应用中创建“固定”的 OnionShare 标签页，并首次启动分享。这会将持久设置以随机名称保存到 ``.config/onionshare/persistent/`` 文件夹。您可以在首次生成后取消固定该标签页。或者，也可以将其留在原处，并在下方 systemd 单元文件中使用该持久文件。

source: Now you can create a systemd unit file in ``/etc/systemd/system/onionshare-cli.service``. Be sure to adjust the User and Group to your own user/group, as well as changes to any paths to the onionshare-cli binary or the paths to your JSON configs and shares.
de: Nun kannst du eine systemd unit Datei in ``/etc/systemd/system/onionshare-cli.service`` erstellen. Stelle sicher, dass du den Benutzer und die Gruppe an deinen eigenen Benutzer/deine eigene Gruppe anpasst, sowie Änderungen an allen Pfaden zum onionshare-cli-Binary oder den Pfaden zu deinen JSON-Konfigurationen und Freigaben.
ga: Anois is féidir leat comhad aonaid systemd a chruthú i ``/etc/systemd/system/onionshare-cli.service``. Bí cinnte an tÚsáideoir agus an Grúpa a choigeartú do d’úsáideoir/grúpa féin, chomh maith le hathruithe ar aon chosáin chuig an dénártha onionshare-cli nó na cosáin chuig do chumraíochtaí agus scaireanna JSON.
it: Ora si può creare un file di unità systemd in ``/etc/systemd/system/onionshare-cli.service``. Assicurarsi di modificare User e Group con il proprio utente/gruppo, così come di modificare i percorsi del binario di onionshare-cli o i percorsi delle configurazioni JSON e delle condivisioni.
ja: これで、``/etc/systemd/system/onionshare-cli.service`` に systemd ユニットファイルを作成できます。User と Group を自分のユーザー/グループに調整し、onionshare-cli バイナリへのパスや JSON 設定と共有へのパスも変更してください。
pl: Teraz możesz utworzyć plik jednostki systemd w ``/etc/systemd/system/onionshare-cli.service``. Pamiętaj, aby dostosować użytkownika i grupę do własnego użytkownika/grupy, a także zmienić ścieżki do pliku binarnego onionshare-cli lub ścieżki do konfiguracji JSON i udziałów.
zh_cn: 现在，您可以在 ``/etc/systemd/system/onionshare-cli.service`` 创建 systemd 单元文件。请确保将用户和组调整为您自己的用户/组，并更改 onionshare-cli 二进制文件的任何路径或 JSON 配置和共享的路径。

source: The systemd unit file should look like this::
de: Die systemd-Unit-Datei sollte wie folgt aussehen::
ga: Ba cheart go mbeadh cuma mar seo ar an gcomhad aonaid systemd::
it: Il file dell'unità systemd dovrebbe avere il seguente aspetto::
ja: systemd ユニットファイルは以下のようになります。
pl: Plik jednostki systemd powinien wyglądać następująco:
zh_cn: systemd 单元文件应该类似这样::

source: Note that although ``/home/user/my-shared-file.txt`` was defined in the ``filenames`` section of the ``my-persistent-onion.json`` file, it's still necessary to specify it as the argument to the onionshare-cli command.
de: Beachte, dass, obwohl ``/home/user/my-shared-file.txt`` im Abschnitt ``filenames`` der Datei ``my-persistent-onion.json`` definiert wurde, es trotzdem notwendig ist, es als Argument für den onionshare-cli Befehl anzugeben.
ga: Tabhair faoi deara, cé go raibh ``/home/user/my-shared-file.txt`` sainmhínithe sa chuid ``filenames`` den chomhad ``my-persistent-onion.json``, tá sé fós riachtanach é a shonrú mar argóint don ordú onionshare-cli.
it: Si noti che sebbene ``/home/user/my-shared-file.txt`` sia stato definito nella sezione ``filenames`` del file ``my-persistent-onion.json``, è comunque necessario specificarlo come argomento del comando onionshare-cli.
ja: ``/home/user/my-shared-file.txt`` は ``my-persistent-onion.json`` ファイルの ``filenames`` セクションで定義されていますが、onionshare-cli コマンドの引数として指定する必要があります。
pl: Należy pamiętać, że chociaż ``/home/user/my-shared-file.txt`` został zdefiniowany w sekcji ``filenames`` pliku ``my-persistent-onion.json``, nadal konieczne jest jego określenie jako argumentu polecenia onionshare-cli.
zh_cn: 请注意，尽管在 ``my-persistent-onion.json`` 文件的 ``filenames`` 部分定义了 ``/home/user/my-shared-file.txt``，但仍有必要将其指定为 onionshare-cli 命令的参数。

source: Be sure to run ``sudo systemctl daemon-reload`` after creating the unit file.
de: Stelle sicher, dass du ``sudo systemctl daemon-reload`` ausführst, nachdem du die Unit-Datei erstellt hast.
ga: Bí cinnte `` sudo systemctl daemon-reload`` a rith tar éis duit an comhad aonaid a chruthú.
it: Assicurarsi di eseguire ``sudo systemctl daemon-reload`` dopo aver creato il file unitario.
ja: ユニットファイルを作成した後、必ず ``sudo systemctl daemon-reload`` を実行してください。
pl: Pamiętaj o uruchomieniu ``sudo systemctl daemon-reload`` po utworzeniu pliku jednostki.
zh_cn: 请确保在创建单元文件后运行 ``sudo systemctl daemon-reload``。

source: Now you can run ``sudo systemctl start onionshare-cli.service``. If you have ``journalctl`` installed, you can run ``sudo journalctl -f -t onionshare-cli``, and you should see some output of your service starting::
de: Nun kannst du ``sudo systemctl start onionshare-cli.service`` ausführen. Wenn du ``journalctl`` installiert hast, kannst du ``sudo journalctl -f -t onionshare-cli`` ausführen, und du solltest eine Ausgabe sehen, dass dein Dienst startet::
ga: Anois is féidir leat `` sudo systemctl start onionshare-cli.service`` a rith. Má tá ``journalctl`` suiteáilte agat, is féidir leat ``sudo journalctl -f -t onionshare-cli`` a rith, agus ba cheart go bhfeicfeá roinnt aschur de do sheirbhís ag tosú::
it: Ora è possibile eseguire ``sudo systemctl start onionshare-cli.service``. Se avete installato ``journalctl``, potete eseguire ``sudo journalctl -f -t onionshare-cli``, e dovreste vedere l'output dell'avvio del servizio::
ja: これで ``sudo systemctl start onionshare-cli.service`` を実行できます。``journalctl`` がインストールされている場合は、``sudo journalctl -f -t onionshare-cli`` を実行すると、以下のようにサービスの出力が表示されます。
pl: Teraz możesz uruchomić ``sudo systemctl start onionshare-cli.service``. Jeśli zainstalowano ``journalctl``, możesz uruchomić ``sudo journalctl -f -t onionshare-cli``, a powinny pojawić się jakieś dane wyjściowe usługi:
zh_cn: 现在您可以运行 ``sudo systemctl start onionshare-cli.service``。如果安装了 ``journalctl``，可以运行 ``sudo journalctl -f -t onionshare-cli``，您应该看到服务启动的一些输出::

source: If you don't want your users to use a Private Key, set ``public`` to be ``true`` in the ``general`` settings of the my-persistent-onion.json file.
de: Wenn du nicht willst, dass deine Benutzer einen privaten Schlüssel benutzen, setze ``public`` auf ``true`` in den ``general`` Einstellungen der my-persistent-onion.json Datei.
ga: Mura dteastaíonn uait go n-úsáidfidh d’úsáideoirí Eochair Phríobháideach, socraigh ``public`` le bheith `` fíor`` sna socruithe ``ginearálta`` sa chomhad my-persistent-onion.json.
it: Se non si vuole che gli utenti usino una chiave privata, impostare ``public`` come ``true`` nelle impostazioni ``general`` del file my-persistent-onion.json.
ja: ユーザーに秘密鍵を使わせたくない場合は、my-persistent-onion.json ファイルの ``general`` 設定で ``public`` を ``true`` に設定します。
pl: Jeśli nie chcesz, aby użytkownicy korzystali z klucza prywatnego, ustaw opcję ``public`` na ``true`` w ustawieniach ``general`` pliku my-persistent-onion.json.
zh_cn: 如果不想让用户使用私钥，可在 my-persistent-onion.json 文件的``常规``设置中将 ``public`` 设为 ``true``。

source: Keyboard Shortcuts
de: Tastaturkurzbefehle
ga: Aicearraí méarchláir
it: Scorciatoie da tastiera
ja: キーボードのショートカット
pl: Skróty klawiszowe
zh_cn: 键盘快捷键

source: The OnionShare desktop application contains some keyboard shortcuts, for convenience and accessibility::
de: Die OnionShare-Desktop-Anwendung enthält einige Tastaturkurzbefehle, die der Bequemlichkeit und Zugänglichkeit dienen::
ga: Tá roinnt aicearraí méarchláir san fheidhmchlár deisce OnionShare, ar mhaithe le háisiúlacht agus inrochtaineacht::
it: L'applicazione desktop di OnionShare contiene alcune scorciatoie da tastiera, per comodità e accessibilità::
ja: OnionShareのデスクトップアプリケーションには、利便性とアクセシビリティーの観点から、いくつかのキーボードショートカットがあります。
pl: Aplikacja komputerowa OnionShare zawiera kilka skrótów klawiszowych dla wygody i dostępności:
zh_cn: OnionShare 桌面应用程序包含一些键盘快捷键，以方便使用和访问：

source: And from the main mode chooser screen::
de: Und auf dem Hauptbildschirm für die Modusauswahl::
ga: Agus ón scáileán roghnóir príomh-mhód::
it: E dalla schermata principale di selezione della modalità::
ja: メインモードの選択画面については、以下のショートカットがあります。
pl: Natomiast z głównego ekranu wyboru trybu:
zh_cn: 从主模式选择器屏幕：

source: Migrating your OnionShare data to another computer
de: Übertragen deiner OnionShare-Daten auf einen anderen Computer
ga: Do shonraí OnionShare a ascnamh go ríomhaire eile
it: Migrazione dei dati di OnionShare su un altro computer
ja: OnionShare データを別のコンピューターに移行する
pl: Migracja danych OnionShare na inny komputer
zh_cn: 将 OnionShare 数据迁移到另一台计算机上

source: You may want to migrate your OnionShare data when switching to another computer. This is especially true if you had a 'persistent' onion address and you want to preserve it.
de: Wenn du zu einem anderen Computer wechselst, möchtest du vielleicht deine OnionShare-Daten übertragen. Dies gilt insbesondere, wenn du eine 'dauerhafte' Onion-Adresse hattest und diese beibehalten möchtest.
ga: B’fhéidir gur mhaith leat do shonraí OnionShare a aistriú agus tú ag aistriú go ríomhaire eile. Tá sé seo fíor go háirithe má bhí seoladh oinniún 'leanúnach' agat agus gur mhaith leat é a chaomhnú.
it: È possibile che si desideri migrare i dati di OnionShare quando si passa a un altro computer. Ciò è particolarmente vero se si dispone di un indirizzo onion “persistente” e si desidera conservarlo.
ja: 別のコンピューターに乗り換えるときに、OnionShare のデータを移行したい場合もあるはずです。これは、「永続的な」Onion アドレスがあり、それを保持したい場合に特に当てはまるでしょう。
pl: Możesz chcieć zmigrować swoje dane OnionShare podczas przełączania się na inny komputer. Jest to szczególnie ważne, jeśli masz „trwały” adres onion i chcesz go zachować.
zh_cn: 当切换到另一台计算机时，您可能想迁移您的 OnionShare 数据。如果您有“持久”的洋葱地址并想要保留它，则尤其如此。

source: OnionShare stores all such data in a specific folder. Copy the relevant folder for your operating system below, to your new computer:
de: OnionShare speichert alle diese Daten in einem bestimmten Ordner. Kopiere den entsprechenden Ordner für dein Betriebssystem unten auf deinen neuen Computer:
ga: Stórálann OnionShare na sonraí sin go léir i bhfillteán ar leith. Cóipeáil an fillteán ábhartha le do chóras oibriúcháin thíos, chuig do ríomhaire nua:
it: OnionShare memorizza tutti questi dati in una cartella specifica. Copiare sul nuovo computer la cartella relativa al sistema operativo in uso:
ja: OnionShare は、このようなデータをすべて特定のフォルダーに保存します。次のオペレーティングシステムに対応するフォルダーを新しいコンピューターにコピーします。
pl: OnionShare przechowuje wszystkie takie dane w określonym folderze. Skopiuj poniższy folder odpowiedni dla Twojego systemu operacyjnego na nowy komputer:
zh_cn: OnionShare 会将所有这些数据存储在特定文件夹中。将下方操作系统相关的文件夹复制到新计算机：

source: Configuration file parameters
de: Parameter in der Konfigurationsdatei
ga: Paraiméadair comhad cumra
it: Parametri del file di configurazione

source: OnionShare stores its settings in a JSON file. Both the CLI and the Desktop versions use this configuration file. The CLI also lets you specify a path to a custom configuration file with ``--config``.
de: OnionShare speichert seine Einstellungen in einer JSON-Datei. Sowohl die CLI- als auch die Desktop-Version verwenden diese Konfigurationsdatei. In der CLI kannst du auch einen Pfad zu einer eigenen Konfigurationsdatei mit ``--config`` angeben.
ga: Stórálann OnionShare a shocruithe i gcomhad JSON. Úsáideann na leaganacha CLI agus na Deisce araon an comhad cumraíochta seo. Ligeann an CLI duit cosán a shonrú chuig comhad cumraíochta saincheaptha le ``--config``.
it: OnionShare memorizza le proprie impostazioni in un file JSON. Sia la versione CLI che quella Desktop utilizzano questo file di configurazione. La CLI consente anche di specificare un percorso per un file di configurazione personalizzato con ``--config``.

source: Below are the configuration file parameters and what they mean. If your configuration file has other parameters not listed here, they may be obsolete from older OnionShare versions.
de: Im Folgenden sind die Parameter der Konfigurationsdatei und ihre Bedeutung aufgeführt. Wenn deine Konfigurationsdatei andere Parameter enthält, die hier nicht aufgeführt sind, sind sie möglicherweise aus älteren OnionShare-Versionen veraltet.
ga: Seo thíos na paraiméadair chomhaid cumraíochta agus cad a chiallaíonn siad. Má tá paraiméadair eile nach bhfuil liostaithe anseo ag do chomhad cumraíochta, d'fhéadfadh go mbeadh siad as feidhm ó leaganacha níos sine OnionShare.
it: Di seguito sono riportati i parametri del file di configurazione e il loro significato. Se il vostro file di configurazione ha altri parametri non elencati, è possibile che siano obsoleti rispetto alle versioni precedenti di OnionShare.

source: Parameter
ga: Paraiméadar
it: Parametro

source: Type
de: Typ
ga: Cineál
it: Tipo

source: Explanation
de: Erläuterung
ga: Míniú
it: Spiegazione

source: version
ga: leagan
it: versione

source: ``string``
ga: ``sreang``

source: The version of OnionShare. You should not ever need to change this value.
de: Die Version von OnionShare. Du solltest diesen Wert niemals ändern müssen.
ga: An leagan de OnionShare. Níor cheart go gcaithfidh tú an luach seo a athrú riamh.
it: La versione di OnionShare. Non dovrebbe essere necessario modificare questo valore.

source: connection_type
ga: cineál_nasc
