Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/advanced.po
Languages: de, ga, it, ja, pl, zh_cn

source: Advanced Usage
de: Fortgeschrittene Nutzung
ga: Ardúsáid
it: Utilizzo Avanzato
ja: 高度な使い方
pl: Użytkowanie Zaawansowane
zh_cn: 进阶使用

source: Save Tabs
de: Reiter speichern
ga: Sábháil Cluaisíní
it: Salva le tab
ja: タブを保存
pl: Zapisywanie Kart
zh_cn: 储存标签分页

source: Closing OnionShare tabs you host destroys them, preventing reuse. Persistently hosted websites are available on the same address even if the computer they are shared from is rebooted.
de: Wenn du die von dir gehosteten OnionShare-Tabs schließt, werden sie zerstört und können nicht wiederverwendet werden. Dauerhaft gehostete Websites sind unter derselben Adresse verfügbar, auch wenn der Computer, von dem aus sie freigegeben wurden, neu gestartet wird.
ga: Má dhúnann tú cluaisíní OnionShare, scriosann tú iad, rud a chuireann cosc ar athúsáid. Tá suíomhanna gréasáin a bhíonn á n-óstáil go seasta ar fáil ar an seoladh céanna fiú má dhéantar an ríomhaire óna bhfuil siad roinnte a atosú.
it: La chiusura delle schede OnionShare ospitate le distrugge, impedendone il riutilizzo. I siti web ospitati in modo persistente sono disponibili sullo stesso indirizzo anche se il computer da cui sono condivisi viene riavviato.
ja: OnionShareのタブを閉じると、タブは破棄され、これを再利用することはできません。固定タブでホストされているウェブサイトは、それをホストしているコンピューターが再起動した場合でも、同じアドレスでアクセスすることができます。
pl: Zamykanie hostowanych kart OnionShare niszczy je, uniemożliwiając ponowne użycie. Stale hostowane strony internetowe są dostępne pod tym samym adresem, nawet jeśli komputer, z którego są udostępniane, zostanie ponownie uruchomiony.
zh_cn: 关闭您托管的 OnionShare 标签页会破坏它们，防止重复使用。即使共享网站的计算机重启，永久托管的网站仍可在同一地址上使用。

source: Make any tab persistent by checking the "Always open this tab when OnionShare is started" box before starting your server.
de: Mach jede Registerkarte dauerhaft, indem du das Kästchen "Diese Registerkarte immer öffnen, wenn OnionShare gestartet wird" aktivierst, bevor du deinen Server startest.
ga: Déan cluaisín ar bith go leanúnach tríd an mbosca "Oscail an cluaisín seo i gcónaí nuair a thosaíonn OnionShare" a sheiceáil sula dtosaíonn tú ar do fhreastalaí.
it: Per rendere persistente qualsiasi scheda, selezionare la casella “Apri sempre questa scheda all'avvio di OnionShare” prima di avviare il server.
ja: サーバーを開始する前に「OnionShareを開始する際に、このタブを常に開く」にチェックを入れると、タブを固定することができます。
pl: Utrwal dowolną kartę, zaznaczając pole „Zawsze otwieraj tę kartę po uruchomieniu OnionShare” przed uruchomieniem serwera.
zh_cn: 在启动服务器之前，通过选中“启动 OnionShare 时始终打开此标签页”框，使任何标签页持久化。

source: When opening OnionShare, your saved tabs from the prior session will start opened. Each service then can be started manually, and will be available on the same OnionShare address and be protected by the same private key.
de: Wenn du OnionShare öffnest, werden deine gespeicherten Tabs aus der vorherigen Sitzung geöffnet. Jeder Dienst kann dann manuell gestartet werden und ist unter der gleichen OnionShare-Adresse verfügbar und durch den gleichen privaten Schlüssel geschützt.
ga: Agus OnionShare á oscailt, cuirfear tús le do chuid cluaisíní sábháilte ón seisiún roimhe seo a oscailt. Is féidir tús a chur le gach seirbhís de láimh ansin, agus beidh sí ar fáil ar an seoladh OnionShare céanna agus beidh sí cosanta leis an eochair phríobháideach chéanna.
it: Quando si apre OnionShare, le schede salvate dalla sessione precedente vengono aperte. Ogni servizio può essere avviato manualmente e sarà disponibile sullo stesso indirizzo di OnionShare e protetto dalla stessa chiave privata.
ja: OnionShareを開くと、前回のセッションで保存したタブを開きます。その後、それぞれのサービスを手動で開始すると、同じOnionShareのアドレスで、同一の秘密鍵で保護されたサービスが利用できるようになります。
pl: Podczas otwierania OnionShare Twoje zapisane karty z poprzedniej sesji zaczną się otwierać. Każda usługa może być następnie uruchomiona ręcznie i będzie dostępna pod tym samym adresem OnionShare, będzie chroniona tym samym kluczem prywatnym.
zh_cn: 打开 OnionShare 时，您之前会话中保存的标签页将开始打开。然后可以手动启动每个服务，这些服务将在同一个 OnionShare 地址上可用，并受同一个私钥保护。

source: If you save a tab, a copy of its onion service secret key is stored on your computer.
de: Wenn du eine Registerkarte speicherst, wird eine Kopie des geheimen Schlüssels des Onion-Dienstes auf deinem Computer gespeichert.
ga: Má shábhálann tú cluaisín, stóráiltear cóip dá eochair rúnda seirbhíse oinniúin ar do ríomhaire.
it: Se si salva una scheda, una copia della chiave segreta del servizio Cipolla viene memorizzata sul computer.
ja: タブを保存すると、そのOnion Serviceの秘密鍵のコピーがあなたのコンピューター上に保存されます。
pl: Jeśli zapiszesz kartę, kopia jej sekretnego klucza usługi cebulowej jest przechowywana na Twoim komputerze.
zh_cn: 如果您保存了一个标签页，其洋葱服务密钥的副本将存储在您的计算机上。

source: Turn Off Private Key
de: Privaten Schlüssel deaktivieren
ga: Múch Eochair Phríobháideach
it: Disattiva chiave privata
ja: 秘密鍵を無効にする
pl: Wyłączanie obsługi Klucza Prywatnego
zh_cn: 关闭私钥

source: By default, all OnionShare services are protected with a private key, which Tor calls "client authentication".
de: Standardmäßig werden alle OnionShare-Dienste mit einem privaten Schlüssel gesichert. Dies wird im Tor-Kontext "Client-Authentifizierung" genannt.
ga: De réir réamhshocraithe, tá gach seirbhís OnionShare cosanta le eochair phríobháideach, a dtugann Tor "fíordheimhniú cliant" air.
it: Per impostazione predefinita, tutti i servizi di OnionShare sono protetti da una chiave privata, che Tor chiama “autenticazione del cliente”.
ja: 既定では、全てのOnionShareのサービスは、秘密鍵で保護されます。これはTorでは「クライアント認証」と呼ばれているものです。
pl: Domyślnie wszystkie usługi OnionShare są chronione kluczem prywatnym, Tor nazywa to „uwierzytelnianiem klienta”.
zh_cn: 所有 OnionShare 服务默认都使用私钥保护，Tor 称之为“客户端验证”。

source: The Tor Browser will ask you to enter your private key when you load an OnionShare service. If you want to allow the public to use your service, it's better to disable the private key altogether.
de: Wenn du einen OnionShare-Dienst lädst, wird der Tor-Browser dich auffordern, deinen privaten Schlüssel einzugeben. Wenn du der Öffentlichkeit erlauben willst, deinen Dienst zu nutzen, ist es besser, den privaten Schlüssel ganz zu deaktivieren.
ga: Iarrfaidh Brabhsálaí Tor ort d’eochair phríobháideach a chur isteach nuair a lódálann tú seirbhís OnionShare. Más mian leat ligean don phobal do sheirbhís a úsáid, is fearr an eochair phríobháideach a dhíchumasú ar fad.
it: Il browser Tor chiede di inserire la chiave privata quando si carica un servizio OnionShare. Se volete permettere al pubblico di utilizzare il vostro servizio, è meglio disabilitare del tutto la chiave privata.
ja: OnionShare のサービスを読み込むと、Tor Browser は秘密鍵を入力するよう要求します。サービスを公開したい場合は、秘密鍵を完全に無効にすることをお勧めします。
pl: Tor Browser poprosi Cię o podanie klucza prywatnego podczas ładowania usługi OnionShare. Jeśli chcesz zezwolić na korzystanie z Twojej usługi publicznie, lepiej całkowicie wyłączyć klucz prywatny.
zh_cn: 加载 OnionShare 服务时，Tor 浏览器将要求您输入私钥。如果您想允许公众使用您的服务，最好完全禁用私钥。

source: To turn off the private key for any tab, check the "This is a public OnionShare service (disables private key)" box before starting the server. Then the server will be public and a private key is not needed to load it in the Tor Browser.
de: Um den privaten Schlüssel für eine Registerkarte zu deaktivieren, setze ein Kreuz in das "Dies ist ein öffentlicher OnionShare-Service (Deaktiviert den privaten Schlüssel)" Kästchen bevor du den Server startest. Dadurch wird der Server öffentlich Zugänglich, wodurch kein privater Schlüssel mehr benötigt wird.
ga: Chun an eochair phríobháideach le haghaidh aon chluaisín a mhúchadh, seiceáil an bosca "Seirbhís OnionShare poiblí é seo (díchumasaigh eochair phríobháideach)" sula dtosaíonn tú ar an bhfreastalaí. Ansin beidh an freastalaí poiblí agus ní gá eochair phríobháideach chun é a lódáil sa Bhrabhsálaí Tor.
it: Per disattivare la chiave privata per qualsiasi scheda, selezionare la casella “Questo è un servizio OnionShare pubblico (disattiva la chiave privata)” prima di avviare il server. In questo modo il server sarà pubblico e non sarà necessaria una chiave privata per caricarlo nel Browser Tor.
ja: タブに関して秘密鍵を無効にするには、サーバーを開始する前に「公開のOnionShareのサービスとして設定（秘密鍵が無効となります）」にチェックを入れてください。そうすると、サーバーは公開され、Tor Browserでこれを読み込む際に秘密鍵を入力する必要はなくなります。
pl: Aby wyłączyć obsługę klucza prywatnego dla dowolnej karty, zaznacz pole „To jest usługa publiczna OnionShare (wyłącza klucz prywatny)” przed uruchomieniem serwera. Wtedy serwer będzie publiczny i nie będzie potrzebował klucza prywatnego do przeglądania w Tor Browser.
zh_cn: 要关闭任何标签页的私钥，请在启动服务器之前选中“这是一项公共 OnionShare 服务（禁用私钥）”框。然后服务器将公开，并且不需要私钥即可在 Tor 浏览器中加载它。

source: Custom Titles
de: Benutzerdefinierte Titel
ga: Teidil Chustaim
it: Titoli personalizzati
ja: カスタムタイトル
pl: Tytuły niestandardowe
zh_cn: 自定义标题

source: When people load OnionShare services in the Tor Browser they see the default title for each type of service. For example, the default title for chat services is "OnionShare Chat".
de: Wenn jemand einen OnionShare-Dienst im Tor-Browser aufruft, sieht er standardmäßig den Standardtitel für den jeweiligen Service-Typ. Der Standard-Titel eines Chat-Dienstes ist beispielsweise "OnionShare Chat".
ga: Nuair a lódálann daoine seirbhísí OnionShare sa Bhrabhsálaí Tor feiceann siad an teideal réamhshocraithe do gach cineál seirbhíse. Mar shampla, is é an teideal réamhshocraithe le haghaidh seirbhísí comhrá ná "OnionShare Chat".
it: Quando le persone caricano i servizi di OnionShare nel Tor Browser, vedono il titolo predefinito per ogni tipo di servizio. Ad esempio, il titolo predefinito per i servizi di chat è “OnionShare Chat”.
ja: Tor BrowserでOnionShareのサービスを読み込むと、それぞれの種類のサービスに既定のタイトルが表示されます。例えば、チャットのサービスの既定のタイトルは「OnionShare Chat」です。
pl: Domyślnie, gdy ludzie ładują usługę OnionShare w Tor Browser, widzą domyślny tytuł dla danego typu usługi. Na przykład domyślny tytuł usługi czatu to „OnionShare Chat”.
zh_cn: 当人们在 Tor 浏览器中加载 OnionShare 服务时，他们会看到每种服务的默认标题。例如，聊天服务的默认标题是“OnionShare Chat”。

source: If you edit the "Custom title" setting before starting a server you can change it.
de: Wenn du die Einstellung "Benutzerdefinierter Titel" bearbeitest, bevor du einen Server startest, kannst du sie ändern.
ga: Má chuireann tú an socrú "Teideal an Chustaim" in eagar sula dtosaíonn tú ar fhreastalaí is féidir leat é a athrú.
it: Se si modifica l'impostazione “Titolo personalizzato” prima di avviare un server, è possibile modificarla.
ja: サーバーを開始する前に「カスタムタイトル」を設定すると、既定のタイトルを変更できます。
pl: Jeśli edytujesz ustawienie „Tytuł niestandardowy” przed uruchomieniem serwera, możesz to zmienić.
zh_cn: 如果在启动服务器之前编辑“自定义标题”设置，则可以更改它。

source: Scheduled Times
de: Geplante Zeiten
ga: Amanna Sceidealta
it: Orari Programmati
ja: スケジュールの設定
pl: Harmonogramy
zh_cn: 排程的时间

source: OnionShare supports scheduling exactly when a service should start and stop. Before starting a server, click "Show advanced settings" in its tab and then check the boxes next to either "Start onion service at scheduled time", "Stop onion service at scheduled time", or both, and set the respective desired dates and times.
de: OnionShare erlaubt eine genaue Zeitsteuerung, wann ein Dienst starten und stoppen soll. Bevor du den Dienst startest, klicke im jeweiligen Reiter auf „Erweiterte Einstellungen anzeigen“ und setze die Haken bei „Onion-Dienst zu einem festgelegten Zeitpunkt starten“, „Onion-Dienst zu einem festgelegten Zeitpunkt stoppen“ oder bei beiden, und lege das jeweilig gewünschte Datum samt Uhrzeit fest.
ga: Tacaíonn OnionShare le sceidealú go díreach nuair ba cheart seirbhís a thosú agus a stopadh. Sula dtosaíonn tú ar fhreastalaí, cliceáil "Taispeáin socruithe casta" ina chluaisín agus ansin seiceáil na boscaí in aice le ceachtar "Tosaigh seirbhís oinniún ag am sceidealta", "Stop seirbhís oinniún ag am sceidealta", nó iad araon, agus socraigh na dátaí inmhianaithe faoi seach agus amanna.
it: OnionShare supporta la pianificazione esattamente quando un servizio deve essere avviato e interrotto. Prima di avviare un server, fai clic su "Mostra impostazioni avanzate" nella relativa scheda, quindi seleziona le caselle accanto a "Avvia servizio onion all'ora pianificata", "Arresta il servizio onion all'ora pianificata" o entrambe e imposta le rispettive date e ore desiderate.
ja: OnionShareでは、サービスを開始・停止する時刻を予定することができます。サーバーを開始する前に、そのタブの「詳細設定を表示」をクリックし、「指定の日時にOnion Serviceを開始」と「指定の日時にOnion Serviceを停止」の片方または両方にチェックを入れて、希望日時を入力してください。
pl: OnionShare umożliwia dokładne planowanie, kiedy usługa powinna zostać uruchomiona i zatrzymana. Przed uruchomieniem serwera kliknij „Pokaż ustawienia zaawansowane” na jego karcie, a następnie zaznacz pole „Uruchom usługę cebulową w zaplanowanym czasie”, „Zatrzymaj usługę cebulową w zaplanowanym czasie” lub oba, a następnie ustaw odpowiednie daty i czasy.
zh_cn: OnionShare 具排程功能可设定服务开始与停止时间。在启动服务器前，点击标签分页中"显示进阶设定"再分别勾选"在排定时间启动 OnionShare"、"在排定时间关闭 OnionShare" 旁边的小方块，来安排日期和时刻。

source: Services scheduled to start in the future display a countdown timer when the "Start sharing" button is clicked. Services scheduled to stop in the future display a countdown timer when started.
de: Bei Diensten, die in der Zukunft starten sollen, wird ein Countdown-Timer angezeigt, wenn die Schaltfläche "Freigabe starten" angeklickt wird. Bei Diensten, die in der Zukunft gestoppt werden sollen, wird ein Countdown-Timer angezeigt, wenn sie gestartet werden.
ga: Taispeánann seirbhísí atá sceidealaithe le tosú amach anseo lasc ama comhaireamh síos nuair a chliceáiltear an cnaipe “Tosaigh ag roinnt”. Taispeánann seirbhísí atá sceidealaithe le stopadh sa todhchaí lasc ama comhaireamh síos nuair a chuirtear tús leo.
it: I servizi programmati per essere avviati in futuro visualizzano un conto alla rovescia quando si fa clic sul pulsante “Avvia condivisione”. I servizi programmati per essere interrotti in futuro visualizzano un conto alla rovescia quando vengono avviati.
ja: 今後開始する予定のサービスは、「共有を開始」ボタンをクリックするとカウントダウンタイマーが表示されます。今後停止する予定のサービスは、開始時にカウントダウンタイマーが表示されます。
pl: Usługi zaplanowane do uruchomienia w przyszłości wyświetlają licznik czasu po kliknięciu przycisku „Rozpocznij udostępnianie”. Usługi zaplanowane do zatrzymania w przyszłości wyświetlają licznik czasu po uruchomieniu.
zh_cn: 当点击“开始分享”按钮时，计划在未来启动的服务会显示倒计时器。计划在未来停止的服务在启动时显示倒计时器。

source: **Scheduling an OnionShare service to automatically start can be used as a dead man's switch**. This means your service is made public at a given time in the future if you are not there to prevent it. If nothing happens to you, you can cancel the service before it's scheduled to start.
de: **Die Einstellung eines automatischen Starts (Datum und Uhrzeit) für einen OnionShare Dienst kann als eine Totmannschaltung verwendet werden**. Das bedeutet dass der von Dir so eingestellte Dienst zu einem bestimmten Zeitpunkt in der Zukunft veröffentlich wird, wenn Du dies nicht zuvor änderst. Wenn Dir nichts passiert, kannst Du den Dienst stoppen bevor er beginnt zu starten, wenn Dir etwas passiert ist, startet der Dienst ohne Dein erneutes zutun.
ga: **Is féidir seirbhís OnionShare a sceidealú le tosú go huathoibríoch a úsáid mar lasc fear marbh**. Ciallaíonn sé seo go ndéanfar do sheirbhís a phoibliú ag am ar leith amach anseo mura bhfuil tú ann chun é a chosc. Mura dtarlaíonn rud ar bith duit, is féidir leat an tseirbhís a chur ar ceal sula mbeidh sé sceidealaithe le tosú.
it: **La programmazione dell'avvio automatico di un servizio OnionShare può essere utilizzata come un interruttore a uomo morto**. Ciò significa che il servizio viene reso pubblico in un determinato momento del futuro se non si è presenti per impedirlo. Se non vi succede nulla, potete annullare il servizio prima che venga programmato per l'avvio.
ja: **OnionShareの自動開始の設定は「死者のスイッチ」として使用できます**。その場合、もし将来、あなたによりOnionShareの自動開始の設定が解除されなければ、指定の日時にサービスが公開されます。何もあなたの身に起こらなければ、サービスが開始する前に、これを中止することができます。
pl: **Zaplanowanie automatycznego uruchamiania usługi OnionShare może służyć jako wyłącznik awaryjny**. Oznacza to, że Twoja usługa zostanie upubliczniona w określonym czasie w przyszłości, jeśli nie będziesz tam, aby temu zapobiec. Jeśli nic Ci się nie stanie, możesz anulować usługę przed planowanym rozpoczęciem.
zh_cn: **将 OnionShare 服务安排为自动启动可以作为一个死开关**。这意味着，如果您不在那里阻止，您的服务将在未来的某个特定时间公开。如果您没有发生任何事情，您可以在计划启动之前取消该服务。

source: **Scheduling an OnionShare service to automatically stop limits its exposure**. If you want to share secret info or something that will be outdated, you can do so for selected limited time.
de: **Die automatische Beendigung eines OnionShare-Dienstes schränkt seine Sichtbarkeit ein**. Wenn du geheime Informationen oder etwas, das veraltet ist, weitergeben willst, kannst du das für eine ausgewählte begrenzte Zeit tun.
ga: **Cuireann sceidealú seirbhís OnionShare teorainn lena nochtadh**. Más mian leat faisnéis rúnda nó rud éigin a bheidh as dáta a roinnt, is féidir leat é sin a dhéanamh ar feadh tréimhse teoranta roghnaithe.
it: **La programmazione dell'arresto automatico di un servizio OnionShare ne limita l'esposizione**. Se volete condividere informazioni segrete o qualcosa che sarà obsoleto, potete farlo per un periodo di tempo limitato e selezionato.
ja: **OnionShareのサービスの自動終了の設定は、サービスが公開される期間を限定できます**。古くなってしまう秘密の情報などを共有したい場合は、期間を選択、限定してこれを共有することができます。
pl: **Zaplanowanie automatycznego zatrzymania usługi OnionShare ogranicza jej ekspozycję**. Jeśli chcesz udostępnić tajne informacje lub coś, co będzie nieaktualne, możesz to zrobić przez wybrany ograniczony czas.
zh_cn: **安排 OnionShare 服务自动停止会限制其暴露**。如果您想分享秘密信息或一些将过期的信息，您可以在选定的有限时间内进行分享。

source: Command-line Interface
de: Kommandozeilen-Schnittstelle
ga: Comhéadan líne ordaithe
it: Interfaccia della riga di comando
ja: コマンドライン・インターフェース
pl: Wiersz Poleceń
zh_cn: 命令行界面

source: In addition to its graphical interface, OnionShare has a command-line interface.
de: Zusätzlich zur grafischen Oberfläche verfügt OnionShare auch über eine Kommandozeilen-Schnittstelle.
ga: Chomh maith lena chomhéadan grafach, tá comhéadan ordú-líne ag OnionShare.
it: Oltre alla sua interfaccia grafica, OnionShare ha un'interfaccia a riga di comando.
ja: グラフィカル・インターフェースに加えて、OnionShareにはコマンドライン・インターフェースがあります。
pl: Oprócz interfejsu graficznego OnionShare posiada również interfejs wiersza poleceń.
zh_cn: 除了图形界面外，OnionShare 还有命令行界面。

source: Installing the CLI version
de: Installation der Befehlszeilenversion
ga: Suiteáil an leagan CLI
it: Installazione della versione CLI
ja: CLI バージョンのインストール
pl: Instalowanie wersji CLI
zh_cn: 安装 CLI 版本

source: If you have installed the Snap, macOS or Windows package, you already have the CLI version installed.
de: Wenn du das Snap-, macOS- oder Windows-Paket installiert hast, hast du bereits die CLI-Version installiert.
ga: Má tá an pacáiste Snap, macOS nó Windows suiteáilte agat, tá an leagan CLI suiteáilte agat cheana féin.
it: Se avete installato il pacchetto Snap, macOS o Windows, avete già installato la versione CLI.
ja: Snap、macOS、または Windows パッケージをインストールしている場合、CLI バージョンはすでにインストールされています。
pl: Jeśli zainstalowano pakiet Snap, macOS lub Windows, masz już zainstalowaną wersję CLI.
zh_cn: 如果安装了 Snap、macOS 或 Windows 软件包，则已经安装了 CLI 版本。

source: Alternatively, you can install just the command-line version of OnionShare using ``pip3``::
de: Alternativ kannst du auch nur die Kommandozeilenversion von OnionShare mit ``pip3``:: installieren
ga: Nó, is féidir leat an leagan ordú-líne de OnionShare a shuiteáil ag baint úsáide as `` pip3`` ::
ja: あるいは、``pip3`` を使って OnionShare のコマンドライン版だけをインストールすることもできます。
pl: Ewentualnie możesz zainstalować wersję OnionShare dostępną w wierszu poleceń, używając polecenia ``pip3``::
zh_cn: 另外，您可以使用 ``pip3`` 只安装 OnionShare 的命令行版本::

source: Note that you will also need the ``tor`` package installed. In macOS, install it with: ``brew install tor``
de: Beachte, dass du auch hierfür das ``tor``-Paket installiert haben musst. Unter macOS kannst du dieses mit ``brew install tor`` installieren
ga: Tabhair faoi deara go mbeidh an pacáiste `` tor`` suiteáilte uait freisin. I macOS, é a shuiteáil le: `` brew install tor``
it: Nota che avrai anche bisogno del pacchetto ``tor`` installato. In macOS, installalo con: ``brew install tor``
ja: ``tor`` パッケージもインストールする必要があります。macOS の場合は ``brew install tor`` でインストールできます。
pl: Zauważ, że będziesz także potrzebował zainstalowanego pakietu ``tor``. W macOS zainstaluj go za pomocą: ``brew install tor``
zh_cn: 记住这需要已安装``tor``软件包，macOS 可透过 ``brew install tor``来安装

source: Then run it like this::
de: Führe es dann wie folgt aus::
ga: Ansin rith sé mar seo::
it: Quindi eseguilo in questo modo::
ja: その後、次のコマンドを実行してください。
pl: Następnie uruchom go następująco::
zh_cn: 然后像这样执行::

source: Info about installing it on different operating systems can be found in the `CLI README file <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ in the Git repository.
de: Informationen über die Installation auf verschiedenen Betriebssystem findest du in der Datei `CLI README<https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ im Git-Repository.
ga: Tá eolas faoina shuiteáil ar chórais oibriúcháin éagsúla le fáil sa chomhad `CLI README <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ sa stór Git.
it: Informazioni sull'installazione su diversi sistemi operativi si trovano nel file `CLI README <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ nel repository Git.
ja: 異なるOSでのインストールに関する情報については、Gitレポジトリにある\ `コマンドラインREADMEファイル <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_\ をご確認ください。
pl: Informacje o instalacji na różnych systemach operacyjnych można znaleźć w pliku `CLI README <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ w repozytorium Git.
zh_cn: 有关在不同操作系统上安装它的信息可以在 Git 存储库中的 `CLI README 文件 <https://github.com/onionshare/onionshare/blob/develop/cli/README.md>`_ 中找到。

source: Running the CLI from Snap
de: Ausführen der CLI von Snap aus
ga: Rith an CLI ó Snap
it: Esecuzione della CLI da Snap
ja: Snap からの CLI の実行
pl: Uruchamianie CLI ze Snapa
zh_cn: 从 Snap 运行 CLI

source: If you installed OnionShare using the Snap package, you can run ``onionshare.cli`` to access the command-line interface version.
de: Wenn du OnionShare mit dem Snap-Paket installiert hast, kannst du ``onionshare.cli`` ausführen, um auf die Kommandozeilenversion zuzugreifen.
ga: Má shuiteáil tú OnionShare ag baint úsáide as an bpacáiste Snap, is féidir leat ``onionshare.cli`` a rith chun rochtain a fháil ar an leagan comhéadan ordú-líne.
it: Se si è installato OnionShare utilizzando il pacchetto Snap, è possibile eseguire ``onionshare.cli`` per accedere alla versione con interfaccia a riga di comando.
ja: Snap パッケージを使用して OnionShare をインストールした場合は、 ``onionshare.cli`` を実行することで、コマンドラインインターフェイス版にアクセスできます。
pl: Jeśli zainstalowano OnionShare przy użyciu pakietu Snap, możesz uruchomić ``onionshare.cli``, aby uzyskać dostęp do wersji interfejsu wiersza poleceń.
zh_cn: 如果使用 Snap 软件包安装了 OnionShare，可以运行 ``onionshare.cli`` 来访问命令行界面版本。

source: Running the CLI from macOS
de: Ausführen der CLI unter macOS
ga: CLI a rith ó macOS
it: Esecuzione della CLI da macOS
ja: macOS からの CLI の実行
pl: Uruchamianie CLI z poziomu systemu macOS
zh_cn: 从 macOS 运行 CLI

source: From Terminal, you can run ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help``
de: Vom Terminal aus kannst du ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help`` ausführen
ga: Ón Teirminéal, is féidir leat ``/ Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help`` a rith
it: Da Terminale, è possibile eseguire ``/Applicazioni/OnionShare.app/Contents/MacOS/onionshare-cli --help``
ja: ターミナルから ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help`` を実行します
pl: Z poziomu terminala możesz uruchomić ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help``
zh_cn: 从终端可以运行 ``/Applications/OnionShare.app/Contents/MacOS/onionshare-cli --help``
