Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/develop.po
Languages: sq

source: Developing OnionShare
sq: Zhvillim i OnionShare-it

source: Collaborating
sq: Bashkëpunim

source: OnionShare has an open Keybase team to discuss the project, ask questions, share ideas and designs, and making plans for future development. (It's also an easy way to send end-to-end encrypted direct messages to others in the OnionShare community, like OnionShare addresses.) To use Keybase, download the `Keybase app <https://keybase.io/download>`_, make an account, and `join this team <https://keybase.io/team/onionshare>`_. Within the app, go to "Teams", click "Join a Team", and type "onionshare".
sq: OnionShare ka një ekip të hapët në Keybase për të diskutuar rreth projektit, për të bërë pyetje, për të ndarë ide dhe konceptime dhe për të bërë plane për zhvillim të ardhshëm. (Është gjithashtu një rrugë e kollajtë për t’u dërguar të tjerëve mesazhe të drejtpërdrejta të fshehtëzuara, në bashkësinë OnionShare, bie fjala, adresa OnionShare.) Që të përdorni Keybase-in, shkarkoni aplikacionin `Keybase <https://keybase.io/download>`_, krijoni një llogari dhe `bëhuni pjesë e këtij ekipi <https://keybase.io/team/onionshare>`_. Brenda aplikacionit, kaloni te “Ekipe”, klikoni “Bëhuni pjesë e një Ekipi” dhe shtypni “onionshare”.

source: OnionShare also has a `mailing list <https://lists.riseup.net/www/subscribe/onionshare-dev>`_ for developers and and designers to discuss the project.
sq: OnionShare ka gjithashtu një `listë postimesh <https://lists.riseup.net/www/subscribe/onionshare-dev>`_ për zhvillues dhe hartues grafikë për të diskutuar rreth projektit.

source: Contributing Code
sq: Kontribut Me Kod

source: OnionShare source code is to be found in this Git repository: https://github.com/onionshare/onionshare
sq: Kodi burim i OnionShare-it mund të gjendet në këtë depo Git: https://github.com/onionshare/onionshare

source: If you'd like to contribute code to OnionShare, it helps to join the Keybase team and ask questions about what you're thinking of working on. You should also review all of the `open issues <https://github.com/onionshare/onionshare/issues>`_ on GitHub to see if there are any you'd like to tackle.
sq: Nëse do të donit të kontribuoni kod te OnionShare, ia vlen të bëheni pjesë e ekipit në Keybase dhe të bëni pyetje rreth çka po mendonit të merreni. Duhet të shqyrtoni gjithashtu krejt `çështjet e hapura <https://github.com/onionshare/onionshare/issues>`_ në GitHub, për të parë se mos ka ndonjë me të cilën do të donit të merreshit.

source: When you're ready to contribute code, open a pull request in the GitHub repository and one of the project maintainers will review it and possibly ask questions, request changes, reject it, or merge it into the project.
sq: Kur të jeni gati të kontribuoni kod, hapni një kërkesë përzierjeje në depon GitHub dhe një nga mirëmbajtësit e projektit do ta shqyrtojë dhe me gjasa do të bëjë pyetje, do të kërkojë ndryshime, do ta hedhë poshtë, ose përziejë te projekti.

source: Starting Development
sq: Si të Fillohet Zhvillimi

source: OnionShare is developed in Python. To get started, clone the Git repository at https://github.com/onionshare/onionshare/ and then consult the ``cli/README.md`` file to learn how to set up your development environment for the command-line version, and the ``desktop/README.md`` file to learn how to set up your development environment for the graphical version.
sq: OnionShare zhvillohet në Python. Që t’ia filloni, klononi depon Git te https://github.com/onionshare/onionshare/ dhe mandej lexoni kartelën ``cli/README.md``, që të mësoni si të ujdisni mjedisin tuaj të zhvillimit për versionin “rresht urdhrash”, si dhe kartelën ``desktop/README.md``, që të mësoni se si të ujdisni mjedisin e zhvillimit për versionin grafik.

source: Those files contain the necessary technical instructions and commands install dependencies for your platform, and to run OnionShare from the source tree.
sq: Këto kartela përmbajnë udhëzime të nevojshme teknike dhe urdhra për të instaluar varësi për platformën tuaj, si dhe për të xhiruar OnionShare-in që nga pema burim.

source: Debugging tips
sq: Ndihëmza diagnostikim

source: Verbose mode
sq: Mënyra fjalamane

source: When developing, it's convenient to run OnionShare from a terminal and add the ``--verbose`` (or ``-v``) flag to the command. This prints a lot of helpful messages to the terminal, such as when certain objects are initialized, when events occur (like buttons clicked, settings saved or reloaded), and other debug info. For example::
sq: Kur kryhet zhvillim, është me leverdi të xhirohet OnionShare-i që nga një terminal dhe të shtohet parametri ``--verbose`` (ose ``-v``) te urdhri i xhirimit. Kjo bën që të shtypen te terminali plot mesazhe të dobishëm, bie fjala, kur gatiten disa objekte të caktuar, kur ndodhin akte (fjala vjen, klikohen butona, ruhen dhe ringarkohen rregullime) dhe të tjera informacione diagnostikimi. Për shembull::

source: You can add your own debug messages by running the ``Common.log`` method from ``onionshare/common.py``. For example::
sq: Mund të shtoni mesazhet tuaj vetjakë të diagnostikimit duke xhiruar metodën ``Common.log`` që nga ``onionshare/common.py``. Për shembull::

source: This can be useful when learning the chain of events that occur when using OnionShare, or the value of certain variables before and after they are manipulated.
sq: Kjo mund të jetë e dobishme kur mësohet vargu i akteve që ndodhin kur përdoret OnionShare, ose vlera e disa ndryshoreve para dhe pasi të jenë manipuluar.

source: Local Only
sq: Vetëm Vendore

source: Tor is slow, and it's often convenient to skip starting onion services altogether during development. You can do this with the ``--local-only`` flag. For example::
sq: Tor-i është i ngadaltë dhe shpesh ia vlen të anashkalohet fare nisja e shërbimeve Onion gjatë zhvillimi. Këtë mund ta bëni me parametrin ``--local-only``. Për shembull::

source: In this case, you load the URL ``http://127.0.0.1:17641`` in a normal web-browser like Firefox, instead of using the Tor Browser. The private key is not actually needed in local-only mode, so you can ignore it.
sq: Në këtë rast, ju ngarkoni URL-në ``http://127.0.0.1:17641`` në një shfletues të zakonshëm, në vend se të përdorni Shfletuesin Tor. Kyçi privat faktikisht nuk është i nevojshëm nën mënyrën vetëm-vendore, ndaj mund ta shpërfillni.

source: Contributing Translations
sq: Kontribut Përkthimesh

source: Help make OnionShare easier to use and more familiar and welcoming for people by translating it on `Hosted Weblate <https://hosted.weblate.org/projects/onionshare/>`_. Always keep the "OnionShare" in latin letters, and use "OnionShare (localname)" if needed.
sq: Ndihmoni të bëhet OnionShare më i kollajtë për t’u përdorur dhe më familjar dhe mikpritës për njerëzit, duke e përkthyer në `Hosted Weblate <https://hosted.weblate.org/projects/onionshare/>`_. “OnionShare”-in mbajeni përherë në shkronja latine dhe përdorni “OnionShare” (emri_si_keni_qejf)”, në u dashtë.

source: To help translate, make a Hosted Weblate account and start contributing.
sq: Për të ndihmuar me përkthim, krijoni një llogari në Hosted Weblate dhe filloni të kontribuoni.

source: Suggestions for Original English Strings
sq: Sugjerime për Vargjet Origjinale Në Anglisht

source: Sometimes the original English strings are wrong, or don't match between the application and the documentation.
sq: Disa nga vargjet origjinalë anglisht janë gabim, ose nuk përputhen me aplikacionit dhe dokumentimit.

source: File source string improvements by adding @kingu to your Weblate comment, or open a GitHub issue or pull request. The latter ensures all upstream developers see the suggestion, and can potentially modify the string via the usual code review processes.
sq: Hapni çështje përmirësimi vargjesh burim, duke shtuar @kingu te komenti juaj në Weblate, ose hapni një çështje, ose kërkesë për tërheqje kodi, në GitHub. Kjo e fundit bën të mundur që sugjerimin ta shohin krejt zhvilluesit dhe mundet, potencialisht, ta ndryshojnë vargun, përmes proceseve të zakonshëm të shqyrtimit të kodit.

source: Status of Translations
sq: Gjendje e Përkthimeve

source: Here is the current translation status. If you want start a translation in a language not yet started, please write to the mailing list: onionshare-dev@lists.riseup.net
sq: Ja gjendja e tanishme e përkthimeve. Nëse doni të nisni një përkthim në një gjuhë ende të panisur, ju lutemi, shkruajini listës së postimeve: onionshare-dev@lists.riseup.net
