Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/features.po
Languages: bg, sq, zh_cn

source: If you intend to put the OnionShare address on your website or social media profiles, save the tab (see :ref:`save_tabs`) and run it as a public service (see :ref:`turn_off_private_key`). It's also a good idea to give it a custom title (see :ref:`custom_titles`).
bg: Ако възнамерявате да поставите адреса на OnionShare на своята страница или в профилите си в социалните мрежи, запазете раздела (вж. :ref:`save_tabs`) и го стартирайте като публична услуга (вж. :ref:`turn_off_private_key`). Добра идея е също така да му зададете някакво заглавие (вижте :ref:`custom_titles`).
sq: Nëse keni ndërmend ta vendosni adresën OnionShare në sajtin tuaj, ose në profile mediash shoqërore, ruajeni skedën (shihni :ref:`save_tabs`) dhe xhirojeni si një shërbim publik (shihni :ref:`turn_off_private_key`). Është gjithashtu ide e mirë t’i jepni një titull të përshtatur (shihni :ref:`custom_titles`).
zh_cn: 如果您打算将 OnionShare 地址放在您的网站或社交媒体个人资料中，请保存此标签页（请参阅：ref:`save_tabs`）并将其作为公共服务运行（请参阅：ref:`turn_off_private_key`）。为其指定自定义标题也是一个好主意（请参阅：ref:`custom_titles`）。

source: Other caveats to be aware of in Receive Mode
bg: Други ограничения, които трябва да се имат предвид в режим на получаване
zh_cn: 接收模式中的其他注意事项

source: There are reports that OnionBrowser on iOS devices are unable to upload files to an OnionShare in Receive Mode, when operating in 'Silver' security mode. Try Bronze or Gold to see if you are able to upload a message or a file.
bg: Има съобщения, че OnionBrowser на устройства с iOS не може да изпраща файлове до OnionShare в режим на полупаване, когато работи в режим на сигурност Сребърен. Използвайте Бронзов или Златен ако не можете да изпратите съобщение или файл.
zh_cn: 有报告称，iOS 设备上的 Onion Browser 在“白银”安全模式运行时无法在接收模式中将文件上传到 OnionShare。尝试使用青铜或黄金模式，看看您能否上传消息或文件。

source: Host a Website
bg: Поддържане на уеб страница
sq: Strehoni një Sajt
zh_cn: 架设一个网站

source: To host a static HTML website with OnionShare, open a website tab, drag the files and folders that make up the static content there, and click "Start sharing" when you are ready.
bg: За да поддържате статична страница на HTML с OnionShare, отворете раздел за уеб страница, завлачете папките и файловете със статичното съдържание в него и когато сте готови натиснете бутона „Споделяне“.
sq: Që të strehoni një sajt statik HTML me OnionShare, hapni një skedë sajti, tërhiqni kartelat dhe dosjet që përbëjnë lëndën statike dhe klikoni “Nis ndarje”, kur të jeni gati.
zh_cn: 利用 OnionShare 架设静态 HTML 网站，请打开网站标签分页并将静态内容的档案与资料夹拖曳到此，就绪后就可以按下"开始共享"。

source: If you add an ``index.html`` file, it will render when someone loads your website. You should also include any other HTML files, CSS files, JavaScript files, and images that make up the website. (Note that OnionShare only supports hosting *static* websites. It can't host websites that execute code or use databases. So you can't for example use WordPress.)
bg: Ако добавите файл ``index.html``, той ще се показва когато някой отвори страницата. Трябва да добавите и всички други HTML файлове, CSS файлове, JavaScript файлове и изображения, които се използват в страницата. (Имайте предвид, че OnionShare поддържа само *статични* страници. Не се поддържат страници, които изпълняват код или използват бази от данни. Така че не можете да използвате да речем WordPress.)
sq: Nëse shtoni një kartelë ``index.html``, ajo do të vizatohet, kur dikush ngarkon sajtin tuaj. Duhet edhe të përfshini çfarëdo kartelash të tjera HTML, kartela CSS, JavaScript dhe figura që përbëjnë sajtin tuaj. (Kini parasysh se OnionShare mbulon vetëm strehim sajtesh *statikë*. S’mund të strehojë sajte që ekzekutojnë kod apo përdorin baza të dhënash. Pra, s’mund të përdorni, për shembull, WordPress.)
zh_cn: 如果有``index.html`` ，有人载入网站时就会呈现这支档案，网站也可加入任何其它 HTML files, CSS, JavaScript 与图片 (请注意 OnionShare 只支援*静态*网站，它无法托管需执行代码或使用资料库，例如不能使用 WordPress.)

source: If you don't have an ``index.html`` file, it will show a directory listing instead, and people loading it can look through the files and download them.
bg: Ако не разполагате с файл на име ``index.html``, то при отваряне на страницата ще бъде показан списък с файловете и хората ще могат да ги разгледат или изтеглят.
sq: Nëse s’keni kartelë ``index.html``, do të shfaqë një paraqitje drejtorie dhe njerëzit që e ngarkojnë sajtin mund të shohin nëpër kartela dhe t’i shkarkojnë ato.
zh_cn: 如果没有``index.html``则会显示一个目录，人们透过它可看到档案来下载。

source: Content Security Policy
bg: Политика за защита на съдържанието
sq: Rregulla Sigurie Lënde
zh_cn: 内容安全政策

source: By default OnionShare helps secure your website by setting a strict `Content Security Policy <https://en.wikipedia.org/wiki/Content_Security_Policy>`_ header. However, this prevents third-party content from loading inside the web page.
bg: По подразбиране OnionShare защитава страницата като задава заглавката `Content Security Policy <https://en.wikipedia.org/wiki/Content_Security_Policy>`_. Но тя предотвратява възможността за зареждане на странични ресурси.
sq: Si parazgjedhje, OnionShare ndihmon të sigurohet sajti juaj duke ujdisur një krye strikte `Content Security Policy <https://en.wikipedia.org/wiki/Content_Security_Policy>`_. Por, kjo pengon ngarkim brenda faqes web të lëndës nga palë të treta.
zh_cn: OnionShare 默认通过设置严格的`内容安全策略 <https://zh.wikipedia.org/wiki/内容安全策略>`_标头来帮助保护您的网站。但是，这会阻止第三方内容加载到网页中。

source: If you want to load content from third-party websites, like assets or JavaScript libraries from CDNs, you have two options:
bg: Ако желаете да зареждате съдържание от трети страни, като библиотеки на JavaScript от мрежи за доставка на съдържание, имате две възможности:
sq: Nëse doni të ngarkoni lëndë nga sajte palë të treta, bie fjala, burime apo biblioteka JavaScript prej CDN-sh, keni dy mundësi:
zh_cn: 如果您想从第三方网站加载内容（如来自 CDN 的资产或 JavaScript 库），则有两种选择：

source: You can disable sending a Content Security Policy header by checking the "Don't send Content Security Policy header (allows your website to use third-party resources)" box before starting the service.
bg: Можете да изключите изпращането на заглавката „Content Security Policy “, като отметнете „Без изпращане на подразбираната заглавка на Content Security Policy (за използване на странични ресурси)“, преди да стартирате услугата.
sq: Mund të çaktivizoni dërgimin e një kryeje “Content Security Policy”, duke i vënë shenjë kutizës “Mos dërgo krye “Content Security Policy” (i lejon sajtit tuaj të përdorë burime palësh të treta)”, para se të nisni shërbimin.
zh_cn: 您可以在启动服务之前选中“不发送内容安全策略标头（允许您的网站使用第三方资源）”框，以禁用发送内容安全策略标头。

source: You can send a custom Content Security Policy header.
bg: Можете да изпращате заглавка „Content Security Policy“ по ваше усмотрение.
sq: Mund të dërgoni një krye vetjake “Content Security Policy”.
zh_cn: 您可以发送自定义内容安全策略标头。

source: Tips for running a website service
bg: Съвети за използване на услугата за страница в интернет
sq: Ndihmëza për xhirimin e një shërbimi sajtesh
zh_cn: 营运网站服务的诀窍

source: If you want to host a long-term website using OnionShare (meaning not just to quickly show someone something), it's recommended you do it on a separate, dedicated computer that is always powered on and connected to the internet, and not on the one you use on a regular basis. Save the tab (see :ref:`save_tabs`) so you can resume the website with the same address if you close OnionShare and re-open it later.
bg: Ако искате дългосрочно да поддържате страница в интернет (не само набързо да покажете нещо на някого), ви препоръчваме да го направите на отделен компютър, който винаги е включен и свързан с интернет, а не на този, който използвате редовно. Запазете раздела (вж. ref:`save_tabs`), така че да можете да възстановите същия адрес ако се наложи да спрете OnionShare и по-късно да го пуснете отново.
sq: Nëse doni të strehoni një sajt për afate të gjata duke përdorur OnionShare (që do të thotë, jo diçka për t’i treguar shpejt e shpejt diçka dikujt), rekomandohet ta bëni në një kompjuter më vete, enkas, q është përherë i ndezur dhe i lidhur në internet dhe jo në një që e përdorni për gjëra të përditshme. Ruajeni skedën (shihni :ref:`save_tabs`), që ta riktheni sajtin me të njëjtën adresë, nëse e mbyllni OnionShare-in dhe e rihapni më vonë.
zh_cn: 如果您想使用 OnionShare 托管一个长期网站（意味着不仅仅是快速向某人展示某些内容），建议您在单独的专用计算机上操作，该计算机始终处于开机状态并连接到互联网，而不是在您经常使用的计算机上操作。保存标签页（请参阅：ref:`save_tabs`），这样如果您关闭 OnionShare 并稍后重新打开它，您就可以使用相同的地址恢复网站。

source: If your website is intended for the public, you should run it as a public service (see :ref:`turn_off_private_key`).
bg: Ако страницата е предназначена за широката публика ви препоръчваме да изключите тайния ключ (вж. ref:`turn_off_private_key`).
sq: Nëse sajti juaj është menduar për publikun, duhet ta xhironi si një shërbim publik (shihni :ref:`turn_off_private_key`).
zh_cn: 如果您的网站是面向公众的，您应该将其作为公共服务运行（请参阅：ref:`turn_off_private_key`）。

source: Chat Anonymously
bg: Анонимен разговор
sq: Bisedoni Në Mënyrë Anonime
zh_cn: 匿名聊天

source: You can use OnionShare to set up a private, secure chat room that doesn't log anything. Just open a chat tab and click "Start chat server".
bg: Посредством OnionShare можете да създадете защитена стая за разговори, за която не се пази дневник. Просто отворете раздел за разговори и натиснете „Включване на сървър за съобщения“.
sq: OnionShare-in mund ta përdorni për të krijuar një dhomë private, të siguruar fjalosjeje, që s’regjistron gjë. Thjesht hapni një skedë fjalosjeje dhe klikoni “Nis shërbyes fjalosjeje”.
zh_cn: 可利用 OnionShare 设定私密安全的聊天室，它不会记录任何数据。请打开聊天标签分页点"启动聊天服务器"。

source: After you start the server, copy the OnionShare address and private key and send them to the people you want in the anonymous chat room. If it's important to limit exactly who can join, use an encrypted messaging app to send out the OnionShare address and private key.
bg: След като стартирате сървъра, копирайте адреса и тайния ключ на OnionShare и ги изпратете на хората, които искате да участват в анонимната стая. Ако е важно да ограничите кръга на хората, които могат да се присъединят, използвайте приложение за шифровани съобщения, за да изпратите адреса и тайния ключ на OnionShare.
sq: Pasi të nisni shërbyesin, kopjoni adresën OnionShare dhe kyçin privat dhe dërgojuani personave që doni të vijnë te dhoma anonime e fjalosjes. Është e rëndësishme të kufizohet saktësisht cilët mund të vijnë, përdorni një aplikacion mesazhesh të fshehtëzuar për të dërguar adresën dhe kyçin privat OnionShare.
zh_cn: 启动服务器后，复制 OnionShare 地址和私钥，并将其发送给匿名聊天室中您想要的人。如果必须严格限制谁可以加入，请使用加密消息应用发送 OnionShare 地址和私钥。

source: People can join the chat room by loading its OnionShare address in Tor Browser. The chat room requires JavasScript, so everyone who wants to participate must have their Tor Browser security level set to "Standard" or "Safer", instead of "Safest".
bg: Вашите кореспондрнти могат да се присъединят към стаята за разговори, като отворят адреса от OnionShare в Tor Browser. Стаята изисква JavasScript, така че всеки, който иска да вземе участие, трябва да настрои нивото на сигурност на Tor Browser на „Стандарто“ или „По-игурно“, вместо „Най-сигурно“.
sq: Personat mund të vijnë te dhoma e fjalosjeve duke ngarkuar adresën e saj OnionShare në Shfletuesin Tor. Dhoma e fjalosjes lyp JavasScript, ndaj, cilido që dëshiron të marrë pjesë, duhet ta ketë vënë shkallën e sigurisë së Shfletuesit Tor si “Standarde”, ose “E parrezik”, në vend se “Më e parrezikshmja”.
zh_cn: 别人可在 Tor 浏览器载入 OnionShare 地址加入聊天室，它需要 JavasScript 因此参与者须把 Tor 浏览器安全等级调成"标准"或"更安全"，"最安全"则不行。

source: When someone joins the chat room they get assigned a random name. They can change their name by typing a new name in the box in the left panel and pressing ↵. Since the chat history isn't saved anywhere, it doesn't get displayed at all, even if others were already chatting in the room.
bg: Когато нов участник се присъедини към стаята, получава произволно име. Това име може да бъде променено в панела в ляво, като въведете новото име и натиснете ↵. Тъй като не се запазва история на разговорите, това име не се появява никъде, дори ако в стаята вече е имало участници.
sq: Kur dikush vjen në dhomën e fjalosjeve, atij mund t’i caktohet një emër kuturu. Ai mund ta ndryshojë emrin e vet duke shtypur një emër të ri te kuadrati te paneli majtas dhe duke shtypur ↵. Bgaqë hsitoriku i fjalosjes s’ruhet gjëkundi, nuk shfaqet aspak, edhe nëse të tjerë qenë duke biseduar në dhomë.
zh_cn: 当新人进入聊天室时，系统会随意给个名字，改动可在左侧面板的方框中轮入新名字再按 ↵ 送出。因为聊天记录不会留存所以根本不会显示，即便是其它已在聊天室的人也看不到。

source: In an OnionShare chat room, everyone is anonymous. Anyone can change their name to anything, and there is no way to confirm anyone's identity.
bg: В стаята за разговори на OnionShare всички са анонимни. Всеки може да промени името си на каквото пожелае и няма начин да бъде потвърдена самоличността на никого от участниците.
sq: Në një dhomë fjalosjeje OnionShare gjithkush është anonim. Cilido mund ta ndryshojë emrin e vet si të dojë dhe s’ka ndonjë rrugë për të ripohuar identitetin e kujtdo.
zh_cn: OnionShare 聊天室成员都是匿名，人人可随时改名字，没办法确认任何人的身份。

source: However, if you create an OnionShare chat room and securely send the address only to a small group of trusted friends using encrypted messages, you can be reasonably confident the people joining the chat room are your friends.
bg: Въпреки това, ако създадете стая за разговори в OnionShare и изпратите адреса по сигурен начин до малка група доверени приятели, чрез шифровани съобщения, можете да бъдете достатъчно сигурни, че участниците, които се присъединяват към стаята за разговори, са ваши приятели.
sq: Por, nëse krijoni një dhomë fjalosjeje OnionShare dhe e dërgoni adresën në mënyrë të siguruar vetëm te një grup shokësh të besuar duke përdorur mesazhe të fshehtëzuar, mund të jeni në mënyrë të arsyeshme i qetë se njerëzit që vijnë në dhomën e fjalosjes janë shokët tuaj.
zh_cn: 开 OnionShare 聊天室并将聊天室地址讯息加密限定给一小群信任的朋友，则可合理地相信聊天室里都是认识的朋友。

source: How is this useful?
bg: Каква е ползата?
sq: Pse është e dobishme kjo?
zh_cn: 对你很有用吗？

source: If you need to already be using an encrypted messaging app, what's the point of an OnionShare chat room to begin with? It leaves less traces.
bg: Има ли смисъл от стаята за разговори на OnionShare, щом трябва да използвам приложение за шифровани съобщения? OnionShare оставя по-малко следи.
sq: Nëse duhet të përdorni tashmë një aplikacion mesazhesh të fshehtëzuar, ç’kuptim ka atëherë një dhomë fjalosjeje OnionShare? Lihen më pak gjurmë.
zh_cn: 如果已使用加密的聊天通信软件，OnionShare 聊天室有什么胜出的特点值得一试呢? 因为它不易查溯。

source: If you for example send a message to a Signal group, a copy of your message ends up on each device (the smartphones, and computers if they set up Signal Desktop) of each member of the group. Even if disappearing messages is turned on, it's hard to confirm all copies of the messages are actually deleted from all devices, and from any other places (like notifications databases) they may have been saved to. OnionShare chat rooms don't store any messages anywhere, so the problem is reduced to a minimum.
bg: Например, ако изпратите съобщение до група в Signal, копие от съобщението ще се попадне на всяко устройство (телефони и компютри, ако някои използва Signal Desktop) на всеки от членовете в групата. Дори ако са включени т.нар „изчезващи съобщения“, е трудно да сте сигурни, че всички копия на съобщенията са действително премахнати от всички устройства и от всички други места (напр. от известията), на които може да са били запазени. Стаята за разговори на OnionShare не пази никъде никакви съобщения, така че проблемът е сведен до минимум.
sq: Nëse ju, për shembull, dërgoni një mesazh te një grup Signal, një kopje e mesazhit tuaj përfundon në çdo pajisje (telefonat dhe kompjuterat, nëse kanë instaluar Signal Desktop) të çdo anëtari të grupit. Edhe nëse janë aktivizuar mesazhe që treten, është e vështirë të siguroheni se krejt kopjet e mesazhit janë fshirë faktikisht nga krejt pajisjet dhe prej çfarëdo vendesh të tjera (fjala vjen, nga baza të dhënash njoftimesh) ku mund të kenë qenë dërguar. Dhomat e fjalosjes OnionShare s’depozitojnë kund mesazhe, ndaj problemi është reduktuar në minimum.
zh_cn: 例如，如果您向 Signal 群聊发送消息，则该消息的副本将出现在群聊每位成员的每台设备上（智能手机和计算机，如果他们设置了 Signal 桌面版）。即使启用了“消失消息”功能，也很难确认所有消息副本是否确实从所有设备中删除，以及从可能保存消息的任何其他地方（如通知数据库）中删除。OnionShare 聊天室不会在任何地方存储任何消息，因此问题被降到最低限度。

source: OnionShare chat rooms can also be useful for people wanting to chat anonymously and securely with someone without needing to create any accounts. For example, a source can send an OnionShare address to a journalist using a disposable email address, and then wait for the journalist to join the chat room, all without compromosing their anonymity.
bg: Стаите за разговори на OnionShare могат да бъдат полезни и за хора, които искат да разговарят анонимно и сигурно с някого, без да е необходимо да създават профили. Например източникът може да изпрати адрес на OnionShare до журналист, като използва адрес на ел. поща за еднократна употреба, и след това да изчака журналистът да се присъедини към стаята, всичко това без да разкрива самоличността си.
sq: Dhomat e fjalosjeve OnionShare mund të jenë gjithashtu të dobishme për persona që duan të bisedojnë në mënyrë anonime dhe të siguruar me dikë, pa u dashur të krijohet çfarëdo llogarie. Për shembull, një burim dërgon një adresë OnionShare te një gazetar duke përdorur një adresë email njëpërdorimshe dhe mandej pret që gazetari të vijë në dhomën e fjalosjes, gjithçka pa komprometuar anonimitetin e vet.
zh_cn: OnionShare 聊天室对于想要匿名安全地与他人聊天而无需创建任何账号的人来说也很有用。例如，消息来源可以使用一次性电子邮件地址向记者发送 OnionShare 地址，然后等待记者加入聊天室，所有这些都不会损害他们的匿名性。

source: How does the encryption work?
bg: Как работи шифроването?
sq: Si funksionon fshehtëzimi?
zh_cn: 加密如何运作?

source: Because OnionShare relies on Tor onion services, connections between the Tor Browser and OnionShare are all end-to-end encrypted (E2EE). When someone posts a message to an OnionShare chat room, they send it to the server through the E2EE onion connection, which then sends it to all other members of the chat room using WebSockets, through their E2EE onion connections.
bg: OnionShare разчита на услугите на Tor onion и всички връзки между Tor Browser и OnionShare са шифровани от край до край (E2EE). Когато някой изпраща съобщение в стаята за разговори на OnionShare, то се предава към сървъра чрез E2EE връзка. След това сървърът го разпраща до всички участници в стаята с помощта на WebSockets, също използвайки шифрованите от край до край връзки на всеки участник.
sq: Ngaqë OnionShare bazohet në shërbime Onion Tor, lidhjet mes Shfletuesit Tor dhe OnionShare-it janë të tëra të fshehtëzuara skaj-më-skaj (E2EE). Kur dikush poston një mesazh në një dhomë fjalosjeje OnionShare, ata e dërgojnë te shërbyesi përmes lidhjes E2EE Onion, e cila mandej e dërgon te krejt anëtarët e tjerë të dhomës së fjalosjes duke përdorur WebSockets, përmes lidhjesh E2EE Onion.
zh_cn: OnionShare 须仰赖 Tor 洋葱服务，两者间连接都是端对端加密 (E2EE)。当某人在 OnionShare 聊天室送出讯息，透过 E2EE 洋葱连接送到伺服器，洋葱连接再透过 WebSockets 用各自的 E2EE 洋葱连接把讯息发给聊天室其它成员。

source: OnionShare doesn't implement any chat encryption on its own. It relies on the Tor onion service's encryption instead.
bg: OnionShare не шифрова съдържанието на разовора. То се осигурява от услуги на onion от мрежата на Tor.
sq: OnionShare nuk sendërton ndonjë fshehtëzim të vetin fjalosjesh. Bë vend të kësaj, bazohet te fshehtëzimi i shërbimit Onion Tor.
zh_cn: OnionShare 自身不能对聊天加密，须靠 Tor 洋葱服务加密。
