Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/features.po
Languages: bg, sq, zh_cn

source: How OnionShare Works
bg: Принцип на работа на OnionShare
sq: Si Funksionon OnionShare-i
zh_cn: OnionShare 如何运作

source: Web servers are started locally on your computer and made accessible to other people as `Tor <https://www.torproject.org/>`_ `onion services <https://community.torproject.org/onion-services/>`_.
bg: Услугите работят на вашето устройство и стават достъпни за други хора като `услуги на onion <https://community.torproject.org/onion-services/>`_ през `Tor <https://www.torproject.org/>`_.
sq: Shërbyesit nisen lokalisht, në kompjuterin tuaj dhe jepen për persona të tjerë si `shërbime Onion <https://community.torproject.org/onion-services/>`_ `Tor <https://www.torproject.org/>`_.
zh_cn: Web 服务器在计算机上本地启动，并作为 `Tor <https://www.torproject.org/zh-CN/>`_ `洋葱服务<https://community.torproject.org/onion-services/>`_供其他人访问。

source: By default, OnionShare web addresses are protected with a private key.
bg: По подразбиране адресите на OnionShare са защитени с частен ключ.
sq: Si parazgjedhje, adresat web OnionShare mbrohen me një kyç privat.
zh_cn: OnionShare 网址默认受私钥保护。

source: OnionShare addresses look something like this::
bg: Адресите на OnionShare изглеждат подобно на::
sq: Adresat OnionShare duke pak a shumë kështu::
zh_cn: OnionShare 地址看起来像这样：

source: And private keys might look something like this::
bg: А частните ключове изглеждат подобно на::
sq: Dhe kyet privatë mund të duken pak a shumë kështu::
zh_cn: 私钥可能看起来像这样：

source: You're responsible for securely sharing that URL and private key using a communication channel of your choice like in an encrypted chat message, or using something less secure like unencrypted email, depending on your `threat model <https://ssd.eff.org/module/your-security-plan>`_.
bg: Вие самите носите отговорността за сигурното споделяне на адреса и частния ключ, използвайки канал за връзка по ваш избор, например чрез шифрован чат, или чрез нещо по-малко сигурно, като нешифровано електронно писмо, в зависимост от `модела на заплахата ви <https://ssd.eff.org/module/your-security-plan>`_.
sq: Përgjegjësinë për ndarjen me të tjerët në mënyrë të siguruar të asaj URL-je dhe kyçit privat, duke përdorur një kanal komunikimi sipas dëshirës tuaj, bie fjala, në një mesazh fjalosjeje të fshehtëzuar, ose duke përdorur diçka tjetër më pak të siguruar, fjala vjen një email të pafshehtëzuar, në varësi të `modelit tuaj të kërcënimeve <https://ssd.eff.org/module/your-security-plan>`_, e keni ju .
zh_cn: 您有责任使用您选择的通信渠道（例如加密的聊天消息）安全地分享该 URL 和私钥，或者使用如未加密的电子邮件等不太安全的方式，具体取决于您的`威胁模型 <https://ssd.eff.org/module/your-security-plan>`_。

source: The people you send the URL to then copy and paste it into their `Tor Browser <https://www.torproject.org/>`_ to access the OnionShare service. Tor Browser will then prompt for the private key, which the people can also then copy and paste in.
bg: Хората, на които изпращате адреса, го копират и поставят в `Tor Browser <https://www.torproject.org/>`_, за да получат достъп до услугата на OnionShare. След това Tor Browser ще поиска частния ключ, който хората да копират и поставят.
sq: Mandej personat të cilëve u dërgoni URL-në e kopjojnë dhe e hedhin te `Shfletuesi i tyre Tor <https://www.torproject.org/>`_, që të përdorin shërbimin OnionShare. Shfletuesi Tor mandej do të kërkojë kyçin privat, të cilin personat mund ta kopjojnë dhe ngjitin te vendi përkatës.
zh_cn: 然后，您发送 URL 的人会将其复制并粘贴到他们的 `Tor 浏览器 <https://www.torproject.org/zh-CN/>`_ 中，以访问 OnionShare 服务。然后，Tor 浏览器会提示输入私钥，人们也可以复制并粘贴私钥。

source: If you run OnionShare on your laptop to send someone files, and then suspend it before the files are sent, the service will not be available until your laptop is unsuspended and on the internet again. OnionShare works best when working with people in real-time.
bg: Ако отворите OnionShare на лаптопа си и изпращате файлове на някого, след това спрете лаптопа, но преди файловете да бъдат изпратени, услугата няма да бъде достъпна, докато лаптопът ви не бъде отново включен и с додтъп до интернет. OnionShare работи най-добре, когато работите с хората в реално време.
sq: Nëse xhironi OnionShar-in në portativin tuaj për të dërguar kartela dhe mandej e pezulloni para se të dërgohen kartelat, shërbimi s’do të jetë në punë, deri sa portativi juaj të ketë dalë nga pezullimi dhe të jetë sërish në internet. OnionShare funksionon më mirë, kur përdoret nga njerëzit aty për aty.
zh_cn: 如果您在笔记本电脑上运行 OnionShare 来向某人发送文件，然后在发送文件之前将其暂停，则该服务将不可用，直到您的笔记本电脑取消暂停并再次连接到互联网。OnionShare 在与人们实时合作时效果最佳。

source: Because your own computer is the web server, *no third party can access anything that happens in OnionShare*, not even the developers of OnionShare. It's completely private. And because OnionShare is based on Tor onion services too, it also protects your anonymity. See the :doc:`security design </security>` for more info.
bg: Тъй като сървърът е вашият собствен компютър, *никакви трети лица нямат достъп до вътрешните процеси в OnionShare*, дори и разработчиците на OnionShare. Приложението е напълно поверително. И тъй като OnionShare използва услугите на onion през Tor, той също допълнително защитава анонимността ви. За повече информация вижте :doc:`модела на сигурност </security>`.
sq: Ngaqë kompjuteri juaj është shërbyesi, *asnjë palë e tretë s’mund të fusë hundët në çfarë po ndodh në OnionShare*, as edhe zhvilluesit e OnionShare-it. Është plotësisht privat. Dhe meqë OnionShare-i bazohet në shërbime Onion Tor, mbron edhe anonimitetin tuaj. Për më tepër informacion, shihni :doc:`security design </security>` .
zh_cn: 因为你自己的电脑是网络服务器，*任何第三方都不能获知 OnionShare *中发生的任何事情，甚至是 OnionShare 的开发者也不能。它是完全私有的。而 OnionShare 也是基于 Tor Onion service，所以它也保护了你的匿名性。请参阅 :doc:`security design </security>` 以了解更多信息。

source: Share Files
bg: Споделяне на файлове
sq: Ndani Kartela
zh_cn: 共享文件

source: You can use OnionShare to send files and folders to people securely and anonymously. Open a share tab, drag in the files and folders you wish to share, and click "Start sharing".
bg: Можете да използвате OnionShare за сигурно и анонимно изпращане файлове и папки. Отворете раздела за споделяне, плъзнете и пуснете файловете и папките, които искате да споделите, и натиснете бутона „Споделяне“.
sq: Mund ta përdorni OnionShare-in të dërgoni kartela dhe dosje te persona, në mënyrë të siguruar dhe anonime. Hapni një skedë ndarjesh me të tjerë, tërhiqni atje kartelat dhe dosjet që doni të ndani dhe klikoni “Fillo ndarjen”.
zh_cn: 你可以使用 OnionShare 来安全且匿名地发送文件和文件夹给别人。打开一个共享标签页，拖入你想共享的文件和文件夹，然后点击“开始共享”。

source: After you add files, you'll see some settings. Make sure you choose the setting you're interested in before you start sharing.
bg: След като добавите файлове към OnionShare, ще се появят някои настройки. Уверете се, че използвате само настройките, които ви интересуват, преди да започнете да споделяте.
sq: Pasi shtoni kartelat tuaja, do të shihni disa rregullime. Sigurohuni se zgjidhni rregullimet që doni, para se të nisni ndarjen me të tjerë.
zh_cn: 在你添加了文件后，你会看到一些设定选项。请确保你在开始分享前选中了那些你感兴趣的选项。

source: As soon as someone finishes downloading your files, OnionShare will automatically stop the server, removing the website from the internet. To allow multiple people to download them, uncheck the "Stop sharing after files have been sent (uncheck to allow downloading individual files)" box.
bg: Веднага щом някой приключи с изтеглянето на файловете, OnionShare автоматично ще спре сървъра и ще премахне достъпа през интернет. За да позволите на няколко души да ги изтеглят, махнете отметката от „Изключване на услугата след изпращане на файловете (за изтегляне на отделни файлове махнете отметката)“.
sq: Sapo dikush përfundon së shkarkuari kartelat tuaja, OnionShare-i do të ndalë vetvetiu shërbyesin, duke e hequr sajtin nga interneti. Që të lejoni një numër personash t’i shkarkojnë, hiqjani shenjë kutizës “Ndale ndarjen me të tjerë, pasi të jenë dërguar kartela (hiqjani shenjën që të lejoni shkarkim kartelash individuale)”.
zh_cn: 一旦有人下载完您的文件，OnionShare 将自动停止服务器，将网站从互联网上移除。要允许多人下载，请取消选中“发送文件后停止分享（取消选中以允许下载单个文件）”框。

source: Also, if you uncheck this box, people will be able to download the individual files you share rather than a single compressed version of all the files.
bg: Също така, ако отметката е махната, хората ще могат да изтеглят отделни споделени файлове, вместо един голям архив.
sq: Veç kësaj, nëse i hiqni shenjën kësaj kutize, personat do të jenë në gjendje të shkarkojnë kartela individuale që jepni, në vend se një version njësh të ngjeshur të krejt kartelave.
zh_cn: 如果取消勾选，别人可下载所共享的个别档案而不是全部档案的单一压缩版。

source: When you're ready to share, click the "Start sharing" button. You can always click "Stop sharing", or quit OnionShare, immediately taking the website down. You can also click the "↑" icon in the top-right corner to show the history and progress of people downloading files from you.
bg: Когато сте готови, натиснете бутона „Споделяне“. Ако се налага винаги межете да натиснете „Изключване на споделянето“ или да излезете от OnionShare, което незабавно ще спре достъпа. За преглед на историята и напредъка на споделените файлове, натиснете пиктограната „↑“ в горния десен ъгъл.
sq: Kur të jeni gati për ndarje, klikoni butonin “Nis ndarjen”. Mundeni në çfarëdo kohe të klikoni “Ndale ndarjen”, ose të mbyllni OnionShare-in, duke zhdukur menjëherë sajtin. Mundeni edhe të klikoni ikonën “↑” në cepin e sipërm djathtas, që të shfaqet historiku dhe ecuria e shkarkimeve nga persona prej jush.
zh_cn: 准备要共享了，请点 "开始共享" 按钮，可随时按"停止共享"或是退出 OnionShare， 网站就会立即关闭。也可以点击右上角 "↑" 图标查看分享给别人的记录与下载进度。

source: Now that you have a OnionShare, copy the address and the private key and send it to the person you want to receive the files. If the files need to stay secure, or the person is otherwise exposed to danger, use an encrypted messaging app.
bg: След като вече разполагате с адреса на услугата на OnionShare, той трябва да бъде копиран и изпратен на получателя на файловете. Ако те трябва да останат защитени или получателят по някакъв начин е застрашен, за да изпратите адреса използвайте приложение за шифровани съобщения.
sq: Tani që keni një OnionShare, kopjoni adresën dhe kyçin privat dhe dërgojani personit që doni të marrë kartelat. Nëse duhet që kartelat të jenë të parrezik, ose personi i ekspozohet rrezikut, përdorni një aplikacion shkëmbimi mesazhesh të fshehtëzuar.
zh_cn: 现在您有了 OnionShare，请复制地址和私钥并将其发送给您希望接收文件的人。如果文件需要保持安全，或者此人面临其他危险，请使用加密消息应用。

source: That person then must load the address in Tor Browser. After logging in with the private key, the files can be downloaded directly from your computer by clicking the "Download Files" link in the corner.
bg: Така полученият адрес трябва да бъде въведен в адресната лента на Tor Browser. След удостоверяване с частния ключ, получателят ще може да изтегли файловете, директно от вашето устройство като натисне препратката „Изтегляне на файлове“.
sq: Ai person mandej duhet ta ngarkojë adresën në Shfletuesin Tor. Pasi të bëjë hyrjen në llogari me kyçin privat, kartelat mund të shkarkohen drejt e prej kompjuterit tuaj duke klikuar lidhjen “Shkarko Kartelat” te cepi.
zh_cn: 然后，此人必须在 Tor 浏览器中加载该地址。使用私钥登录后，可以通过单击角落中的“下载文件”链接直接从您的计算机下载文件。

source: Receive Files and Messages
bg: Получаване на файлове и съобщения
sq: Merrni Kartela dhe Mesazhe
zh_cn: 接收文件和消息

source: You can use OnionShare to let people anonymously submit files and messages directly to your computer, essentially turning it into an anonymous dropbox. Open a receive tab and choose the settings that you want.
bg: Можете да използвате OnionShare, за да дадете на хората възможност анонимно да изпращат файлове и съобщения, директно на устройство ви, като по същество го превърнете в анонимна пощенска кутия. Отворете раздела за получаване и задайте желаните настройки.
sq: Mund ta përdorni OnionShare-in për t’i lënë njerëzit të parashtrojnë kartela dhe mesazhe në mënyrë anonime drejt e te kompjuteri juaj, duke e shndërruar në thelb në një <em>dropbox</em> anonim. Hapni një skedë marrjesh dhe zgjidhni rregullimet që doni.
zh_cn: 您可以使用 OnionShare 让人们匿名直接向您的计算机提交文件和消息，本质上将其变成一个匿名 Dropbox。打开接收标签页并选择所需的设置。

source: You can browse for a folder to save messages and files that get submitted.
bg: Можете да посочите папката, в която ще се запазват получените съобщения и файлове.
sq: Mund të shfletoni për të zgjedhur një dosje për ruajtje mesazhesh dhe kartelash që parashtrohen.
zh_cn: 您可以浏览文件夹来保存已提交的消息和文件。

source: You can check "Disable submitting text" if want to only allow file uploads, and you can check "Disable uploading files" if you want to only allow submitting text messages, like for an anonymous contact form.
bg: Можете да отметнете полето „Без изпращане на съобщения“, ако желаете да разрешите само качването на файлове, и можете да поставите отметка пред „Без качване на файлове, ако искате да разрешите само изпращането на текстовисъобщения, например за анонимна форма за контакт.
sq: Mund t’i vini shenjë “Çaktivizo parashtrime teksti”, nëse doni të lejoni vetëm ngarkime kartelash dhe mund t’i vini shenjë “Çaktivizo ngarkim kartelash”, nëse doni të lejohet vetëm parashtrim mesazhesh tekst, bie fjala, për një forum kontaktesh anonimë.
zh_cn: 如果要只允许文件上传，可以选中“禁用提交文本”；如果要只允许提交文本消息（例如匿名联系表），可以选中“禁用上传文件”。

source: You can check "Use notification webhook" and then choose a webhook URL if you want to be notified when someone submits files or messages to your OnionShare service. If you use this feature, OnionShare will make an HTTP POST request to this URL whenever someone submits files or messages. For example, if you want to get an encrypted text messaging on the messaging app `Keybase <https://keybase.io/>`_, you can start a conversation with `@webhookbot <https://keybase.io/webhookbot>`_, type ``!webhook create onionshare-alerts``, and it will respond with a URL. Use that as the notification webhook URL. If someone uploads a file to your receive mode service, @webhookbot will send you a message on Keybase letting you know as soon as it happens.
bg: Може да отметнете „Отдалечено известяване“ и след това да изберете адрес, ако искате да бъдете уведомявани, когато някой изпрати файлове или съобщения към вашата услуга на OnionShare. Ако отметнете тази настройка, OnionShare ще направи HTTP POST заявка към този адрес, когато някой изпрати файлове или съобщения. Например, ако искате да получите шифровано текстово съобщение в приложението за съобщения `Keybase <https://keybase.io/>`_, можете да започнете разговор с `@webhookbot <https://keybase.io/webhookbot>`_, да въведете ``!webhook create onionshare-alerts`` и той ще отговори с адрес. Използвайте го като адрес за отдалечено известяване. Когато някой качи файл, @webhookbot ще ви изпрати съобщение в Keybase, с което ще ви уведоми, че това се е случило.
sq: Mund t’i vini shenjë “Përdor <em>webhook</em> njoftimesh” dhe mandej të zgjidhni një URL webhook-u, nëse doni të njoftoheni, kur dikush parashtron kartela apo mesazhe te shërbimi juaj OnionShare. Nëse e përdorni këtë veçori, OnionShare do të bëjë një kërkesë HTTP POST te kjo URL, kurdo që dikush parashtron kartela ose mesazhe. Për shembull, nëse doni të merrni një mesazh tekst të fshehtëzuar te aplikacioni për shkëmbim mesazhesh `Keybase <https://keybase.io/>`_, mund të nisni një bisedë me `@webhookbot <https://keybase.io/webhookbot>`_, shtypni ``!webhook create onionshare-alerts`` dhe do të përgjigjet me një URL. Përdoreni atë si një URL webhook-u njoftimesh. Nëse dikush ngarkon një kartelë te shërbimi juaj marrës, @webhookbot do t’ju dërgojë një mesazh në Keybase, duke jua bërë të ditur sapo të ndodhë.
zh_cn: 如果您想在有人向您的 OnionShare 服务提交文件或消息时收到通知，您可以选中“使用通知 webhook”，然后选择 webhook URL。如果您使用此功能，OnionShare 会在有人提交文件或消息时向此 URL 发出 HTTP POST 请求。例如，如果您想在消息应用 `Keybase <https://keybase.io/>`_ 上获取加密文本消息，您可以与 `@webhookbot <https://keybase.io/webhookbot>`_ 开始对话，输入 ``!webhook create onionshare-alerts``，它将以 URL 响应。将其用作通知 webhook URL。如果有人将文件上传到您的接收模式服务，@webhookbot 会在 Keybase 上向您发送一条消息，通知您。

source: When you are ready, click "Start Receive Mode". This starts the OnionShare service. Anyone loading this address in their Tor Browser will be able to submit files and messages which get uploaded to your computer.
bg: Когато сте готови, натиснете „Включване на режим получаване“, за да стартира услугата OnionShare. Всеки, който зареди този адрес в своя Tor Browser, ще може да изпраща файлове и съобщения, които се получават от вашия компютър.
sq: Kur të jeni gati, klikoni “Nis Mënyrën Marrje”. Kështu niset shërbimi OnionShare. Cilido që ngarkon këtë adresë në Shfletuesin e vet Tor do të jetë në gjendje të parashtrojë kartela dhe mesazhe të cilat ngarkohen në kompjuterin tuaj.
zh_cn: 准备就绪后，单击“启动接收模式”。这将启动 OnionShare 服务。任何在 Tor 浏览器中加载此地址的人都可以提交文件和消息，这些文件和消息将上传到您的计算机。

source: You can also click the down "↓" icon in the top-right corner to show the history and progress of people sending files to you.
bg: За да видите историята и напредъка на изпращаните файлове, можете да натиснете пиктограмата стрелка надолу „↓“ в горния десен ъгъл.
sq: Mundeni edhe të klikoni ikonën “↓” poshtë në cepin e sipërm djathtas, për të shfaqur historikun dhe ecurinë e kartelave të dërguara për ju nga njerëzit.
zh_cn: 也可以点右上角 "↓" 图标 ，即显示别人传送给你的档案记录与进度。

source: Here is what it looks like for someone sending you files and messages.
bg: Това вижда, някой който ви изпраща файлове и съобщения.
sq: Ja se si duket për dikë që po ju dërgon kartela dhe mesazhe.
zh_cn: 以下是某人向您发送文件和消息的情况。

source: When someone submits files or messages to your receive service, by default they get saved to a folder called ``OnionShare`` in the home folder on your computer, automatically organized into separate subfolders based on the time that the files get uploaded.
bg: Когато някой изпрати файлове или съобщения в услугата за получаване, по подразбиране те се записват в папка, наречена ``OnionShare``, в домшната папка на компютъра, като автоматично се организират в отделни папки в зависимост от времето на получаване на файловете.
sq: Kur dikush parashtron kartela apo mesazhe te shërbimi juaj marrës, si parazgjedhje, këto ruhen te një dosje e quajtur ``OnionShare`` te dosja shtëpi në kompjuterin tuaj, të sistemuara automatikisht në nëndosje më vete, bazuar në kohën kur ngarkohen kartelat.
zh_cn: 当有人向您的接收服务提交文件或消息时，它们会默认保存到计算机主文件夹中称为 ``OnionShare`` 的文件夹中，并根据文件上传的时间自动整理到单独的子文件夹中。

source: Setting up an OnionShare receiving service is useful for journalists and others needing to securely accept documents from anonymous sources. When used in this way, OnionShare is sort of like a lightweight, simpler, not quite as secure version of `SecureDrop <https://securedrop.org/>`_, the whistleblower submission system.
bg: Създаването на услуга за получаване на OnionShare е полезно за журналисти и други лица, които трябва по сигурен начин да получават документи от анонимни източници. Когато се използва по този начин, OnionShare е нещо като олекотена, по-проста и не толкова сигурна версия на `SecureDrop <https://securedrop.org/>`_, системата за подаване на сигнали за нередности.
sq: Ujdisja e një shërbimi marrës OnionShare është e dobishme për gazetarë dhe të tjerë që duhet të pranojnë në mënyrë të parrezik dokumente nga burime anonime. Kur përdoret në këtë mënyrë, OnionShare është në njëfarë mënyre një version i peshës së lehtë, më i thjeshtë, jo aq i siguruar, i `SecureDrop <https://securedrop.org/>`_, sistemi i parashtrimeve nga nxjerrës sekretesh.
zh_cn: 设定 OnionShare 接收服务对新闻记者与安全收取匿名来源文件很实用。在这类用途中，OnionShare 就像轻量、简易但安全性稍弱的 `SecureDrop <https://securedrop.org/>`_, 揭密举报提交系统。

source: Use at your own risk
bg: Използвайте на своя отговорност
sq: Përdoreni duke mbajtur vetë përgjegjësi për rreziqe
zh_cn: 使用风险自担

source: Just like with malicious email attachments, it's possible someone could try to attack your computer by uploading a malicious file to your OnionShare service. OnionShare does not add any safety mechanisms to protect your system from malicious files.
bg: Подобно на зловредните прикачени файлове към електронната поща, е възможно някой да се опита да атакува компютъра ви, като изпрати зловреден файл в услугата OnionShare. OnionShare не добавя никакви механизми за безопасност, за да защити системата ви от зловредни файлове.
sq: Ashtu si me bashkëngjitje email dashakeqe, është e mundshme që dikush të provojë të sulmojë kompjuterin tuaj duke ngarkuar një kartelë dashakeqe te shërbimi juaj OnionShare . OnionShare nuk shton ndonjë mekanizëm sigurie për të mbrojtur sistemin tuaj nga kartela dashakeqe.
zh_cn: 就像恶意电子邮件附件一样，有人可能会尝试通过将恶意文件上传到您的 OnionShare 服务来攻击您的计算机。OnionShare 不会添加任何安全机制来保护您的系统免受恶意文件的攻击。

source: If you receive an Office document or a PDF through OnionShare, you can convert these documents into PDFs that are safe to open using `Dangerzone <https://dangerzone.rocks/>`_. You can also protect yourself when opening untrusted documents by opening them in `Tails <https://tails.boum.org/>`_ or in a `Qubes <https://qubes-os.org/>`_ disposableVM.
bg: Ако получите документ от Office или PDF чрез OnionShare, можете да преобразувате тези документи в PDF файлове, които са безопасни за отваряне, като използвате `Dangerzone <https://dangerzone.rocks/>`_. Можете също така да се защитите при отваряне на ненадеждни документи, като ги отворите в `Tails <https://tails.boum.org/>`_ или във виртуална машина за еднократна употреба на `Qubes <https://qubes-os.org/>`_.
sq: Nëse merrni një dokument Office, apo një PDF përmes OnionShare-it, mund t’i shndërroni këto dokumente në PDF që janë pa rrezik për t’i hapur duke përdorur `Dangerzone <https://dangerzone.rocks/>`_. Mund edhe të mbroni veten, kur hapni dokumente që s’u zini besë, duke i hapur në `Tails <https://tails.boum.org/>`_, ose në një `Makinë Virtuale njëpërdorimshme Qubes <https://qubes-os.org/>`_.
zh_cn: 如果您通过 OnionShare 收到 Office 文档或 PDF，则可以将这些文档转换为可以使用 `Dangerzone <https://dangerzone.rocks/>`_ 安全打开的 PDF。您还可以通过在 `Tails <https://tails.boum.org/>`_ 或 `Qubes <https://qubes-os.org/>`_ 一次性虚拟机中打开不受信任的文档来保护自己。

source: However, it is always safe to open text messages sent through OnionShare.
bg: Въпреки това във всички случаи е безопасно да отваряте текстови съобщения, изпратени чрез OnionShare.
sq: Megjithatë, është përherë pa rrezik të hapen mesazhe tekst dërguar përmes OnionShare-it.
zh_cn: 然而，打开通过 OnionShare 发送的文本消息总是安全的。

source: Tips for running a receive service
bg: Съвети за използване на услугата за получаване на файлове
sq: Ndihmëza për xhirimin e një shërbimi marrjesh
zh_cn: 运行接收服务的诀窍

source: If you want to host your own anonymous dropbox using OnionShare, it's recommended you do so on a separate, dedicated computer always powered on and connected to the internet, and not on the one you use on a regular basis.
bg: Ако искате да направите своя собствена анонимна пощенска кутия като използвате OnionShare, ви препоръчваме да го направите на отделен компютър, който винаги е включен и свързан с интернет, а не на този, който използвате редовно.
sq: Nëse doni të strehoni një <em>dropbox</em> tuajin anonim duke përdorur OnionShare-in, rekomandohet ta bëni këtë në një kompjuter më vete, enkas, që rri gjithnjë ndezur dhe i lidhur në internet dhe jo në një që e përdorni për përditë.
zh_cn: 如果您想使用 OnionShare 托管您自己的匿名 Dropbox，建议您在一台始终开机并连接到互联网的单独的专用计算机上进行操作，而不是在您经常使用的计算机上进行操作。
