Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/install.po
Languages: it, sq, vi, zh_cn

source: The ports collection also offers a dedicated port for the **Command-line only** version of OnionShare. Replace ``www/onionshare`` by ``www/onionshare-cli`` if you want to install that version.
it: La collezione di porte offre anche una porta dedicata alla versione **a linea di comando** di OnionShare. Sostituire ``www/onionshare'‘ con ``www/onionshare-cli’' se si vuole installare questa versione.
sq: Koleksioni i bartjeve ofron gjithashtu një bartje enkas për versionin **Vetëm rresht urdhrash** të OnionShare-it. Zëvendësoni ``www/onionshare`` me ``www/onionshare-cli``, nëse doni të instaloni atë version.
vi: Bộ sưu tập cổng cũng cung cấp một cổng chuyên dụng cho phiên bản **Chỉ dòng lệnh** của OnionShare. Thay thế ``www/onionshare`` bằng ``www/onionshare-cli`` nếu bạn muốn cài đặt phiên bản đó.
zh_cn: Ports Collection 还为 OnionShare 的**仅命令行**版本提供了专用 port。如果您想要安装该版本，请将 ``www/onionshare`` 替换为 ``www/onionshare-cli`` 。

source: For additional information and details about the FreeBSD ports collection, please refer to its `official Handbook section about ports <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.
it: Per ulteriori informazioni e dettagli sulla collezione di porte FreeBSD, consultare la sezione `ufficiale del manuale sulle porte <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.
sq: Për informacion dhe hollësi shtesë rreth koleksionit të bartjeve FreeBSD, ju lutemi, shihni `pjesën për bartje, te Doracaku zyrtar <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.
vi: Để biết thêm thông tin chi tiết về bộ sưu tập cổng FreeBSD, vui lòng tham khảo `phần Sổ tay chính thức về cổng <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_.
zh_cn: 有关 FreeBSD Ports Collection 的更多信息和详细信息，请参阅其`有关 ports 的官方手册部分 <https://docs.freebsd.org/en/books/handbook/ports/#ports-using>`_。

source: Verifying PGP signatures
it: Verifica delle firme PGP
sq: Verifikim nënshkrimesh PGP
vi: Việc xác minh chữ ký PGP
zh_cn: 验证 PGP 签名

source: You can verify that the package you download is legitimate and hasn't been tampered with by verifying its PGP signature. For Windows and macOS, this step is optional and provides defense in depth: the OnionShare binaries include operating system-specific signatures, and you can just rely on those alone if you'd like.
it: Puoi verificare che il pacchetto scaricato sia legittimo e non sia stato manomesso verificando la sua firma PGP. Per Windows e macOS, questo passaggio è facoltativo e fornisce una difesa maggiore: i file binari di OnionShare includono firme specifiche del sistema operativo e se lo vuoi puoi semplicemente fare affidamento solo su quelle.
sq: Se paketa që shkarkoni është e ligjshme dhe s’është prekur mund ta verifikoni duke verifikuar nënshkrimin PGP për të. Për Windows dhe macOS, ky hap është opsional dhe jep mbrojtje të thelluar: dyorët OnionShare përmbajnë nënshkrime specifike për sistemin dhe mund të bazoheni thjesht në këto, nëse do të donit.
vi: Bạn có thể xác minh rằng gói mà bạn tải xuống là hợp pháp hợp lệ và không bị giả mạo hoặc xáo trộn bằng cách xác minh chữ ký PGP của nó. Đối với hệ điều hành Windows và macOS, bước này là tùy chọn và cung cấp khả năng bảo vệ chuyên sâu: các nhị phân OnionShare binaries bao gồm các chữ ký dành riêng cho hệ điều hành, và bạn có thể chỉ cần dựa vào những chữ ký đó mà thôi nếu bạn muốn.
zh_cn: 你可以通过验证其 PGP 签名来验证你下载的软件包是可靠且未被篡改过的。对于 Windows 和 macOS 来说，这一步是可选的，并提供更深层次的保护：OnionShare 的二进制文件中包含操作系统特定的数字签名，如果你愿意的话，你可以只依赖这些签名。

source: Signing key
sq: Kyç nënshkrimesh
vi: Khoá key chữ ký
zh_cn: 签名密钥

source: Packages are signed by the core developer who is responsible for the particular release. Here is the GPG key information for each of the core developers of OnionShare:
it: I pacchetti sono firmati dallo sviluppatore principale che è responsabile di quella particolare release. Ecco le informazioni sulla chiave GPG per ciascuno degli sviluppatori principali di OnionShare:
vi: Các gói được ký bởi nhà phát triển cốt lõi chịu trách nhiệm cho bản phát hành cụ thể. Sau đây là thông tin khóa GPG cho từng nhà phát triển cốt lõi của OnionShare:
zh_cn: 软件包由负责特定版本的核心开发人员签名。以下是每个 OnionShare 核心开发人员的 GPG 密钥信息：

source: Micah Lee:
vi: Ông Micah Lee:

source: PGP public key fingerprint ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
it: Fingerprint PGP della chiave pubblica ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
sq: Shenja gishtash kyçi publik PGP ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
vi: Khóa công khai PGP ``927F419D7EC82C2F149C1BD1403C2657CD994F73``.
zh_cn: PGP 公钥指纹 ``927F419D7EC82C2F149C1BD1403C2657CD994F73``。

source: You can download Micah's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
it: È possibile scaricare la chiave di Micah `dal keyserver di keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
sq: Kyçin e Mikas mund ta shkarkoni `që nga shërbyesi keys.openpgp.org i kyçeve <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
vi: Bạn có thể tải xuống khóa của Micah `từ máy chủ khóa keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_.
zh_cn: 您可以`从 keys.openpgp.org 密钥服务器 <https://keys.openpgp.org/vks/v1/by-fingerprint/927F419D7EC82C2F149C1BD1403C2657CD994F73>`_下载 Micah 的密钥。

source: Saptak Sengupta:
vi: Ông Saptak Sengupta:

source: PGP public key fingerprint ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
it: Fingerprint PGP della chiave pubblica ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
sq: Shenja gishtash kyçi publik PGP ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
vi: Khóa công khai PGP ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``.
zh_cn: PGP 公钥指纹 ``2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B``。

source: You can download Saptak's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
it: È possibile scaricare la chiave di Saptak `dal keyserver di keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
sq: Kyçin e Saptakut mund ta shkarkoni `që nga shërbyesi keys.openpgp.org i kyçeve <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
vi: Bạn có thể tải xuống khóa Saptak `từ máy chủ khóa keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_.
zh_cn: 您可以`从 keys.openpgp.org 密钥服务器 <https://keys.openpgp.org/vks/v1/by-fingerprint/2AE3D40A6905C8E4E8ED95ECE46A2B977C14666B>`_下载 Saptak 的密钥。

source: Miguel Jacq:
vi: Ông iguel Jacq:

source: PGP public key fingerprint ``00AE817C24A10C2540461A9C1D7CDE0234DB458D``.
it: Fingerprint PGP della chiave pubblica ``00AE817C24A10C2540461A9C1D7CDE0234DB458D``.
vi: Khóa công khai PGP ``00AE817C24A10C2540461A9C1D7CDE0234DB458D``.
zh_cn: PGP 公钥指纹 ``00AE817C24A10C2540461A9C1D7CDE0234DB458D``。

source: You can download Miguel's key `from the keys.openpgp.org keyserver <https://keys.openpgp.org/vks/v1/by-fingerprint/00AE817C24A10C2540461A9C1D7CDE0234DB458D>`_.
it: È possibile scaricare la chiave di Miguel `dal keyserver di keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/00AE817C24A10C2540461A9C1D7CDE0234DB458D>`_.
vi: Bạn có thể tải xuống khóa của Miguel `từ máy chủ khóa keys.openpgp.org <https://keys.openpgp.org/vks/v1/by-fingerprint/00AE817C24A10C2540461A9C1D7CDE0234DB458D>`_.
zh_cn: 您可以`从 keys.openpgp.org 密钥服务器 <https://keys.openpgp.org/vks/v1/by-fingerprint/00AE817C24A10C2540461A9C1D7CDE0234DB458D>`_ 下载 Miguel 的密钥。

source: You must have GnuPG installed to verify signatures. For macOS you probably want `GPGTools <https://gpgtools.org/>`_, and for Windows you probably want `Gpg4win <https://www.gpg4win.org/>`_.
it: Per verificare le firme, è necessario che tu abbia installato GnuPG. Per macOS è probabilmente necessario `GPGTools <https://gpgtools.org/>`_, e per Windows è probabilmente necessario `Gpg4win <https://www.gpg4win.org/>`_.
sq: Që të verifikoni nënshkrime, duhet të keni të instaluar GnuPG-në. Për macOS gjasat janë t’ju duhet `GPGTools <https://gpgtools.org/>`_, ndërsa për Windows me gjasa ju duhet `Gpg4win <https://www.gpg4win.org/>`_.
vi: Bạn phải cài đặt GnuPG sẵn để xác minh chữ ký. Đối với hệ điều hành macOS, bạn có thể muốn `GPGTools <https://gpgtools.org/>`_, và đối với hệ điều hành Windows, bạn có thể muốn `Gpg4win <https://www.gpg4win.org/>`_.
zh_cn: 你必须安装 GnuPG 来验证签名，对于 macOS 你可能想要 `GPGTools <https://gpgtools.org/>`_，对于 Windows 你可能想要 `Gpg4win <https://www.gpg4win.org/>`_。

source: Signatures
it: Firme
sq: Nënshkrime
vi: Các chữ ký
zh_cn: 签名

source: You can find the signatures (as ``.asc`` files), as well as Windows, macOS, Flatpak, Snap, and source packages, at https://onionshare.org/dist/ in the folders named for each version of OnionShare. You can also find them on the `GitHub Releases page <https://github.com/onionshare/onionshare/releases>`_.
it: È possibile trovare le firme (come file ``.asc``), così come i pacchetti Windows, macOS, Flatpak, Snap e i sorgenti, all'indirizzo https://onionshare.org/dist/ nelle cartelle denominate per ogni versione di OnionShare. È possibile trovarle anche sulla pagina `GitHub Releases <https://github.com/onionshare/onionshare/releases>`_.
sq: Nënshkrimet (asi kartela ``.asc``), si dhe paketa për Windows, macOS, Flatpak, Snap dhe paketa burim mund të gjeni te https://onionshare.org/dist/ , në dosjet e emërtuara për çdo version të OnionShare-it. Mund t’i gjeni edhe në `faqen GitHub të Hedhjeve Në Qarkullim <https://github.com/onionshare/onionshare/releases>`_.
vi: Bạn có thể tìm thấy các chữ ký (dưới dạng tệp ``.asc``), cũng như các gói Windows, macOS, Flatpak, Snap và nguồn, tại https://onionshare.org/dist/ trong các thư mục được đặt tên cho từng phiên bản OnionShare. Bạn cũng có thể tìm thấy chúng trên `Trang phát hành GitHub <https://github.com/onionshare/onionshare/releases>`_.
zh_cn: 您可以在 https://onionshare.org/dist/ 上每个 OnionShare 版本文件夹中找到签名（作为 ``.asc`` 文件），以及 Windows、macOS、Flatpak、Snap 和源代码包。您还可以在 `GitHub 发布页面 <https://github.com/onionshare/onionshare/releases>`_ 上找到它们。

source: Verifying
it: Verifica in corso
sq: Po verifikohet
vi: Việc xác minh
zh_cn: 验证

source: Once you have imported the core developers public keys into your GnuPG keychain, downloaded the binary and ``.asc`` signature, you can verify the binary in a terminal like this:
it: Una volta importate le chiavi pubbliche degli sviluppatori del nucleo nel proprio portachiavi GnuPG, scaricato il binario e la firma ``.asc``, è possibile verificare il binario in un terminale come questo:
sq: Pasi të keni importuar në vargun tuaj të kyçeve GnuPG kyçet publikë të zhvilluesve bazë, shkarkuar dyorin dhe nënshkrimin ``.asc``, mund të verifikoni dyorin në një terminal, në këtë mënyrë:
vi: Sau khi bạn đã nhập khóa công khai của nhà phát triển cốt lõi vào chuỗi khóa GnuPG của mình, tải xuống tệp nhị phân và chữ ký ``.asc``, bạn có thể xác minh tệp nhị phân trong thiết bị đầu cuối như sau:
zh_cn: 将核心开发人员的公钥导入 GnuPG 密钥串、下载二进制文件和 ``.asc`` 签名后，您可以在终端中验证二进制文件，如下所示：

source: For Windows::
it: Per Windows::
sq: Për Windows::
vi: Đối với Windows::
zh_cn: Windows::

source: For macOS::
it: Per macOS::
sq: Për macOS::
vi: Đối với macOS::
zh_cn: macOS::

source: For Linux::
it: Per Linux::
sq: Për Linux::
vi: Đối với Linux::
zh_cn: Linux::

source: and for the source file::
it: e per il file sorgente::
sq: dhe për kartela burim::
vi: và đối với tập tin nguồn::
zh_cn: 源文件::

source: The expected output looks like this::
it: Il risultato atteso somiglia a questo::
sq: Ajo çka pritet duket pak a shumë kështu::
vi: Đầu ra output dự kiến trông như thế này::
zh_cn: 期望的输出看起来像是这样::

source: If you don't see ``Good signature from``, there might be a problem with the integrity of the file (malicious or otherwise), and you should not install the package.
it: Se non si vede ``Buona firma da``, potrebbe esserci un problema con l'integrità del file (maligno o altro) e non si dovrebbe installare il pacchetto.
sq: Nëse s’shihni ``Good signature from``, mund të ketë një problem me pacenueshmërinë e kartelës (dashakeqe ose jo) dhe s’duhet ta instaloni paketën.
vi: Nếu bạn không thấy ``Good signature from``, có thể đã xảy ra sự cố về tính toàn vẹn của tệp (có thể là độc hại hoặc không) và bạn không nên cài đặt gói.
zh_cn: 如果您没有看到 ``Good signature from``，则文件的完整性可能存在问题（恶意或其他），您不应该安装该软件包。

source: The ``WARNING:`` shown above, is not a problem with the package, it only means you haven't defined a level of "trust" of Micah's (the core developer) PGP key.
it: L'avviso ``WARNING:`` mostrato sopra non è un problema del pacchetto, significa solo che non è stato definito un livello di “fiducia” della chiave PGP di Micah (lo sviluppatore principale).
sq: ``WARNING:`` i shfaqur më sipër s’është problem me paketën, thjesht do të thotë se s’keni përcaktuar një shkallë “besimi”” për kyçin PGP të Mikas (zhvilluesi kryesor).
vi: ``CẢNH BÁO:`` hiển thị ở trên không phải là vấn đề của gói, nó chỉ có nghĩa là bạn chưa xác định mức độ "tin cậy" của khóa PGP của Micah (nhà phát triển cốt lõi).
zh_cn: 上面显示的``警告：``不是软件包的问题，它只意味着您没有定义 Micah（核心开发人员）的 PGP 密钥的“信任”级别。

source: If you want to learn more about verifying PGP signatures, the guides for `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ and the `Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ may be useful.
it: Se vuoi saperne di più sulla verifica delle firme PGP, le guide per `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ e del `Progetto Tor <https://support.torproject.org/it/tbb/how-to-verify-signature/>`_ possono essere utili.
sq: Nëse doni të mësoni më tepër rreth verifikimit të nënshkrimeve PGP, mund të jenë të dobishëm udhërrëfyesit për `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ dhe `Projektin Tor <https://support.torproject.org/tbb/how-to-verify-signature/>`_ .
vi: Nếu bạn muốn tìm hiểu thêm về việc xác minh chữ ký PGP, các hướng dẫn dành cho `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ và `Dự án Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ có thể hữu ích.
zh_cn: 如果你想了解更多有关验证 PGP 签名的知识，这几篇指南 `Qubes OS <https://www.qubes-os.org/security/verifying-signatures/>`_ 和 `Tor Project <https://support.torproject.org/tbb/how-to-verify-signature/>`_ 可能会有帮助。
