Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/install.po
Languages: it, sq, vi, zh_cn

source: Installation
it: Installazione
sq: Instalim
vi: Cài đặt
zh_cn: 安装

source: Windows or macOS
it: Windows o macOS
sq: Windows ose macOS
vi: Windows hoặc macOS
zh_cn: Windows 或 macOS

source: You can download OnionShare for Windows and macOS from the `OnionShare website <https://onionshare.org/>`_.
it: Puoi scaricare OnionShare per Windows e macOS dal `sito web di OnionShare <https://onionshare.org/>`_.
sq: OnionShare për Windows dhe macOS mund t’i shkarkoni që nga `sajti OnionShare <https://onionshare.org/>`_.
vi: Bạn có thể tải xuống OnionShare cho Windows và macOS từ `trang web OnionShare <https://onionshare.org/>`_.
zh_cn: 你可以从 `OnionShare website <https://onionshare.org/>`_ 下载适用于 Windows 和 macOS 的 OnionShare。

source: Mobile
sq: Celular
vi: Điện thoại
zh_cn: 手机

source: You can download OnionShare for Mobile from the follow links
sq: OnionShare për Celular mund të shkarkoni nga lidhjet vijuese
vi: Bạn có thể tải OnionShare cho thiết bị di động từ các liên kết sau
zh_cn: 您可以从下方链接下载 OnionShare 移动版

source: Google Play: https://play.google.com/store/apps/details?id=org.onionshare.android
vi: Cửa hàng Google Play: https://play.google.com/store/apps/details?id=org.onionshare.android
zh_cn: Google Play: https://play.google.com/store/apps/details?id=org.onionshare.android&hl=zh

source: F-Droid: https://github.com/onionshare/onionshare-android-nightly
vi: Phần mềm F-Droid: https://github.com/onionshare/onionshare-android-nightly

source: Apple App Store: https://apps.apple.com/app/onionshare/id1601890129
vi: Cửa hàng ứng dụng Apple: https://apps.apple.com/app/onionshare/id1601890129
zh_cn: Apple 应用商店：https://apps.apple.com/app/onionshare/id1601890129

source: Direct IPA download: https://github.com/onionshare/onionshare-ios/releases
sq: Shkarkim i drejtpërdrejtë IPA: https://github.com/onionshare/onionshare-ios/releases
vi: Tải xuống IPA trực tiếp: https://github.com/onionshare/onionshare-ios/releases
zh_cn: 直接 IPA 下载：https://github.com/onionshare/onionshare-ios/releases

source: Testflight: https://testflight.apple.com/join/ZCJeY65W
vi: Công cụ Testflight: https://testflight.apple.com/join/ZCJeY65W

source: There are various ways to install OnionShare for Linux, but the recommended way is to use either the `Flatpak <https://flatpak.org/>`_ or the `Snap <https://snapcraft.io/>`_ package. Flatpak and Snapcraft ensure that you'll always use the newest version and run OnionShare inside of a sandbox.
it: Ci sono diversi modi per installare OnionShare su Linux, ma la maniera consigliata è usare o il pacchetto `Flatpak <https://flatpak.org/>`_ o `Snap <https://snapcraft.io/>`_ . Flatpak e Snapcraft garantiscono l'utilizzo della versione più aggiornata e l'avvio di OnionShare all'interno di una sandbox.
sq: Ka rrugë të ndryshme për të instaluar OnionShare për Linux, por rruga e rekomanduar është ose për përdoret paketa `Flatpak <https://flatpak.org/>`_, ose `Snap <https://snapcraft.io/>`_. Flatpak-u dhe Snapcraft-i garantojnë se keni përherë versionin më të ri dhe e xhironi OnionShare-in brenda një bankëprove.
vi: Có nhiều cách khác nhau để cài đặt OnionShare cho Linux, nhưng cách được khuyến nghị là sử dụng gói `Flatpak <https://flatpak.org/>`_ hoặc `Snap <https://snapcraft.io/>`_. Flatpak và Snapcraft đảm bảo rằng bạn sẽ luôn sử dụng phiên bản mới nhất và chạy OnionShare bên trong hộp cát.
zh_cn: 这有几种方式安装适用于 Linux 的 OnionShare，但推荐使用 `Flatpak <https://flatpak.org/>` _或 `Snap <https://snapcraft.io/>`_ 的软件包来安装。Flatpak 和 Snap 确保你将总能使用最新版本的 OnionShare 并在一个沙箱里运行它。

source: Snapcraft support is built-in to Ubuntu and Fedora comes with Flatpak support, but which you use is up to you. Both work in all Linux distributions.
it: Il supporto Snapcraft è integrato in Ubuntu e il supporto Flatpak è integrato in Fedora, ma quale scegliere dipende da te. Entrambi funzionano in tutte le distro Linux.
sq: Snapcraft-i mbulohet së brendshmi në Ubuntu dhe Fedora vjen me mbulim të Flatpak-ut, por cili të përdoret e keni ju në dorë. Që të dy funksionojë në krejt shpërndarjet Linux.
vi: Hỗ trợ Snapcraft được tích hợp sẵn trong Ubuntu và Fedora đi kèm với hỗ trợ Flatpak, nhưng bạn sử dụng cái nào là tùy bạn. Cả hai đều hoạt động trong tất cả các bản phân phối Linux.
zh_cn: Ubuntu 内置 Snapcraft 支持，而 Fedora 则支持 Flatpak，但使用哪一种取决于您。两者都适用于所有 Linux 发行版。

source: **Install OnionShare using Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
it: **Installa OnionShare usando Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
sq: **Instaloni OnionShare-in duke përdorur Flatpak-un**: https://flathub.org/apps/details/org.onionshare.OnionShare
vi: **Cài đặt OnionShare sử dụng Flatpak**: https://flathub.org/apps/details/org.onionshare.OnionShare
zh_cn: **使用 Flatpak 安装 OnionShare**: https://flathub.org/apps/details/org.onionshare.OnionShare

source: **Install OnionShare using Snapcraft**: https://snapcraft.io/onionshare
it: **Installa OnionShare usando Snapcraft**: https://snapcraft.io/onionshare
sq: **Instaloni OnionShare-in duke përdorur Snapcraft-in**: https://snapcraft.io/onionshare
vi: **Cài đặt OnionShare sử dụng Snapcraft**: https://snapcraft.io/onionshare
zh_cn: **使用 Snapcraft 安装 OnionShare**：https://snapcraft.io/onionshare

source: You can also download and install PGP-signed ``.flatpak`` or ``.snap`` packages from https://onionshare.org/dist/ if you prefer.
it: Se preferisci puoi anche scaricare e installare pacchetti ``.flatpak`` o ``.snap`` con firma PGP da https://onionshare.org/dist/.
sq: Mundeni edhe të shkarkoni dhe instaloni paketa ``.flatpak`` apo ``.snap`` të nënshkruara me PGP që nga https://onionshare.org/dist/, nëse doni.
vi: Bạn cũng có thể tải xuống và cài đặt các gói ``.flatpak`` hoặc ``.snap`` có chữ ký PGP từ https://onionshare.org/dist/ nếu bạn muốn.
zh_cn: 如果你愿意的话，你也可以从 https://onionshare.org/dist/ 下载和安装 PGP 签署过的 ``.flatpak`` 或 ``.snap`` 软件包。

source: Manual Flatpak Installation
it: Installazione manuale con Flatpak
sq: Instalim Flatpak dorazi
vi: Cài đặt Flatpak theo cách thủ công
zh_cn: 手动 Flatpak 安装

source: If you'd like to install OnionShare manually with Flatpak using the PGP-signed `single-file bundle <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, you can do so like this:
it: Se si desidera installare OnionShare manualmente con Flatpak utilizzando il bundle `single-file firmato PGP <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, è possibile farlo in questo modo:
sq: Nëse doni ta instaloni dorazi OnionShare-in me Flatpak duke përdorur `paketë njëkartelëshe <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_ të nënshkruar me PGP, këtë mund ta bëni kështu:
vi: Nếu bạn muốn cài đặt OnionShare theo cách thủ công với Flatpak bằng cách sử dụng `gói tập tin đơn có chữ ký PGP <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_, bạn có thể thực hiện như sau:
zh_cn: 如果您想要通过 Flatpak 使用 PGP 签名的 `单文件软件包 <https://docs.flatpak.org/en/latest/single-file-bundles.html>`_ 手动安装 OnionShare，您可以这样做：

source: Install Flatpak by following the instructions at https://flatpak.org/setup/.
it: Installate Flatpak seguendo le istruzioni di https://flatpak.org/setup/.
sq: Instaloni Flatpak-un duke ndjekur udhëzimet te https://flatpak.org/setup/.
vi: Cài đặt Flatpak bằng cách làm theo hướng dẫn tại https://flatpak.org/setup/.
zh_cn: 按照 https://flatpak.org/setup/ 上的说明安装 Flatpak。

source: Add the Flathub repository by running ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Even though you won't be downloading OnionShare from Flathub, OnionShare depends on some packages that are only available there.
it: Aggiungere il repository Flathub eseguendo ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Anche se non si scarica OnionShare da Flathub, OnionShare dipende da alcuni pacchetti che sono disponibili solo lì.
sq: Shtoni depon Flathub, duke ekzekutuar ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Edhe pse s’do ta shkarkoni OnionShare-in prej Flathub-i, OnionShare nga disa paketa që mund të kihen vetëm prej andej.
vi: Thêm kho lưu trữ Flathub bằng cách chạy ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo``. Mặc dù bạn sẽ không tải xuống OnionShare từ Flathub, nhưng OnionShare phụ thuộc vào một số gói package chỉ khả dụng ở đó mà thôi.
zh_cn: 通过运行 ``flatpak remote-add --if-not-exists flathub https://flathub.org/repo/flathub.flatpakrepo`` 添加 Flathub 存储库。即使您不会从 Flathub 下载 OnionShare，但 OnionShare 也依赖于某些仅在那里可用的软件包。

source: Go to https://onionshare.org/dist/, choose the latest version of OnionShare, and download the ``.flatpak`` and ``.flatpak.asc`` files.
it: Andate su https://onionshare.org/dist/, scegliete l'ultima versione di OnionShare e scaricate i file ``.flatpak`` e ``.flatpak.asc``.
sq: Shkoni te https://onionshare.org/dist/, zgjidhni versionin më të ri të OnionShare-it dhe shkarkoni kartelat ``.flatpak`` dhe ``.flatpak.asc``.
vi: Đi tới https://onionshare.org/dist/, lựa chọn phiên bản OnionShare mới nhất, và tải xuống các file tệp tin ``.flatpak`` và ``.flatpak.asc``.
zh_cn: 前往 https://onionshare.org/dist/，选择最新版本的 OnionShare，并下载 ``.flatpak`` 和 ``.flatpak.asc`` 文件。

source: Verify the PGP signature of the ``.flatpak`` file. See :ref:`verifying_sigs` for more info.
it: Verifica la firma PGP del file ``.flatpak``. Vedere :ref:`verifying_sigs` per maggiori informazioni.
sq: Verifikoni nënshkrimin PGP të kartelës ``.flatpak``. Për më tepër hollësi, shihni :ref:`verifying_sigs`.
vi: Xác minh chữ ký PGP của file tệp tin ``.flatpak``. Hãy xem :ref:`verifying_sigs` để biết thêm thông tin.
zh_cn: 验证 ``.flatpak`` 文件的 PGP 签名。有关更多信息，请参阅：ref:`verifying_sigs`。

source: Install the ``.flatpak`` file by running ``flatpak install OnionShare-VERSION.flatpak``. Replace ``VERSION`` with the version number of the file you downloaded.
it: Installare il file ``.flatpak`` eseguendo ``flatpak install OnionShare-VERSION.flatpak``. Sostituire ``VERSION`` con il numero di versione del file scaricato.
sq: Instaloni kartelën ``.flatpak`` duke kryer ``flatpak install OnionShare-VERSION.flatpak``. Zëvendësoni ``VERSION`` me numrin e versionit të kartelës që shkarkuat.
vi: Cài đặt file tệp tin ``.flatpak`` bằng cách chạy ``flatpak install OnionShare-VERSION.flatpak``. Thay thế ``VERSION`` bằng số phiên bản của file tệp tin bạn đã tải xuống.
zh_cn: 通过运行 ``flatpak install OnionShare-VERSION.flatpak`` 来安装 ``.flatpak`` 文件。将 ``VERSION`` 替换为您下载的文件的版本号。

source: You can run OnionShare with: `flatpak run org.onionshare.OnionShare`.
it: È possibile eseguire OnionShare con: `flatpak run org.onionshare.OnionShare`.
sq: OnionShare-in mund ta vini në funksionim përmes: `flatpak run org.onionshare.OnionShare`.
vi: Bạn có thể chạy OnionShare với: `flatpak run org.onionshare.OnionShare`.
zh_cn: 您可以使用以下命令运行 OnionShare：`flatpak run org.onionshare.OnionShare`。

source: Manual Snapcraft Installation
it: Installazione manuale di Snapcraft
sq: Instalim Snapcraft dorazi
vi: Cài đặt Snapcraft theo cách thủ công
zh_cn: 手动 Snapcraft 安装

source: If you'd like to install OnionShare manually with Snapcraft using the PGP-signed Snapcraft package, you can do so like this:
it: Se si desidera installare OnionShare manualmente con Snapcraft utilizzando il pacchetto Snapcraft con firma PGP, è possibile farlo in questo modo:
sq: Nëse doni ta instaloni OnionShare-in dorazi me Snapcraft duke përdorur paketën Snapcraft të nënshkruar me PGP, këtë mund ta bëni kështu:
vi: nếu như bạn muốn cài đặt OnionShare theo cách thủ công với Snapcraft bằng cách sử dụng gói package Snapcraft có chữ ký PGP, bạn có thể làm như thế này:
zh_cn: 如果您想使用 PGP 签名的 Snapcraft 包手动安装 OnionShare，您可以这样做：

source: Install Snapcraft by following the instructions at https://snapcraft.io/docs/installing-snapd.
it: Installare Snapcraft seguendo le istruzioni riportate in https://snapcraft.io/docs/installing-snapd.
sq: Instaloni Snapcraft-in duke ndjekur udhëzimet te https://snapcraft.io/docs/installing-snapd.
vi: Cài đặt Snapcraft bằng cách làm theo các chỉ dẫn tại https://snapcraft.io/docs/installing-snapd.
zh_cn: 按照 https://snapcraft.io/docs/installing-snapd 上的说明安装 Snapcraft。

source: Go to https://onionshare.org/dist/, choose the latest version of OnionShare, and download the ``.snap`` and ``.snap.asc`` files.
it: Andate su https://onionshare.org/dist/, scegliete l'ultima versione di OnionShare e scaricate i file ``.snap`` e ``.snap.asc``.
sq: Shkoni te https://onionshare.org/dist/, zgjidhni versionin më të ri të OnionShare-it dhe shkarkoni kartelat ``.snap`` dhe ``.snap.asc``.
vi: Đi tới https://onionshare.org/dist/, lựa chọn phiên bản mới nhất của OnionShare, và tải xuống các file tệp tin ``.snap`` và ``.snap.asc``.
zh_cn: 前往 https://onionshare.org/dist/，选择最新版本的 OnionShare，并下载 ``.snap`` 和 ``.snap.asc`` 文件。

source: Verify the PGP signature of the ``.snap`` file. See :ref:`verifying_sigs` for more info.
it: Verifica la firma PGP del file ``.snap``. Vedere :ref:`verifying_sigs` per maggiori informazioni.
sq: Verifikoni nënshkrimin PGP të kartelës ``.snap``. Për më tepër hollësi, shihni :ref:`verifying_sigs`.
vi: Xác minh chữ ký PGP của file tệp tin ``.snap``. hãy xem :ref:`verifying_sigs` để biết thêm thông tin.
zh_cn: 验证 ``.snap`` 文件的 PGP 签名。有关更多信息，请参阅：ref:`verifying_sigs`。

source: Install the ``.snap`` file by running ``snap install --dangerous onionshare_VERSION_amd64.snap``. Replace ``VERSION`` with the version number of the file you downloaded. Note that you must use `--dangerous` because the package is not signed by the Snapcraft store, however you did verify its PGP signature, so you know it's legitimate.
it: Installare il file ``.snap`` eseguendo ``snap install --dangerous onionshare_VERSION_amd64.snap``. Sostituire ``VERSION`` con il numero di versione del file scaricato. Si noti che è necessario usare `--pericoloso` perché il pacchetto non è firmato dal negozio Snapcraft, tuttavia è stata verificata la firma PGP, quindi si sa che è legittimo.
sq: Instaloni kartelën ``.snap`` duke ekzekutuar ``snap install --dangerous onionshare_VERSION_amd64.snap``. Zëvendësoni ``VERSION`` me numrin e versionit të kartelës që shkarkuat. Kini parasysh se duhet të përdorni `--dangerous`, ngaqë paketa s’është nënshkruar nga shitorja Snapcraft, po ju verifikuar nënshkrimin e saj PGP, pra e dini se është e ligjshme.
vi: Cài đặt file tệp tin ``.snap`` bằng cách chạy ``snap install --dangerous onionshare_VERSION_amd64.snap``. Thay thế ``VERSION`` bằng số phiên bản của file tệp tin mà bạn đã tải xuống. Lưu ý rằng bạn phải sử dụng `--dangerous` bởi vì gói package không được ký bởi cửa hàng Snapcraft store, tuy nhiên, bạn đã xác minh chữ ký PGP của nó, vì vậy bạn biết nó là chính chủ hợp pháp.
zh_cn: 通过运行 ``snap install --dangerous onionshare_VERSION_amd64.snap`` 来安装 ``.snap`` 文件。将 ``VERSION`` 替换为您下载的文件的版本号。请注意，您必须使用 `--dangerous`，因为该软件包未由 Snapcraft 商店签名，但您确实验证了其 PGP 签名，因此您知道它是合法的。

source: You can run OnionShare with: `snap run onionshare`.
it: È possibile eseguire OnionShare con: `snap run onionshare`.
sq: OnionShare-in mund ta vini në punë me: `snap run onionshare`.
vi: Bạn có thể chạy OnionShare với: `snap run onionshare`.
zh_cn: 您可以使用以下命令运行 OnionShare：`snap run onionshare`。

source: Command-line only
it: Solo linea di comando
sq: Vetëm për rresht urdhrash
vi: Chỉ dòng lệnh command mà thôi
zh_cn: 仅限命令行

source: You can install just the command-line version of OnionShare on any operating system using the Python package manager ``pip``. :ref:`cli` has more info.
it: Puoi anche installare soltanto la versione da linea di comando di OnionShare su qualsiasi sistema operativo utilizzando il gestore dei pacchetti di Python ``pip``. :ref:`cli`ha più informazioni.
sq: Mundeni të instaloni thjesht versionin “rresht urdhrash” të OnionShare-it në çfarëdo sistemi operativ, duke përdorur përgjegjësin e paketave Python, ``pip``. :ref:`cli` ka më tepër informacion.
vi: Bạn có thể chỉ cài đặt phiên bản dòng lệnh command của OnionShare trên bất kỳ hệ điều hành nào bằng cách sử dụng trình quản lý gói Python ``pip``. :ref:`cli` có thêm thông tin.
zh_cn: 您可以使用 Python 软件包管理器 ``pip`` 在任何操作系统上安装 OnionShare 的命令行版本。:ref:`cli` 有更多信息。

source: FreeBSD
vi: Hệ điều hành FreeBSD

source: Althought not being officially developed for this platform, OnionShare can also be installed on `FreeBSD <https://freebsd.org/>`_. It's available via its ports collection or as pre-built package. Should you opt to install and use OnionShare on a FreeBSD operating system, please be aware that it's **NOT** officially supported by the OnionShare project.
it: Sebbene non sia stato sviluppato ufficialmente per questa piattaforma, OnionShare può essere installato anche su `FreeBSD <https://freebsd.org/>`_. È disponibile tramite la raccolta di porte o come pacchetto precostruito. Se si sceglie di installare e utilizzare OnionShare su un sistema operativo FreeBSD, si tenga presente che non è **NON** ufficialmente supportato dal progetto OnionShare.
sq: Edhe pse nuk zhvillohet zyrtarisht për këtë platformë, OnionShare mund të instalohet në `FreeBSD <https://freebsd.org/>`_. Mund të kihet përmes koleksionit të bartjeve, ose si paketë e montuar paraprakisht. Nëse vendosni ta instaloni dhe përdorni OnionShare-in në një sistem operativ FreeBSD, ju lutemi, mbani parasysh se **NUK** mbulohet zyrtarisht nga projekti OnionShare.
vi: Mặc dù không được phát triển chính thức cho nền tảng này, OnionShare cũng có thể được cài đặt trên `FreeBSD <https://freebsd.org/>`_. Nó có sẵn thông qua bộ sưu tập cổng của nó hoặc dưới dạng gói dựng sẵn. Nếu bạn chọn cài đặt và sử dụng OnionShare trên hệ điều hành FreeBSD, vui lòng lưu ý rằng nó **KHÔNG** được hỗ trợ chính thức bởi dự án OnionShare.
zh_cn: 尽管 OnionShare 并非专为此平台开发，但它也可以安装在 `FreeBSD <https://freebsd.org/>`_ 上。它可通过其 Ports Collection 或预构建包获得。如果您选择在 FreeBSD 操作系统上安装和使用 OnionShare，请注意，它 **不** 受 OnionShare 项目的官方支持。

source: Though not being offered and officially maintained by the OnionShare developers, the FreeBSD packages and ports do fetch and verifies the source codes from the official OnionShare repository (or its official release packages from `PyPI <https://pypi.org/project/onionshare-cli/>`_). Should you wish to check changes related to this platform, please refer to the following resources:
it: Sebbene non siano offerti e mantenuti ufficialmente dagli sviluppatori di OnionShare, i pacchetti e i port di FreeBSD recuperano e verificano i codici sorgente dal repository ufficiale di OnionShare (o i suoi pacchetti di rilascio ufficiali da `PyPI <https://pypi.org/project/onionshare-cli/>`_). Se si desidera verificare le modifiche relative a questa piattaforma, si faccia riferimento alle seguenti risorse:
sq: Edhe pse nuk ofrohet dhe mirëmbahet zyrtarisht nga zhvilluesit e OnionShare-it, paketa dhe bartjet FreeBSD sjellin dhe verifikojnë kodet burim prej depos zyrtare OnionShare (ose paketat zyrtare të hedhjeve në qarkullim nga `PyPI <https://pypi.org/project/onionshare-cli/>`_). Nëse doni të kontrolloni ndryshime të lidhura me këtë platformë, ju lutemi, shihni burimet vijuese:
vi: Mặc dù không được cung cấp và bảo trì chính thức bởi các nhà phát triển OnionShare, các gói và cổng FreeBSD sẽ lấy và xác minh mã nguồn từ kho lưu trữ OnionShare chính thức (hoặc các gói phát hành chính thức từ `PyPI <https://pypi.org/project/onionshare-cli/>`_). Nếu bạn muốn kiểm tra các thay đổi liên quan đến nền tảng này, vui lòng tham khảo các tài nguyên sau:
zh_cn: 尽管不是由 OnionShare 开发人员提供和正式维护，但 FreeBSD 软件包和 ports 确实会从官方 OnionShare 存储库（或其来自 `PyPI <https://pypi.org/project/onionshare-cli/>`_ 的官方发布软件包）获取和验证源代码。如果您希望查看与此平台相关的更改，请参考以下资源：

source: Manual pkg Installation
it: Installazione manuale del pkg
sq: Instalim pkg dorazi
vi: Cài đặt Flatpak theo cách thủ công
zh_cn: 手动 pkg 安装

source: To install the binary package, use ``pkg install pyXY-onionshare``, with ``pyXY`` specifying the version of Python the package was built for. So, in order to install OnionShare for Python 3.9, use::
it: Per installare il pacchetto binario, usare ``pkg install pyXY-onionshare``, con ``pyXY`` che specifica la versione di Python per cui il pacchetto è stato creato. Quindi, per installare OnionShare per Python 3.9, usare::
sq: Që të instaloni paketën dyore, përdorni ``pkg install pyXY-onionshare``, ku ``pyXY`` specifikon versionin Python për të cilin qe montuar paketa. Pra, për të instaluar OnionShare për Python 3.9, përdorni::
vi: Để cài đặt gói nhị phân, hãy sử dụng ``pkg install pyXY-onionshare``, với ``pyXY`` chỉ định phiên bản Python mà gói được xây dựng cho. Vì vậy, để cài đặt OnionShare cho Python 3.9, hãy sử dụng::
zh_cn: 要安装二进制包，请使用 ``pkg install pyXY-onionshare``，其中 ``pyXY`` 指定包所针对的 Python 版本。因此，为了安装适用于 Python 3.9 的 OnionShare，请使用::

source: There's also a **Command-line only** version of OnionShare available as pre-built package. Replace ``py39-onionshare`` by ``py39-onionshare-cli`` if you want to install that version.
it: Esiste anche una versione **a riga di comando** di OnionShare disponibile come pacchetto precostituito. Sostituire ``py39-onionshare`` con ``py39-onionshare-cli`` se si vuole installare questa versione.
sq: Ka gjithashtu një version **Vetëm për rresht urdhrash** të OnionShare-it, si paketë e paramontuar. Nëse doni të instaloni atë version, zëvendësoni ``py39-onionshare`` me ``py39-onionshare-cli``.
vi: Ngoài ra còn có phiên bản **Chỉ dòng lệnh** của OnionShare có sẵn dưới dạng gói dựng sẵn. Thay thế ``py39-onionshare`` bằng ``py39-onionshare-cli`` nếu bạn muốn cài đặt phiên bản đó.
zh_cn: 还有一个**仅命令行**版本的 OnionShare 作为预构建包提供。如果要安装该版本，请将 ``py39-onionshare`` 替换为 ``py39-onionshare-cli`` 。

source: For additional information and details about the FreeBSD pre-built packages, please refer to its `official Handbook section about pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.
it: Per ulteriori informazioni e dettagli sui pacchetti precostituiti di FreeBSD, consultare la sezione `ufficiale del manuale su pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.
sq: Për informacion shtesë dhe hollësi rreth paketave të paramontuara FreeBSD, ju lutemi, shihni `te ndarja për pkg te Doracaku zyrtar <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.
vi: Để biết thêm thông tin và chi tiết về các gói dựng sẵn của FreeBSD, vui lòng tham khảo `phần Sổ tay chính thức về pkg <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_.
zh_cn: 有关 FreeBSD 预构建软件包的更多信息和详细信息，请参阅其`有关 pkg 的官方手册部分 <https://docs.freebsd.org/en/books/handbook/ports/#pkgng-intro>`_。

source: Manual port Installation
it: Installazione manuale della porta
sq: Instalim bartjeje dorazi
vi: Cài đặt cổng thủ công
zh_cn: 手动 port 安装

source: To install the FreeBSD port, change directory to the `ports collection <https://freebsd.org/ports/>`_ you must have checked out before and run the following::
it: Per installare la porta FreeBSD, cambiate directory nella `raccolta di porte <https://freebsd.org/ports/>`_ che avrete già controllato ed eseguite il seguente comando::
sq: Për të instaluar një bartje FreeBSD, ndryshoni drejtorinë në `ports collection <https://freebsd.org/ports/>`_ që duhet ta keni shkarkuar më parë dhe ekzekutoni sa vijon::
vi: Để cài đặt cổng FreeBSD, hãy thay đổi thư mục thành `ports collection <https://freebsd.org/ports/>`_ mà bạn phải đã kiểm tra trước đó và chạy lệnh sau::
zh_cn: 要安装 FreeBSD port，请将目录更改为 `ports collection <https://freebsd.org/ports/>`_。您必须已经签出，并运行以下命令::
