Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/tor.po
Languages: sq, zh_cn

source: Reboot your computer. After it boots up again, open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file". Set the socket file to be ``/var/run/tor/control``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
sq: Rinisni kompjuterin tuaj. Pasi të niset, hapni OnionShare-in, klikoni mbi ikonën “⚙” në të dhe kaloni te skeda Rregullime Tor-i. Nën “Si duhet të lidhet me Tor-in OnionShare-i?” zgjidhni “Lidhu duke përdorur një kartelë “socket””. Si kartelë “socket” vini ``/var/run/tor/control``. Nën “Regullime mirëfilltësimi Tor” zgjidhni “Pa mirëfilltësim, ose me mirëfilltësim me “cookies””. Klikoni butonin “Provoni Lidhjen me Tor-in”.
zh_cn: 重启您的电脑。重启后，打开 OnionShare，点击其中的“⚙”图标，切换到 Tor 设置标签页。在“OnionShare 应如何连接到 Tor？”下，选择“使用 Socket 文件连接”。将 Socket 文件设置为 ``/var/run/tor/control``。在“Tor 验证设置”下，选择“无验证或 Cookie 验证”。点击“测试与 Tor 的连接”按钮。
