Repository: AmirulAndalib/onionshare
Catalog: docs/source/locale/*/LC_MESSAGES/tor.po
Languages: sq, zh_cn

source: Connecting to Tor
sq: Lidhje me Tor-in
zh_cn: 正在连接到 Tor

source: When OnionShare starts, it will show you a screen asking you to connect to the Tor network.
sq: Kur niset OnionShare-i, do t’ju shfaqë një skenë ku ju kërkon të bëni lidhjen me rrjetin Tor.
zh_cn: 当OnionShare启动时，它会显示一个屏幕，要求您连接到Tor网络。

source: You can toggle on the switch "Connect to Tor automatically" before clicking "Connect to Tor". This means that next time OnionShare starts, it will automatically connect with its Tor connection settings from the last session, instead of presenting you with the connection options. If the connection fails, you can still try bridges or reconfigure Tor via the "Network Settings" button.
sq: Mund të zgjidhni “Lidhu automatikisht me Tor-in”, para se të klikoni mbi “Lidhu me Tor-in”. Kjo do të thotë se herës tjetër që niset OnionShare-i, do të lidhet automatikisht, sipas rregullimeve të veta për lidhjen me Tor-in që nga sesioni i fundit, në vend se t’ju paraqesë prapë mundësi rreth lidhjes. Nëse lidhja dështon, mundeni prapë të provoni ura, ose të riformësoni Tor-in përmes butonit “Rregullime Rrjeti”.
zh_cn: 您可以在点击"Connect to Tor"之前，打开"Connect to Tor automatically"的开关。这意味着下次OnionShare启动时，它将自动使用上次会话的Tor连接设置进行连接，而不会呈现连接选项给您。如果连接失败，您仍然可以尝试使用桥接或通过"Network Settings"按钮重新配置Tor。

source: You can click "Connect to Tor" to begin the connection process. If there are no problems with your network, including any attempts to block your access to the Tor network, this should hopefully work the first time.
sq: Që të fillojë procesi i lidhjes, mund të klikoni mbi t “Lidhu me Tor-in”. Nëse s’ka probleme me rrjetin tuaj, përfshi çfarëdo përpjekjesh për t’ju bllokuar hyrjen në rrjetin Tor, kjo shpresohet të funksionojë që herën e parë.
zh_cn: 您可以点击"Connect to Tor"来开始连接。如果您的网络没有任何问题，包括任何试图阻止您访问Tor网络的尝试，这应该能够在第一次尝试时成功。

source: Or, if you want to manually configure Bridges or other Tor settings before you connect, you can click "Network Settings".
sq: Ose, nëse doni të formësoni dorazi Ura, apo rregullime të tjera Tor-i, para se të lidhet, mund të klikoni mbi “Rregullime Rrjeti”.
zh_cn: 或者，如果您希望在连接之前手动配置桥接或其他Tor设置，您可以点击"Network Settings"。

source: Automatic censorship circumvention
sq: Anashkalim i automatizuar i censurimit
zh_cn: 自动绕过网络审查

source: When you click "Connect to Tor", if OnionShare fails to connect, it might be because Tor is censored in your country or on your local network.
sq: Kur klikoni “Lidhu me Tor-in”, nëse OnionShare s’arrin të lidhet, mund të jetë ngaqë Tor-i censurohet në vendin tuaj, ose në rrjetin tuaj vendor.
zh_cn: 当您点击"Connect to Tor"时，如果OnionShare无法连接，可能是因为Tor在您所在的国家或本地网络中受到审查限制。

source: If this occurs, you will have these choices:
sq: Nëse ndodh kjo, do të keni këto mundësi:
zh_cn: 如果出现这种情况，您将有以下选择：

source: Try again without a bridge
sq: Riprovo pa urë
zh_cn: 不用网桥重试

source: Automatically determine my country from my IP address for bridge settings
sq: Për rregullimet e urës, përcakto automatikisht vendin tim nga adresa ime IP
zh_cn: 从 IP 地址自动确定我所在国家/地区的网桥设置

source: Manually select my country for bridge settings
sq: Të përzgjedh dorazi vendin tim për rregullime e urës
zh_cn: 手动选择我所在国家/地区的网桥设置

source: If you choose the "Try again without a bridge" option, OnionShare will retry connecting to Tor like normal, without attempting to bypass censorship.
sq: Nëse zgjidhni mundësinë “Riprovo pa urë”, OnionShare do të riprovojë të lidhet me Tor-in, si normalisht, pa u përpjekur të anashkalojë censurim.
zh_cn: 如果您选择“不使用网桥重试”选项，OnionShare 将像平常一样重试连接到 Tor，而不会尝试绕过审查。

source: The other two options will attempt to automatically bypass censorship using Tor bridges. If your network provider is blocking access to the Tor network, you can hopefully still connect to a Tor bridge, which will then connect you to the Tor network, circumventing the censorship. Both of these options use the Tor Project's Censorship Circumvention API to provide you with bridge settings that should work for you. OnionShare will temporarily use the `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ domain-fronting proxy to make a non-Tor connection from your computer to Tor's Censorship Circumvention API. The Meek proxy hides the fact that you are trying to find a way to connect to Tor.
sq: Me dy mundësitë e tjera do të provohet të anashkalohet automatikisht censurimi duke përdorur ura Tor. Nëse shërbimi juaj internet bllokon hyrjen në rrjetin Tor, ka shpresa se prapë mund të lidheni te një urë To, e cila mandej do t’ju lidhë me rrjetin Tor, duke anashkaluar kështu censurimin. Që të dyja këto mundësi përdorin API-in e Projektit Tor për Anashkalim Censurimi, për t’ju dhënë rregullime urash që duhet të funksionojnë për ju. OnionShare do të përdorë përkohësisht ndërmjetësin “domain-fronting” `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ për të bërë një lidhje jo Tor, nga kompjuteri juaj te API e Projektit Tor për Anashkalim Censurimi. Ndërmjetësi Meek fsheh faktin se po provoni të gjeni një mënyrë për t’u lidhur me Tor-in.
zh_cn: 另外两个选项将尝试使用 Tor 网桥自动规避审查。如果您的网络提供者阻止访问 Tor 网络，您仍有希望连接到 Tor 网桥，然后它将把您连接到 Tor 网络，从而规避审查。这两个选项都使用 Tor Project 的审查规避 API 为您提供适合您的网桥设置。OnionShare 将暂时使用 `Meek <https://gitlab.torproject.org/legacy/trac/-/wikis/doc/meek/>`_ 域前置代理从您的计算机到 Tor 的审查规避 API 建立非 Tor 连接。Meek 代理掩盖了您正在尝试找到连接到 Tor 的方法的事实。

source: If you choose "Automatically determine my country from my IP address for bridge settings", the Censorship Circumvention API will consider your IP address (yes, your real IP address) to determine what country you might reside in. Based on the country information, the API will try to automatically find bridges that suit your location.
sq: Nëse zgjidhni “Për rregullime urash, përcakto automatikisht vendin tim që nga adresa ime IP", APi për Anashkalim Censurimi do të marrë parasysh adresën tuaj API (po, adresën tuaj të njëmendtë IP) për të përcaktuar se në cilin vend mund të gjendeni. Bazuar në informacionin rreth vendit, API do të provojë të gjejë automatikisht ura që i përshtaten vendndodhjes tuaj.
zh_cn: 如果您选择“根据我的 IP 地址自动确定我的国家/地区以进行网桥设置”，则审查规避 API 将考虑您的 IP 地址（是的，您的真实 IP 地址）来确定您可能居住在哪个国家/地区。根据国家/地区信息，API 将尝试自动查找适合您所在位置的网桥。

source: If you choose "Manually select my country for bridge settings", the Censorship API will find the bridges that suit the country that you specified.
sq: Nëse zgjidhni “Të përzgjedh dorazi vendin tim për rregullime e urës”, API për Anashkalimin e Censurimit do të gjejë ura që i përshtaten vendit që treguat.
zh_cn: 如果您选择“手动选择我的国家/地区进行网桥设置”，审查 API 将找到适合您指定国家/地区的网桥。

source: How automatic censorship circumvention works
sq: Si funksionon dhe anashkalim i automatizuar i censurimit
zh_cn: 自动规避审查的工作原理

source: If the Censorship Circumvention API finds bridges that it believes will suit you, OnionShare will try to reconnect to Tor using those bridges. If the API does not find any bridges for your location, OnionShare will ask the API for "fallback" options, and then try to reconnect using those.
sq: Nëse API për Anashkalim Censurimi gjen ura që beson se do t’ju bëjnë punë, OnionShare do të provojë të rilidhet me Tor-in duke përdorur këto ura. Nëse API s’gjen ndonjë urë për vendndodhjen tuaj, OnionShare do t’i kërkojë API-t mundësi “rrugëdalje” dhe mandej do të provojë të rilidhet duke përdorur të tilla.
zh_cn: 如果“审查规避 API”找到它认为适合您的网桥，OnionShare 将尝试使用这些网桥重新连接到 Tor。如果 API 未找到您所在位置的任何网桥，OnionShare 将向 API 询问“后备”选项，然后尝试使用这些选项重新连接。

source: If for some reason OnionShare fails to connect to the Censorship API itself, or if the API returns an error message, OnionShare will attempt to use the obfs4 built-in bridges.
sq: Nëse për një arsye a një tjetër OnionShare s’arrin të lidhet me vetë API-n për Anashkalim Censurimi, ose API përgjigjet me një mesazh gabimi, OnionShare do të përpiqet të përdorë ura obfs4 të brendshme.
zh_cn: 如果由于某种原因 OnionShare 无法连接到审查 API 本身，或者 API 返回错误消息，OnionShare 将尝试使用 obfs4 内置网桥。

source: It's important to note that the requests to the Censorship Circumvention API do not go over the Tor network (because if you could connect to Tor already, you wouldn't need to connect to the API).
sq: Është e rëndësishme të vihet re se kërkesat ndaj API-t të Anashkalimit të Censurimit nuk bëhen përmes rrjetit Tor (ngaqë po të mundnit të lidheshit me Tor, s’do t’ju hynte në punë të lidheshit me API-n).
zh_cn: 值得注意的是，对审查规避 API 的请求不会通过 Tor 网络（因为如果您已经可以连接到 Tor，则不需要连接到 API）。

source: Even though it's hard for an adversary to discover where the Meek request is going, this may still be risky for some users. Therefore, it is an opt-in feature. The use of Meek and non-torified network requests are limited only to making one or two requests to the Censorship Circumvention API. Then Meek is stopped, and all further network requests happen over the Tor network.
sq: Edhe pse është e vështirë që një kundërshtar të zbulojë se ku shkon kërkesa Meek, kjo mund të jetë me rrezik për disa përdorues. Ndaj, është një veçori në dëshirë të përdoruesit. Përdorimi i Meek-ut dhe kërkesave ndaj rrjetit jo përmes Tor-it kufizohen vetëm me bërjen e një a dy kërkesash te API për Anashkalim Censurim. Pas kësaj, Meek-u ndalet dhe krejt kërkesat e mëtejshme ndaj rrjetit kryhen përmes rrjetit Tor.
zh_cn: 尽管攻击者很难发现 Meek 请求的去向，但对于某些用户来说，这仍然可能存在风险。因此，这是一项可选功能。使用 Meek 和非 Tor 网络请求仅限于向审查规避 API 发出一两个请求。然后 Meek 被停止，所有进一步的网络请求都通过 Tor 网络进行。

source: If you are uncomfortable with making a request that doesn't go over the Tor network, you can click "Network Settings" (or the Settings icon in the bottom right corner, followed by the Tor Settings tab in the screen that appears), and manually configure bridges. After you save any bridge settings, OnionShare will try to reconnect using those bridges.
sq: Nëse s’jeni rehat me bërjen e një kërkesë që s’kalon nëpër rrjetin Tor, mund të klikoni “Rregullime Rrjeti” (ose ikonën e Rregullimeve, në fund djathtas të ekranit, e më pas mbi skedën “Rregullime Tor-i” në skenën që pason) dhe të formësoni dorazi ura. Pasi të ruani rregullimet për çfarëdo ure, OnionShare do të provojë të rilidhet duke përdorur këto ura.
zh_cn: 如果您不方便发出不通过 Tor 网络的请求，您可以单击“网络设置”（或右下角的“设置”图标，然后在出现的屏幕中单击“Tor 设置”标签页），然后手动配置网桥。保存任何网桥设置后，OnionShare 将尝试使用这些网桥重新连接。

source: Manually configure Tor settings
sq: Formësoni dorazi rregullimet e Tor-it
zh_cn: 手动配置 Tor 设置

source: You can get to the Tor settings by clicking "Network Settings" on the welcome screen, or by clicking the "⚙" icon in the bottom-right corner of the application, and then switch to the Tor Settings tab in the screen that appears.
sq: Te rregullimet e Tor-it mund të kaloni duke klikuar “Rregullime Rrjeti” te skena e mirëseardhjes, ose duke klikuar ikonën “⚙” te cepi i poshtëm djathtas i aplikacionit, mandej kaloni te skeda e Rregullimeve të Tor-it, në skenën që pason.
zh_cn: 您可以通过单击欢迎屏幕上的“网络设置”进入 Tor 设置，或者单击应用程序右下角的“⚙”图标，然后在出现的屏幕中切换到 Tor 设置标签页。

source: Here are the different ways you can configure OnionShare to connect to Tor:
sq: Ja rrugët e ndryshme sipas të cilave mund të formësoni OnionShare-it të lidhet me Tor-in:
zh_cn: 以下是配置 OnionShare 连接到 Tor 的不同方法：

source: Use the Tor version built into OnionShare
sq: Përdorni versionin Tor të brendshëm të OnionShare-it
zh_cn: 使用 OnionShare 内置的 Tor 版本

source: This is the default, simplest and most reliable way that OnionShare connects to Tor. For this reason, it's recommended for most users.
sq: Kjo është parazgjedhja, rrufa më e thjeshtë dhe më e besueshme me të cilën OnionShare lidhet me Tor-in. Për këtë arsye, rekomandohet për shumicën e përdoruesve.
zh_cn: 此预设是让 OnionShare 连上 Tor 最简单可靠的方法，因此推荐给大多数使用者。

source: When you open OnionShare, it launches an already configured ``tor`` process in the background for OnionShare to use. It doesn't interfere with other ``tor`` processes on your computer, so you can use the Tor Browser or the system ``tor`` on their own.
sq: Kur hapni OnionShare-in, ky nis në prapaskenë një proces ``tor`` të formësuar tashmë që ta përdorë OnionShare-i. Nuk ngatërrohet me procese të tjerë ``tor`` në kompjuterin tuaj, kështu, mund të përdorni Shfletuesin Tor, ose sistemin ``tor``, secilin më vete.
zh_cn: 打开 OnionShare 时会在启动后台已设置好的 ``tor``进程，这个进程不会介入电脑中其它 tor 进程，所以Tor 浏览器或系统会使用自己的 tor 进程。

source: **Using bridges**
sq: **Përdorim urash**
zh_cn: **使用网桥**

source: To use a bridge, you must select "Use the Tor version built into OnionShare" and check the "Use a bridge" checkbox.
sq: Që të përdorni një urë, duhet të përzgjidhni “Përdor versionin Tor të brendshëm të OnionShare-it” dhe t’i vini shenjë kutizës “Përdor një urë”.
zh_cn: 要使用网桥，您必须选择“使用 OnionShare 内置的 Tor 版本”并选中“使用网桥”复选框。

source: Try using a built-in bridge first. Using `obfs4` or `snowflake` bridges is recommended over using `meek-azure`.
sq: Provoni të përdorni së pari një urë të brendshme. Rekomandohet përdorimi i urave `obfs4` ose `snowflake`, në vend të përdorimit të një ure.
zh_cn: 首先尝试使用内置网桥。建议使用 `obfs4` 或 `snowflake` 网桥，而不是使用 `meek-azure`。

source: If using a built-in bridge doesn't work, you can request a bridge from torproject.org. You will have to solve a CAPTCHA in order to request a bridge. (This makes it more difficult for governments or ISPs to block access to Tor bridges.)
sq: Nëse përdorimi i një ure të brendshme s’funksionon, mund të kërkoni një urë që nga torproject.org. Do t’ju duhet të zgjidhni një CAPTCHA, që të mund të kërkoni një urë. (Kjo e bën më të vështirë për qeveri apo ISP të bllokojnë hyrjen te ura Tor.)
zh_cn: 如果使用内置网桥不起作用，您可以从 torproject.org 请求网桥。您必须解决验证码才能请求网桥。（这使得政府或 ISP 更难阻止对 Tor 网桥的访问。）

source: You also have the option of using a bridge that you learned about from a trusted source.
sq: Keni gjithashtu mundësinë e përdorimit të një ure të cilën e mësuat nga një burim i besuar.
zh_cn: 您还可以选择使用从可靠来源了解到的网桥。

source: Attempt auto-configuration with Tor Browser
sq: Provo vetë-formësim me Shfletuesin Tor
zh_cn: 尝试使用 Tor 浏览器进行自动配置

source: If you have `downloaded the Tor Browser <https://www.torproject.org>`_ and don't want two ``tor`` processes running, you can use the ``tor`` process from the Tor Browser. Keep in mind you need to keep Tor Browser open in the background while you're using OnionShare for this to work.
sq: Nëse keni `shkarkuar Shfletuesin Tor <https://www.torproject.org>`_ dhe s’doni të keni në punë dy procese ``tor``, mund të përdorni procesin ``tor`` të Shfletuesit Tor. Që kjo të funksionojë, mos harroni se duhet të mbani hapur Shfletuesin Tor në prapaskenë, teksa përdorni OnionShare-in.
zh_cn: 如果您`已下载 Tor 浏览器 <https://www.torproject.org>`_ 并且不想运行两个 ``tor`` 进程，则可以使用 Tor 浏览器中的 ``tor`` 进程。请记住，在使用 OnionShare 时，您需要在后台保持 Tor 浏览器打开，才能实现此功能。

source: Using a system ``tor`` in Windows
sq: Përdorimi i një sistemit ``tor`` në Windows
zh_cn: 在 Windows 使用 ``tor`` 系统

source: This is fairly advanced. You'll need to know how edit plaintext files and do stuff as an administrator.
sq: Kjo është goxha e thelluar. Do t’ju duhet të dini të përpunoni kartela tekst të thjeshtë dhe të bëni gjëra përgjegjësi.
zh_cn: 这非常高端，需要会编辑纯文本文件与管理员工作权限。

source: Download the Tor Windows Expert Bundle `from the Tor website <https://www.torproject.org/download/tor/>`_. Extract the compressed file and copy the extracted folder to ``C:\Program Files (x86)\`` Rename the extracted folder with ``Data`` and ``Tor`` in it to ``tor-win32``.
sq: Shkarkoni “Tor Windows Expert Bundle” `që nga sajti i Tor-it <https://www.torproject.org/download/tor/>`_. Çngjesheni kartelën e ngjeshur dhe kopjoni dosjen e përftuar te ``C:\Program Files (x86)\`` Riemërtojeni dosjen e përftuar si ``Data`` dhe ``Tor`` në të si ``tor-win32``.
zh_cn: `从 Tor 网站 <https://www.torproject.org/zh-CN/download/tor/>`_ 下载适用于 Windows 的 Tor 专家包。解压缩文件并将解压缩的文件夹复制到 ``C:\Program Files (x86)\`` 中，将包含 ``Data`` 和 ``Tor`` 的解压缩文件夹重命名为 ``tor-win32``。

source: Make up a control port password. (Using 7 words in a sequence like ``comprised stumble rummage work avenging construct volatile`` is a good idea for a password.) Now open a command prompt (``cmd``) as an administrator, and use ``tor.exe --hash-password`` to generate a hash of your password. For example::
sq: Sajoni një fjalëkalim porte kontrolli. (Përdorimi i 7 fjalëve në një varg të ngjashëm ``ngjeshur hasa ripërtypje punë hakmarrje konstrukt fluturake`` është një ide e mirë për një fjalëkalim.) Tani hapni një rresht urdhrash (``cmd``) si përgjegjës dhe përdorni ``tor.exe --hash-password`` që të prodhoni një hash të fjalëkalimit tuaj. Për shembull::
zh_cn: 設一个控制端密码 (例如使用7 个连续单字, 像``comprised stumble rummage work avenging construct volatile``就是个好密码。)以管理员帐户打开命令行 (``cmd``)，使用``tor.exe --hash-password`` 指令产生密码哈希，例如::

source: The hashed password output is displayed after some warnings (which you can ignore). In the case of the above example, it is ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.
sq: Përfundimi për hashin e fjalëkalimit shfaqet pas disa sinjalizimesh (të cilat mund t’i shpërfillni). Në rastin e shembullit më sipër, ky është ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.
zh_cn: 在一串可忽视的警告之后，会出现哈希密码结果，例如在上述示范中密码为 ``16:00322E903D96DE986058BB9ABDA91E010D7A863768635AC38E213FDBEF``.

source: Now create a new text file at ``C:\Program Files (x86)\tor-win32\torrc`` and put your hashed password output in it, replacing the ``HashedControlPassword`` with the one you just generated::
sq: Tani krijoni një kartelë tekst të re te ``C:\Program Files (x86)\tor-win32\torrc`` dhe vëreni përfundimin hash të fjalëkalimit në të, duke zëvendësuar ``HashedControlPassword`` me atë që sapo prodhuat::
zh_cn: 在``C:\Program Files (x86)\tor-win32\torrc`` 创建新文本档，存入新生成的哈希密码並替换文件 ``HashedControlPassword`` ::

source: In your administrator command prompt, install ``tor`` as a service using the appropriate ``torrc`` file you just created (as described in `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). Like this::
sq: Te rreshti i urdhrave për përgjegjësin, instaloni ``tor`` si një shërbim, duke përdorur kartelën e duhur ``torrc`` që sapo krijuar (siç përshkruhet te `<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). Kështu::
zh_cn: 在管理员命令行中 ，安装``tor``服务可利用新建的``torrc`` 予以适当指令 (介绍于`<https://2019.www.torproject.org/docs/faq.html.en#NTService>`_). 像这样::

source: You are now running a system ``tor`` process in Windows!
sq: Tani po xhironi një proces sistemi ``tor`` në Windows!
zh_cn: 现已顺利在 Windows 运行``tor``进程!

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using control port", and set "Control port" to ``127.0.0.1`` and "Port" to ``9051``. Under "Tor authentication settings" choose "Password" and set the password to the control port password you picked above. Click the "Test Connection to Tor" button. If all goes well, you should see "Connected to the Tor controller".
sq: Hapni OnionShare-in, klikoni ikonën “⚙” në të dhe kaloni te skeda Rregullime Tor-i. Nën “ Si duhet të lidhet me Tor-in OnionShare-i?", zgjidhni “Lidhu duke përdorur portë kontrolli” dhe si “Portë kontrolli” vini ``127.0.0.1``dhe si “Portë” ``9051``. Nën “Rregullime mirëfilltësimi Tor”, zgjidhni “Fjalëkalim” dhe si fjalëkalim vini fjalëkalimin për portë kontrolli që zgjodhët më sipër. Klikoni butonin “Provo Lidhjen me Tor-in”. Nëse gjithçka ecën mirë, duhet të shini “I lidhur me kontrollorin e Tor-it”.
zh_cn: 打开 OnionShare，点击其中的“⚙”图标，切换到 Tor 设置标签页。在“OnionShare 应如何连接到 Tor？”下，选择“使用控制端口连接”，并将“控制端口”设置为 ``127.0.0.1``，将“端口”设置为 ``9051``。在“Tor 验证设置”下，选择“密码”，并将密码设置为您上面选择的控制端口密码。点击“测试与 Tor 的连接”按钮。如果一切顺利，您应该会看到“已连接到 Tor 控制器”。

source: Using a system ``tor`` in macOS
sq: Përdorimi i një sistemi ``tor`` në macOS
zh_cn: macOS 使用 ``tor``系统

source: First, install `Homebrew <https://brew.sh/>`_ if you don't already have it, and then install Tor::
sq: Së pari, instalon `Homebrew <https://brew.sh/>`_, nëse s’e keni tashmë dhe mandej instaloni Tor-in::
zh_cn: 如果没有`Homebrew <https://brew.sh/>`请先安装，再安装 Tor::

source: Now configure Tor to allow connections from OnionShare::
sq: Tani formësoni Tor-in të lejojë lidhje nga OnionShare::
zh_cn: 现在调配 Tor 以便让 OnionShare 可连接:

source: And start the system Tor service::
sq: Dhe nisni shërbimin e sistemit Tor::
zh_cn: 启动系统的 Tor 服务::

source: Open OnionShare, click the "⚙" icon in it, and switch to the Tor Settings tab. Under "How should OnionShare connect to Tor?" choose "Connect using socket file", and set the socket file to be ``/usr/local/var/run/tor/control.socket``. Under "Tor authentication settings" choose "No authentication, or cookie authentication". Click the "Test Connection to Tor" button.
sq: Hapni OnionShare-in, klikoni mbi ikonën “⚙” në të dhe kaloni te skeda “Rregullime Tor-i”. Nën “Si duhet të lidhet me Tor-in OnionShare-i?” zgjidhni “Lidhu duke përdorur një kartelë “socket”” dhe si kartelë “socket” vini ``/usr/local/var/run/tor/control.socket``. Nën “Rregullime mirëfilltësimi Tor” zgjidhni “Pa mirëfilltësim, ose mirëfilltësim me “cookie””. Klikoni mbi butonin “Provo Lidhjen me Tor-in”.
zh_cn: 打开 OnionShare，点击其中的“⚙”图标，切换到 Tor 设置标签页。在“OnionShare 应如何连接到 Tor？”下选择“使用 Socket 文件连接”，并将 Socket 文件设置为 ``/usr/local/var/run/tor/control.socket``。在“Tor 验证设置”下选择“无验证或 Cookie 验证”。点击“测试与 Tor 的连接”按钮。

source: If all goes well, you should see "Connected to the Tor controller".
sq: Nëse gjithçka shkon mbarë, do të duhej të shihnit “I lidhur me kontrollorin Tor”.
zh_cn: 如果一切顺利，会出现"Connected to the Tor controller"消息。

source: Using a system ``tor`` in Linux
sq: Përdorimi i një sistemi ``tor`` në Linux
zh_cn: Linux 使用 ``tor``系统

source: First, install the ``tor`` package. If you're using Debian, Ubuntu, or a similar Linux distro, It is recommended to use the Tor Project's `official repository <https://support.torproject.org/apt/tor-deb-repo/>`_.
sq: Së pari, instaloni paketën ``tor``. Nëse përdorni Debian, Ubuntu, ose një shpërndarje Linux të ngjashme, rekomandohet të përdoret depoja zyrtare e Projektit Tor `official repository <https://support.torproject.org/apt/tor-deb-repo/>`_.
zh_cn: 首先，安装 ``tor`` 软件包。如果您使用的是 Debian、Ubuntu 或类似的 Linux 发行版，建议使用 Tor Project 的`官方存储库 <https://support.torproject.org/apt/tor-deb-repo/>`_。

source: Next, add your user to the group that runs the ``tor`` process (in the case of Debian and Ubuntu, ``debian-tor``) and configure OnionShare to connect to your system ``tor``'s control socket file.
sq: Më pas shtojeni përdoruesin tuaj te grupi që xhiron procesin ``tor`` (në rastin e Debian-it dhe Ubuntu-së, ``debian-tor``) dhe formësojeni OnionShare-in të lidhet te kartela “socket” e kontrollit të sistemit tuaj ``tor``.
zh_cn: 接着将用户加入可运行``tor``进程的群组(Debian/ Ubuntu 则使用 ``debian-tor``)，设置 OnionShare 连接系统的``tor`` control socket 文档。

source: Add your user to the ``debian-tor`` group by running this command (replace ``username`` with your actual username)::
sq: Shtoni përdoruesin tuaj te grupi ``debian-tor`` duke ekzekutuar këtë urdhër (zëvendësoni ``username`` me emrin tuaj faktik të përdoruesit::
zh_cn: 要将用户加到``debian-tor`` 群组请运行以下命令(请把 ``username`` 改成你的 username)::
